Repository: texta-tk/texta-tk.github.io
Catalog: locale/*/LC_MESSAGES/anonymizer.po
Languages: et

source: Anonymizer is a tool for anonymizing names in a text based on a predefined list of names. Each name detected from the text will be substituted with randomly generated pair of initials.
et: Anonymizer (Anonüümija) on tööriist vabatekstis esinevate isikunimede nimekirja alusel anonüümimiseks. Iga tekstist tuvastatud nimekirjas leiduv nimi asendatakse juhuslikult genereeritud initsiaalidega.

source: The current version of Anonymizer `fully` supports only texts in **Estonian**.
et: Anonymizer toetab hetkel `täielikult` üksnes **eestikeelsete** tekstide anonüümimist.

source: If parameters `replace_single_last_names` and/or `replace_single_first_names` are activated, all given last and first names found from the text are anonymized - even if they are actually part of another name not given in the list of anonymizable names.
et: Paraneetrite `replace_single_last_names` ja/või `replace_single_first_names` aktiveerimisel anonüümitakse kõik nimekirjaga kattuvad ees- ja perekonnanimed, isegi kui need on tegelikult osa mõnest teisest (nimekirja mittekaasatud) nimest.

source: **Example**:
et: **Näide**:

source: **API reference**: `<http://localhost:8000/api/v1/redoc/#tag/projects-greater-anonymizers>`_
et: **API viide**: `<http://localhost:8000/api/v1/redoc/#tag/projects-greater-anonymizers>`_

source: Creation
et: Loomine

source: Parameters
et: Parameetrid

source: Name of the Anonymizer model.
et: Anonüümija mudeli nimi.

source: Minimum required `Jaro-Winkler similarity <https://en.wikipedia.org/wiki/Jaro%E2%80%93Winkler_distance>`_ between names present in the text and names to anonymize, i.e. how different any two names can be for the model to presume they are meant to represent the same name.
et: Minimaalne tekstist leitud nime ning nimekirja kaasatud nime `Jaro-Winkleri sarnasus<https://en.wikipedia.org/wiki/Jaro%E2%80%93Winkler_distance>`_ ehk kui sarnane peab olema kahe nime kirjapilt, et mudel need samaks tunnistaks.

source: Used only if parameter `replace_misspelled_names` is activated.
et: Kasutatakse üksnes siis, kui parameeter `replace_misspelled_names` on aktiveeritud.

source: Anonyymize incorrectly spelled names.
et: Aktiveerimisel anonüümitakse ka vigase kirjapildiga nimed.

source: Might sometimes lead to falsely anonymizing irrelevant entities as the model doesn't know how to distinguish incorrect spelling of a name from a correctly spelled similar other name. E.g. ("Eastwood", "Eestwood") vs. ("Ahto", "Ahti").
et: Parameetri aktiveerimine võib vahel tingida valede nimede (või muude olemite) anonüümimise, kuna mudel ei oska eristada vale kirjapildiga nö. õiget nime õige kirjapildiga piisavalt sarnasest valest nimest. Nt. ("Eastwood", "Eestwood") vs. ("Ahto", "Ahti").

source: Anonymize last names if they occur without first name.
et: Aktiveerimisel anonüümitakse ilma eesnimeta esinevad perenimed.

source: Anonymize first names if they occur without last name.
et: Aktiveerimisel anonüümitakse ilma perenimeta esinevad eesnimed.

source: Automatically adjust misspelling threshold if any two names in the given list to anonymize are more similar than configured `misspelling_threshold` to avoid collision errors.
et: Aktiveerimisel suurendatakse parameetrit `misspelling_threshold` automaatselt juhul, kui suvalise kahe nimekirjas antud anonüümitava nime sarnasus on suurem kui seadistatud `misspelling_threshold`, et vältida nime `x` anonüümimist nime `y` initsiaalidega (või `vice versa`).

source: For creating a new Anonymizer, navigate to `"Tools" -> "Anonymizer"` as seen in :numref:`anonymizer_nav`.
et: Uue anonüümimismudeli loomiseks navigeeri ülemisel menüüribal `"Tools" -> "Anonymizer"` nagu kujutatud joonisel :numref:`anonymizer_nav`.

source: *Anonymizer navigation*
et: *Navigatsioon Anonymizeri tööriistani*

source: If the navigation is successful, you should see a panel similar to :numref:`anonymizer_create_button` with `"Create"` button in the top left corner of the page.
et: Eduka navigatsiooni korral avaneb joonisel :numref:`anonymizer_create_button` kujutatud lehekülg, mille ülemises vasakus nurgas asub nupp nimega `"Create"`.

source: *Anonymizer creation button*
et: *Anonüümija loomisnupp `"Create"`.*

source: Clicking on the `"Create"` button opens a modal window with text `"New Anonymizer"` as depicted in :numref:`anonymizer_new_anonymizer`.
et: `"Create"` nupule vajutamine avab uue akna pealkirjaga `"New Anonymizer"` nagu kujutatud joonisel :numref:`anonymizer_new_anonymizer`.

source: *Empty Anonymizer creation view*
et: *Anonüümija loomisaken*

source: Name your Anonymizer model by filling the field `Description` and modify defaulted parameters. Click on the `"Create"` button in the bottom right corner of the window (:numref:`anonymizer_create_view`).
et: Täida väli `Description` ja muuda soovi korral vaikeparameetrite väärtusi. Vajuta nupule `"Create"` akna alumises vasakus nurgas (:numref:`anonymizer_create_view`).

source: *Filled Anonymizer creation view*
et: *Anonüümija loomine*

source: The created Anonymizer can now be seen as the first (or only, if no previous Anonymizers exist under the project) row in the table of Anonymizers (:numref:`anonymizer_list`).
et: Loodud anonüümija kuvatakse nüüd anonüümimijate tabeli kõige ülemisel (või ainsal) real (:numref:`anonymizer_list`).

source: *List of Anonymizers.*
et: *Anonymizeri mudelite nimekiri*

source: Reference: `<http://localhost:8000/api/v1/redoc/#operation/projects_anonymizers_create>`_
et: Viide: `<http://localhost:8000/api/v1/redoc/#operation/projects_anonymizers_create>`_

source: Endpoint: **/projects/{project_pk}/anonymizers/**
et: Otspunkt: **/projects/{project_pk}/anonymizers/**

source: Example:
et: Näide:

source: Usage
et: Kasutamine

source: Texts to anonymize.
et: Anonüümitavad tekstid.

source: List of names to anonymize.
et: Nimekiri anonüümitavatest nimedest.

source: Each name should be formatted followingly: "<last_name>, <first_name>"
et: Iga nimekirjas olev nimi peab olema vormindatud järgnevalt: "<perenimi>, <eesnimi>"

source: For using an existing Anonymizer to anonymize a text, navigate to `"Tools" -> "Anonymizer"` as seen in :numref:`anonymizer_nav`. After successful navigation, you should see a list of existing Anonymizers. Select the Anonymizer you wish to use for the anonymization and navigate to options panel as seen in :numref:`anonymizer_actions_0`.
et: Teksti anonüümimiseks navigeeri menüüribal kõigepealt anonüümimismudelite lehele: `"Tools" -> "Anonymizer"` nagu kujutatud joonisel :numref:`anonymizer_nav`. Eduka navigatsiooni tagajärjel avaneb vaade anonüümimismudelite nimekirjast. Vali mudel, mida soovid anonüümimiseks kasutada ning ava seejärel valikmenüü klikkides kolmele vertikaalsele punktile vastava anonüümimismudeli rea lõpus (:numref:`anonymizer_actions_0`).

source: *Anonymizer options panel location.*
et: *Anonüümimismudeli valikmenüü asukoht*

source: After clicking on the three vertical dots denoting `"Options"`, a small selection menu opens as seen in :numref:`anonymizer_actions_1`. Select option `"Anonymize text"`.
et: Vali menüüst `"Anonymize text"` (:numref:`anonymizer_actions_1`).

source: Clicking on the option opens a new modal window with the title `"Anonymize text"` and two input fields: `"text"` and `"names"` (:numref:`anonymize_text_empty`).
et: Klikkimise tagajärjel avaneb uus aken pealkirjaga `"Anonymize Text"`, mis sisaldab kahte sisendväljaga: `"text"` (tekst) ja `"names"` (nimed) (:numref:`anonymize_text_empty`).

source: *Empty "Anonymize text" window.*
et: *Tühi "Anonymize text" vaade.*

source: Insert the text you wish to anonymize in the field `"text"` and insert a list of newline-separated anonymizable names in format `"last_name, first_name"` in the field below (:numref:`anonymize_text_pre`).
et: Sisesta tekst, mida soovid anonüümida, väljale `"text"` ning selle all asetsevale väljale reavahetusega eraldatud nimekiri anonüümitavatest nimedest formaadis `"perenimi, eesnimi"` (:numref:`anonymize_text_pre`).

source: *Filled "Anonymize text" window.*
et: *"Anonymize text" vaade pärast sisendväljade täitmist.*

source: Click on the `"Submit"` button in the bottom right corner. The resulting text with anonymized names should appear instantly below the same panel (:numref:`anonymize_text_post`).
et: Vajuta nupule `"Submit"` akna alumises paremas nurgas. Anonüümitud tekst ilmub sama akna alumisse äärde (:numref:`anonymize_text_post`).

source: *"Anonymize Text" result.*
et: *Anonüümitud tekst.*

source: Reference: `<http://localhost:8000/api/v1/redoc/#operation/projects_anonymizers_anonymize_text>`_
et: Viide: `<http://localhost:8000/api/v1/redoc/#operation/projects_anonymizers_anonymize_text>`_

source: Endpoint **/projects/{project_pk}/anonymizers/{id}/anonymize_text/**
et: Otspunkt **/projects/{project_pk}/anonymizers/{id}/anonymize_text/**

source: Response:
et: Vastus:

source: Function `"Anonymize Text"` allows anonymizing multiple texts at once. The order of the texts is preserved during anonymization, i.e. if source text `t` is located at position `i` in the input array, then the anonymized version of the same text is located at position `i` in the result array.
et: Funktsioon `"Anonymize Text"` võimaldab mitme teksti üheaegset anonüümimist. Tulemuseks saadud anonüümitud tekstide järjekord ühtib vastavate sisendtekstide järjekorraga, st. kui sisendtekst `t` asub positsioonil `i`, siis väljundis asub vastava teksti anonüümitud versioon samuti positsioonil `i`.

source: List of texts to anonymize.
et: Nimekiri anonüümitavatest tekstidest.

source: If activated, same names across different texts are anonymized with the same replacement symbols.
et: Aktiveerimisel kasutatakse erinevates tekstides nime anonüümimisel alati sama asendussümbolit.

source: Reference: `<http://localhost:8000/api/v1/redoc/#operation/projects_anonymizers_anonymize_texts>`_
et: Viide: `<http://localhost:8000/api/v1/redoc/#operation/projects_anonymizers_anonymize_texts>`_

source: Endpoint **/projects/{project_pk}/anonymizers/{id}/anonymize_texts/**
et: Otspunkt **/projects/{project_pk}/anonymizers/{id}/anonymize_texts/**

source: For editing an existing Anonymizer, select the Anonymizer you wish to edit and navigate to options by clicking on the three vertical dots at the end of the Anonymizer row.
et: Anonüümimismudeli muutmiseks kliki vastava mudeli rea lõpus olevale kolmele vertikaalsele punktile.

source: Reference: `<http://localhost:8000/api/v1/redoc/#operation/projects_anonymizers_update>`_
et: Viide: `<http://localhost:8000/api/v1/redoc/#operation/projects_anonymizers_update>`_

source: Endpoint **/projects/{project_pk}/anonymizers/{id}/**
et: Otspunkt **/projects/{project_pk}/anonymizers/{id}/**

source: For deleting an existing Anonymizer, select the Anonymizer(s) you wish to delete by clicking on the selection box(es) in front of the Anonymizer(s). If the Anonymizer(s) you wish to delete is (are) selected, click on the red recycle bin icon above the Anonymizers' table (:numref:`anonymizer_delete`).
et: Anonüümija kustutamiseks tee märge kõikide mudelite ette, mida kustutada soovid. Seejärel vajuta punasele prügikasti ikoonile anonüümimismudelite tabeli kohal. (:numref:`anonymizer_delete`).

source: *Delete Anonymizer*
et: *Anonüümija kustutamine*

source: The application should ask your confirmation before deleting the Anonymizer(s) (:numref:`anonymizer_delete_confirm`). Click on the `Delete` button at the bottom right corner of the confirmation window to finalize the process.
et: Enne mudeli lõplikku kustutamist, küsib rakendus töö lõpetamiseks kinnitust (:numref:`anonymizer_delete_confirm`). Vajuta kinnitamiseks kinnitusaknas nupule "`Delete`".

source: *Delete Anonymizer confirmation*
et: *Anonüümimismudeli kustutamise kinnitusaken*

source: References:
et: Viited
