Repository: texta-tk/texta-tk.github.io
Catalog: locale/*/LC_MESSAGES/api.po
Languages: et

source: Tutorial: Using Toolkit via API
et: Juhend Toolkiti API kasutamine

source: The purpose of this tutorial is to get you started with using Toolkit API. The tutorial gives you an overview of the most fundamental API operations together with illustrating examples. For more detailed documentations please see :ref:`API reference <api_reference>`.
et: Selle juhendi eesmärk on õpetada, kuidas teha algust TEXTA Toolkiti API-ga. Juhend annab ülevaate kõige põhilistemast API operatsioonidest koos illustreerivate näidetega. Detailsemat dokumentatsiooni näeb :ref:`API viitest <api_reference>`.

source: Health of Toolkit
et: Toolkiti seisund

source: For checking the health of a running Toolkit instance, one can access the **/health** endpoint for operating statistics. The endpoint responds with information abouth the availability of services (e.g. Elasticsearch and TEXTA MLP) and system resources (e.g. disk, memory, GPU usage, etc.).
et: Töötava Toolkiti seisundit saab uurida statistika opereerimise **/health** otspunktis (endpoint). Sealt saab kätte teenuste (e.g. Elasticsearch and TEXTA MLP) ja süsteemi ressursside (nt diski, mälu, GPU kasutus jne) kättesaadavuse info.

source: Registration
et: Registreerimine

source: Endpoint: **/rest-auth/registration/**
et: Otspunkt (endpoint): **/rest-auth/registration/**

source: Example:
et: Näide:

source: Response:
et: Vastus (response):

source: Response is the Token key that you will later need to authenticate requests.
et: Vastus (response) on see Tokeni võti (Token key), mida hiljem tuleb kasutada päringute autentiseerimiseks.

source: Logging in
et: Sisse logimine

source: Endpoint: **/rest-auth/login/**
et: Otspunkt: **/rest-auth/login/**

source: Projects
et: Projektid

source: Create a new project
et: Loo uus projekt

source: Endpoint: **/projects/**
et: Otspunkt: **/projects/**

source: Anonymizers
et: Anonüümijad

source: Create a new anonymizer
et: Loo uus anonüümija

source: Endpoint: **/projects/{project_pk}/anonymizers/**
et: Otspunkt: **/projects/{project_pk}/anonymizers/**

source: Anonymize text
et: Anonüümi tekst

source: Endpoint **/projects/{project_pk}/anonymizers/{id}/anonymize_text/**
et: Otspunkt: **/projects/{project_pk}/anonymizers/{id}/anonymize_text/**

source: Anonymize texts
et: Anonüümi tekstid

source: Endpoint **/projects/{project_pk}/anonymizers/{id}/anonymize_texts/**
et: Otspunkt: **/projects/{project_pk}/anonymizers/{id}/anonymize_texts/**

source: Apply MLP to texts
et: MLP rakendamine tekstidel

source: Endpoint: **/mlp/texts/**
et: Otspunkt: **/mlp/texts/**

source: Embeddings
et: Sõnavektorid

source: Train a new embedding
et: Treeni uus sõnavektorite mudel

source: Endpoint: **/projects/{project_pk}/embeddings/**
et: Otspunkt: **/projects/{project_pk}/embeddings/**

source: Taggers
et: Märgendajad (Taggers)

source: Train a new tagger
et: Treeni uus Tagger

source: Endpoint: **/projects/{project_pk}/taggers/**
et: Otspunkt: **/projects/{project_pk}/taggers/**

source: Tag text
et: Märgenda tekst

source: Endpoint **/projects/{project_pk}/taggers/{id}/tag_text/**
et: Otspunkt: **/projects/{project_pk}/taggers/{id}/tag_text/**

source: Regex Taggers
et: Mustripõhised märgendajad (Regex Taggers)

source: Create a new Regex Tagger
et: Loo uus mustripõhine märgendaja

source: Endpoint: **/projects/{project_pk}/regex_taggers/**
et: Otspunkt: **/projects/{project_pk}/regex_taggers/**

source: Tag doc
et: Märgenda dokument

source: Endpoint **/projects/{project_pk}/regex_taggers/{id}/tag_doc/**
et: Otspunkt: **/projects/{project_pk}/regex_taggers/{id}/tag_doc/**

source: Tag random doc
et: Märgenda juhuslik dokument

source: Endpoint **/projects/{project_pk}/regex_taggers/{id}/tag_random_doc/**
et: Otspunkt: **/projects/{project_pk}/regex_taggers/{id}/tag_random_doc/**

source: Endpoint **/projects/{project_pk}/regex_taggers/{id}/tag_text/**
et: Otspunkt: **/projects/{project_pk}/regex_taggers/{id}/tag_text/**

source: Tag texts
et: Märgenda tekstid

source: Endpoint **/projects/{project_pk}/regex_taggers/{id}/tag_texts/**
et: Otspunkt: **/projects/{project_pk}/regex_taggers/{id}/tag_texts/**

source: Train a new tagger group
et: Treeni uus Tagger Group

source: Endpoint: **/projects/{project_pk}/tagger_groups/**
et: Otspunkt: **/projects/{project_pk}/tagger_groups/**

source: Endpoint: **/projects/{project_pk}/tagger_groups/{id}/tag_text/**
et: Otspunkt: **/projects/{project_pk}/tagger_groups/{id}/tag_text/**

source: Regex Tagger Groups
et: Mustripõhiste märgendajate grupid

source: Create a new regex tagger group
et: Loo uus mustripõhiste märgendajajate grupp

source: Endpoint: **/projects/{project_pk}/regex_tagger_groups/**
et: Otspunkt: **/projects/{project_pk}/regex_tagger_groups/**

source: Apply regex tagger group
et: Rakenda mustripõhiste märgendajate gruppi

source: Endpoint: **/projects/{project_pk}/regex_tagger_groups/{id}/apply_tagger_group/**
et: Otspunkt: **/projects/{project_pk}/regex_tagger_groups/{id}/apply_tagger_group/**

source: Endpoint: **/projects/{project_pk}/regex_tagger_groups/{id}/tag_doc/**
et: Otspunkt: **/projects/{project_pk}/regex_tagger_groups/{id}/tag_doc/**

source: Endpoint: **/projects/{project_pk}/regex_tagger_groups/{id}/tag_random_doc/**
et: Otspunkt: **/projects/{project_pk}/regex_tagger_groups/{id}/tag_random_doc/**

source: Endpoint: **/projects/{project_pk}/regex_tagger_groups/{id}/tag_text/**
et: Otspunkt: **/projects/{project_pk}/regex_tagger_groups/{id}/tag_text/**

source: Endpoint: **/projects/{project_pk}/regex_tagger_groups/{id}/tag_texts/**
et: Otspunkt: **/projects/{project_pk}/regex_tagger_groups/{id}/tag_texts/**

source: Train a new Torch Tagger
et: Treeni uus Torch Tagger

source: Endpoint: **/projects/{project_pk}/torchtaggers/**
et: Otspunkt: **/projects/{project_pk}/torchtaggers/**

source: Endpoint: **/projects/{project_pk}/torchtaggers/{id}/tag_text/**
et: Otspunkt: **/projects/{project_pk}/torchtaggers/{id}/tag_text/**

source: Dataset Importer
et: Andmete Importija (Dataset Importer)

source: This module allows the user to insert jsonlines, csv and excel files into Elasticsearch to make them accessible by the Toolkit. Please note that this process reads the whole file into the memory and can thus create memory issues when trying to process bigger files, it is advisable to split such files up into smaller chunks and process each one separately.
et: Selle mooduli abil saab kasutaja sisestada Elasticsearchi jsonlines, csv ja exceli formaadis faile, muutes need niimoodi Toolkitile ligipääsetavaks. Palun pane tähele, et see loeb kogu faili mällu, mis võib põhjustada mäluprobleeme, kui üritatakse üles laadida suuremaid faile. Soovitame taolised suured failid jagada väiksemateks tükkideks ja neid siis eraldi üles laadida.

source: This whole process is asynchronous so the response to the call will be instantaneous and it since it takes a bit time to load the file into the memory, the first 10 seconds might not display any signs of the progress changing.
et: Kogu protsess on asünkroonne. St, päringu vastus võib tulla koheselt, kuid faili mällu laadimine võib võtta natukene rohkem aega. Esimese 10 sekundi jooksul ei pruugi olla näha mingeid muutuseid progressis.

source: Parameters:
et: Parameetrid:

source: description - Normal description to separate any given task from the other ones.
et: description - Tavaline kirjeldus, mis aitab eristada antud ülesannet teistest.

source: index - Name of the newly created index, please note that Elasticsearch index naming restrictions apply.
et: index - Vastloodud indeksi kirjeldus. Palun pane tähele, et sellel kehtivad Elasticsearch-i indeksi nimetamise piirangud.

source: separator - Only needed for .csv files, defaults to a coma (,). Allows to configure the separator for csv files.
et: separator - Vajalik vaid .csv failide puhul, vaikimisi on koma (,). Laseb seadistada .csv failide eraldajat.

source: @ is special syntax for reading the binary of the given file name.
et: @ on eriline süntaksimärk, millega saab lugeda antud failinime binaari.

source: Browsable API
et: Lehitsetav (browsable) API

source: API Reference
et: API viide (reference)

source: Reference for Toolkit API is available when running the Toolkit:
et: Viide Toolkiti API-le on kättesaadav, kui Toolkit töötab:
