Repository: texta-tk/texta-tk.github.io
Catalog: locale/*/LC_MESSAGES/authentication.po
Languages: et

source: Authentication
et: Autentimine

source: To use Texta Toolkit, you must first need to authenticate with either:
et: Texta Toolkiti kasutamiseks, peab ennast esiteks autentima:

source: Through :ref:`UAA <uaa_concept>` (Disabled by default) (see :numref:`login` item 1)
et: Läbi :ref:`UAA <uaa_concept>` (vaikimisi maha keeratud) (see :numref:`login` valik 1)

source: By creating a new Texta Toolkit account (see :numref:`login` item 2)
et: või luues Texta Toolkitti konto (vaata :numref:`login` valik 2)

source: *Login Screen at Startup*
et: *Logimisvaade alustades*

source: Registration
et: Registreerimine

source: Endpoint: **/rest-auth/registration/**
et: Otspunkt: **/rest-auth/registration/**

source: Example:
et: Näide:

source: Response:
et: Vastus:

source: Response is the Token key that you will later use to authenticate requests.
et: Vastuseks on võti, mida hiljem saab kasutada päringute autentimiseks.

source: Logging in
et: Sisse logimine

source: Initial superuser account:
et: Esialgne superkasutaja konto:

source: *username:* admin
et: *kasutajanimi:* admin

source: *password:* 1234
et: *parool:* 1234

source: Endpoint: **/rest-auth/login/**
et: Otspunkt: **/rest-auth/login/**

source: Third-Party Authentication
et: Kolmanda osapoole autentimine

source: Toolkit can also be authenticated using :ref:`UAA <uaa_concept>` provided by `CloudFoundry <https://docs.cloudfoundry.org/concepts/architecture/uaa.html>`_. This requires some configuration, both on the UAA server and in Toolkit.
et: Toolkiti saab autentida ka kasutades :ref:`UAA-d <uaa_concept>`, mida pakub `CloudFoundry <https://docs.cloudfoundry.org/concepts/architecture/uaa.html>`_. See nõuab veidi konfigureerimist nii UAA serveris kui ka Toolkitis.

source: Configuring the UAA server locally
et: UAA serveri lokaalne konfigureerimine

source: The UAA server will require configuring a client application for toolkit, eg setting the ``redirect_uri``. An example "login" client is already provided in UAA by default, which will be used for the example.
et: UAA serveris on vaja konfigureerida kliendi rakendust (Toolkitti), määrates ``redirect_uri`` väärtuse. "Login" kliendi näide on juba UAA poolt vaikimisi kaasa antud. Selle näite jaoks on seda sama kasutatud.

source: First, deploy the UAA server locally and install the CF UAA Command Line Client (UAAC) as detailed `here <https://docs.cloudfoundry.org/concepts/architecture/uaa.html#quickstart>`_.
et: Esiteks paigalda UAA server lokaalselt ja installi CF UAA Command Line Client (UAAC) nagu on kirjeldatud `siin <https://docs.cloudfoundry.org/concepts/architecture/uaa.html#quickstart>`_.

source: Target the local UAA server by running ``$ uaac target http://localhost:8080/uaa``
et: Jooksuta ``$ uaac target http://localhost:8080/uaa``

source: Authenticate as the default "admin" client by running ``$ uaac token client get admin -s adminsecret``
et: Autendi vaikimisi "admin" klient, jooksutades ``$ uaac token client get admin -s adminsecret``

source: Update the example "login" client's ``redirect_uri`` by running ``$ uaac client update login --redirect_uri http://localhost:8000/api/v1/uaa/callback``.
et: Uuenda näidis "login" kliendi`redirect_uri`` jooksutades ``$ uaac client update login --redirect_uri http://localhost:8000/api/v1/uaa/callback``.

source: Now authenticate as the example "login" client by running ``$ uaac token client get login -s loginsecret``
et: Nüüd autendi ennast kui näidis "login" klient jooksutades ``$ uaac token client get login -s loginsecret``

source: Create a new example user by running ``uaac user add test1 --emails test1@test1.com --password test1``
et: Loo uus näidiskasutaja jooksutades ``uaac user add test1 --emails test1@test1.com --password test1``

source: The UAA server is now configured. One can already send a request to the ``redirect_uri`` callback through logging in the UAA server using the **/uaa/oauth/authorize** OAuth endpoint of the UAA server.
et: UAA server on nüüd konfigureeritud. Testimiseks võib saata päring ``redirect_uri``-le logides UAA serverisse **/uaa/oauth/authorize** OAuth otspunkti kaudu.

source: The **oauth/authorize** URL needs to be sent with the proper parameters:
et: **oauth/authorize** URL-ile peab saatma päringu õigete parameetritega:

source: To break it down:
et: Lahtiseletatult:

source: ``response_type=code`` Lets the server know to add a code in response.
et: ``response_type=code`` annab serverile teada, et vastusesse tuleb lisada kood.

source: ``client_id=login`` Is the name/id of the client application on the UAA server/
et: ``client_id=login`` on kliendi rakenduse nimi/id UAA-s.

source: ``scope=openid`` Is the OAuth scope which toolkit uses in order to authenticate/create the user on Toolkit's side with the email and password.
et: ``scope=openid``on OAuth-i 'scope', mida Toolkit kasutab, et autentida või luua emaili ja parooliga kasutaja Toolkiti poolele.

source: ``redirect_uri=http%3A%2F%2Flocalhost%3A8000%2Fapi%2Fv1%2Fuaa/callback`` is the same ``redirect_uri`` set on the client application before, except its encoded in order to use it as a parameter.
et: ``redirect_uri=http%3A%2F%2Flocalhost%3A8000%2Fapi%2Fv1%2Fuaa/callback`` on sama ``redirect_uri``, mis ennist määratud kliendi rakendusele, ainult, et see on nüüd kodeeritud, et seda saaks kasutada parameetrina.

source: For further reference: - https://docs.cloudfoundry.org/api/uaa/version/74.24.0/index.html - https://www.oauth.com/
et: Rohkem infot saab siit: - https://docs.cloudfoundry.org/api/uaa/version/74.24.0/index.html - https://www.oauth.com/

source: **NOTE:** One caveat one might encounter is getting authentication errors when trying to log in with the email. Even though the log in form asks for the "email" and "password", it actually sends the **username** and password. Therefore, try logging in with the username(type it into the email field)/password instead.
et: **MÄRKUS:** e-mailiga sisse logides võib saada autentimiserroreid. Kuigi sisse logimise vorm küsib e-maili ja parooli, saadab see tegelikult **kasutajanime** ja parooli. Seega tasub errorit saades proovida sisse logida hoopis kasutajanime (trüki see e-maili välja) ja parooliga.

source: Configuring the Toolkit server
et: Toolkiti serveri konfigureerimine

source: To configure the Toolkit server client application, UAA related environment variables need to be set:
et: Toolkiti serveri kliendirakenduse konfigureerimiseks tuleb määrata UAA-ga seotud keskkonnamuutjad (environment variables):

source: ``TEXTA_USE_UAA`` expects input "False" to disable UAA, which will otherwise be enabled.
et: ``TEXTA_USE_UAA`` sisend peab UAA blokeerimiseks olema "False", vastasel juhul on see lubatud.

source: ``TEXTA_UAA_URL`` needs to be the URL of the UAA server, eg http://localhost:8080/uaa
et: ``TEXTA_UAA_URL`` peab olema UAA serveri URL, nt http://localhost:8080/uaa

source: ``TEXTA_UAA_REDIRECT_URI`` needs to be the ``redirect_uri`` as set on the UAA server client, eg http://localhost:8000/api/v1/uaa/callback
et: ``TEXTA_UAA_REDIRECT_URI`` peab olema sama ``redirect_uri``, mis on määratud UAA serveri kliendis, nt http://localhost:8000/api/v1/uaa/callback

source: ``TEXTA_UAA_FRONT_REDIRECT_URL`` needs to be the URL of the Angular frontend, where the Toolkit server will redirect the user after a successful ``redirect_uri`` callback, eg http://localhost:4200/oauth
et: ``TEXTA_UAA_FRONT_REDIRECT_URL`` peab olema Angular eessüsteemi URL, kuhu Toolkiti server suunab oma kasutaja pärast õnnestunud ``redirect_uri`` tagasihelistust (callback), nt http://localhost:4200/oauth

source: ``TEXTA_UAA_CLIENT_ID`` needs to be the client ID, eg ``login``
et: ``TEXTA_UAA_CLIENT_ID`` peab olema kliendi ID, nt ``login``

source: ``TEXTA_UAA_CLIENT_SECRET`` needs to be the client application's secret, eg ``loginsecret``
et: ``TEXTA_UAA_CLIENT_SECRET`` peab olema kliendi rakenduse saladus, nt ``loginsecret``

source: Using UAA on the front-end
et: UAA eessüsteemi (front-end) kasutamine

source: To use UAA with the Angular front-end, it needs to be configured in an `environment.ts` file.
et: UAA koos Angular eesüsteemiga peab olema konfigureeritud `environment.ts` failis.

source: ``useCloudFoundryUAA`` is a boolean. If false, the UAA login option will be hidden.
et: ``useCloudFoundryUAA`` on tõeväärtustüübis. Kui see on False, on UAA sisse logimisvõimalus peidetud.

source: ``uaaConf`` is an object with fields for UAA parameters, eg:
et: ``uaaConf`` on objekt väljadega UAA parameetrite jaoks, nt:

source: To log in using UAA, click on the "log in with CloudFoundry" button on the login dialog:
et: UAA-d kasutades sisse logimiseks, klõpsa "log in with CloudFoundry" nupule sisse logimise aknas:

source: *Log In With CloudFoundry Screen on the Angular Front-end*
et: *Logi Sisse CloudFoundry valikuga Angular eesüsteemis*

source: This will then redirect you to the UAA login screen. After logging in, if the login was successful, it will redirect you back to the Toolkit front-end.
et: See suunab kasutaja UAA sisse logimise valikusse. Pärast edukat sisse logimist suunab see kasutaja tagasi Toolkiti eessüsteemi.

source: Tests
et: Testid

source: To run tests on the Toolkit backend, run: ``python manage.py test toolkit.uaa_auth``
et: Toolkiti tagasüsteemis (backend) testide jooksutamiseks jooksuta: ``python manage.py test toolkit.uaa_auth``

source: Tests on the front-end are carried through Cypress, in the ``uaa.e2e-spec.js`` file.
et: Eessüsteemis on testid tehtud Cypressiga ``uaa.e2e-spec.js`` failis.

source: **NOTE:** The UAA server has to be running and configured in order for the tests to work.
et: **MÄRKUS**: UAA server peab testide töötamiseks olema käivitatud ja konfigureeritud.

source: Notes on authentication
et: Märkuseid autentimise kotha

source: Upon a successful login to the UAA server, sends a callback to the Toolkit ``redirect_uri`` callback, through which another request to the UAA server will be made to obtain an ``access_token`` and a ``refresh_token``.
et: Pärast edukat UAA serverisse sisse logimist saadab UAA server tagasihelistuse (callbacki) Toolkiti ``redirect_uri`` tagasihelistusse (callbacki), läbi mille tehakse teine päring UAA serverisse, et saada ``access_token`` ja ``refresh_token``.

source: To authenticate Toolkit with the ``access_token``, it needs to be attached to the ``Authorization`` (``HTTP_AUTHORIZATION``) header as a ``Bearer`` token in requests. Example: ``Authorization: Bearer 71428a9f2fb44c52be3c17f2fae405f5``.
et: Toolkiti ``access_token``-iga autentimiseks on vaja see lisada päringutes ``Authorization`` (``HTTP_AUTHORIZATION``) päisesse kui ``Bearer`` token. Näide: ``Authorization: Bearer 71428a9f2fb44c52be3c17f2fae405f5``.

source: On every request to the Toolkit REST backend, the Toolkit REST backend will send a request to the UAA server to check whether the token is still valid. If not, it will give a 401 response.
et: Iga päringuga Toolkit REST tagasüsteemi saadab Toolkit RESTi tagasüsteem päringu UAA serverisse, et kontrollida, kas token ikka veel kehtib. Kui see nii ei ole, tagastab see 401 vastuse.

source: Upon a 401 Unauthorized response from the server, the ``refresh_token`` token will be automatically sent by the frontend to Toolkit REST backend's **uaa/refresh-token** endpoint with the ``refresh_token`` attached to the request body under the field ``refresh_token``. On the Toolkit REST backend, the refresh token will be used to make a request to the UAA server's **/oauth/token** endpoint to get a new ``access_token``. If the ``refresh_token`` is invalid or expired, the Toolkit REST backend's **uaa/refresh-token** endpoint will give a 403 response.
et: Sellisel juhul saadab eessüsteem automaatselt ``refresh_token`` tokeni Toolkit RESTi tagasüsteemi **uaa/refresh-token** otspunkti koos ``refresh_token``-iga (päringus väljal ``refresh_token``). Toolkit REST tagasüsteemis kasutatakse 'refresh' tokenit UAA serveri **/oauth/token** otspunkti saadetud päringus uue ``access_token``-i saamiseks. Kui ``refresh_token`` pole valiidne või on aegunud, tagastab Toolkit REST tagasüsteemi **uaa/refresh-token** otspunkt 403 vastuse.

source: For reference: https://docs.cloudfoundry.org/api/uaa/version/74.24.0/index.html#refresh-token
et: Edasiseks lugemiseks: https://docs.cloudfoundry.org/api/uaa/version/74.24.0/index.html#refresh-token
