Repository: texta-tk/texta-tk.github.io
Catalog: locale/*/LC_MESSAGES/concepts.po
Languages: et

source: Main Concepts of Toolkit
et: Toolkiti põhimõisted

source: Here are described the main concepts related to TEXTA Toolkit (TTK).
et: Siin kirjeldatakse põhimõisteid, mida TEXTA Toolkitis (TTK-s) kasutatakse.

source: Project
et: Projekt

source: Project is the main unit of access and management for datasets and resources (embeddings, text classifiers, etc.). A project is defined by its description, list of Elasticsearch indices related to the project (this is where the data is!), and a list of users who can access the project and it’s resources. All resources in TTK belong to some project and by adding or removing users, one can manage their access to the project.
et: Projekt on põhiühik andmete ja ressurside (sõnavektorite, klassifikaatorite jne) haldamiseks ja neile ligi pääsemiseks. Projekti defineerivad tema kirjeldus, Elasticsearchi indeksite nimekiri (indeksites on andmed!) ja projektile ning selle ressurssidele ligipääsu omavate kasutajate nimekiri. Kõik ressursid TTK-s kuuluvad mingisse projekti ning kasutajaid lisades või eemaldades saab valida, kellel on projektile ja selle ressurssidele ligipääs.

source: Task
et: Ülesanne (Task)

source: TEXTA Toolkit allows to build several different statistical models to process the text. The training process is initiated via TTK API or GUI, which results in creating of the object in TTK data model and starting the asynchronous training task. Tasks are data objects for keeping track of training progress of trainable statistical models.
et: TEXTA Toolkitis saab luua mitut erinevat statistilist mudelit teksti töötlemiseks. Treenimisprotsessi saab alustada TTK API-s või GUI-s, mis loob TTK andmemudelis objekti ning alustab asünkroonset treenimisülesannet. Ülesanded on andmeobjektid, mille abil saab jälgida treenitavate statistiliste mudelite treeningprogressi.

source: Search
et: Otsing (Search)

source: One of the most central component in TTK is Search, which is used to define subsets of data for training text classification models and performing various aggregations. Search is managed via GUI and can contain one or more constraints on feature values (e.g. strings and dates). Documents matching the search criteria can be used in various actions/functionalities in TTK, e.g. extraction of relevant keywords, data summarisation and exploration, and training text classifiers.
et: Search on üks TTK põhikomponente. Seda kasutatakse andmestikus teksti klassifitseerimise mudelite treenimiseks vajalike alamhulkade loomeks ja erinevate agregatsioonide tegemiseks. Searchi saab hallata GUI-s ning see võib sisalda üht või rohkem piirangut mingite tunnuste väärtustele (nt sõned ja kuupäevad). Otsingukriteeriumitele vastavaid dokumente saab kasutada erinevates TTK vahendites, nt asjakohaste võtmesõnade eraldamises, andmete kokku võtmises ja uurimiseks ning teksti klassifitseerimise treenimises.

source: Fact
et: Fakt (Fact)

source: In TTK text annotations are regarded as facts:
et: TTK-s on taolised tekstimärgendid faktid:

source: Facts are objects with following properties:
et: Faktid on järgnevate tunnustega objektid:

source: fact - name for the annotation (e.g. PER, LOC, or any arbitrary string)
et: fakt - märgendi nimi (nt PER, LOC või mõni muu suvaline sõne)

source: str_val - string value for the annotation (e.g. "Donald Trump" for PER). Values don't need to match annotated text segmements.
et: str_val - märgendi väärtus sõnena (nt "Donald Trump" või PER). Väärtused ei pea ühilduma märgendatud teksti segmentidega.

source: doc_path - path to the field containing the annotated string (e.g. "text", "text.author", "comment.text.author", etc.)
et: doc_path - tee väljale, kus on sõned märgendatud (nt "text", "text.author", "comment.text.author" jne.)

source: spans - JSON string containing the start and end positions in the annotated string
et: spans - JSON sõne, mis sisaldab märgendatud sõne alguse ja lõpu kaugust algusest.

source: Toolkit comes with several predefined fact names that are used by our Multilingual Processor:
et: Toolkitis on mitu eelnevalt defineeritud fakti, mida saab kasutada TTK-s Mitmekeelse tekstitöötlejaga (Multilingual Processor):

source: Label
et: Silt

source: Meaning
et: Tähendus

source: Comment
et: Kommentaar

source: Name of a person.
et: Inimese nimi

source: Organisation
et: Asutus

source: Name of an organisation, gotten statistically.
et: Asutuse nimi, saadud statistiliselt

source: Location
et: Asukoht

source: Name of a location, gotten statistically.
et: Asukoha nimi, saadud statistiliselt

source: Company
et: Firma

source: Names of company registered in Estonia, gotten from `Estonian Open Data <https://opendata.riik.ee/datasets/ariregister/>`_.
et: Eestis registreeritud firmade nimed, saadud `Estonian Open Data-st <https://opendata.riik.ee/datasets/ariregister/>`_.

source: Address
et: Aadress

source: Estonian address, gotten from `Estonian Open Data <https://opendata.riik.ee/datasets/aadressiandmed/>`_.
et: Eesti aadressid, saadud `Estonian Open Data-st <https://opendata.riik.ee/datasets/aadressiandmed/>`_.

source: Drug
et: Ravim

source: Name of a medicine.
et: Ravimi nimi

source: Substance
et: Koostisosa

source: Ingredient of a drug.
et: Ravimi koostisosa

source: E-mail address.
et: E-maili aadress.

source: Phone
et: Telefon

source: Phone number.
et: Telefoninumber

source: Own tag
et: Oma märgend

source: Tags we have trained in :ref:`the Taggers under Models <texttaggers>`
et: Märgendid, mis on treenitud :ref:`Tagger-itega Models-i all <texttaggers>`

source: Table 1. *Predefined Fact Names used by Multilingual Processor*
et: Tabel 1. *Mitmekeelse tekstitöötleja (Multilingual Processor) kasutatavad eelnevalt defineeritud faktid*

source: It is important to notice that COMPANY and ADDR identify only companies and addresses registered in Estonian Open Data. It won't tag any foreign company nor address while ORG and LOC identifies all of them.
et: Pane tähele, et COMPANY ja ADDR oskavad ära tunda ainult neid firmasidja aadresse, mis on registreeritud Estonian Open Data-s. See ei märgenda välismaafirmasid ja aadresse. ORG ja LOC märgendab ka välismaa omi.

source: Index
et: Indeks (Index)

source: Index is a collection of documents in Elasticsearch. In Search output the table consists of all the suitable documents filtered out from that index and one row indicates a document.
et: Indeks on dokumentide kogum Elasticsearch-is. Otsingus (Search-is) väljastatakse tabel indeksist välja filtreeritud dokumentidega. Üks rida tabelis on üks dokument.

source: Field
et: Väli (Field)

source: Each document is a collection of fields. Field is a separated piece of information in that document. For example, we can have an article with fields containing the text, the date of publishing, headline, etc.
et: Iga dokument on väljade kogum. Väli on eraldatud infoosa dokumendis. Näiteks võivad meil olla artiklid sisu, avaldamisaja, pealkirja jms väljadega.

source: Embedding
et: Sõnavektor (embedding)

source: Embedding is a statistical model describing the distributional properties of words and phrases, which enables the computation of similarity between words and phrases. In TTK, embeddings are used for finding contextually similar keywords to extend search results and building lexicons. Furthermore, vectors from word embeddings can also be used in neural classification models in Texta Toolkit. TTK currently only supports Word2Vec embeddings, but work is being done to incorporate state of the art embedding models (e.g. BERT from Google Research). Furthermore, TTK will also employ cross-lingual embeddings developed by EMBEDDIA to support multilingual text classification.
et: Sõnavektorite mudelid on statistilised mudelid, mis kirjeldavad sõnade ja fraaside jaotuslikke omadusi, mis võimaldavad arvutada erinevate sõnade ja fraaside vahelisi sarnasusi. TTK-s kasutatakse sõnavektoreid kontekstuaalselt sarnaste võtmesõnade otsimiseks, mis aitab laiendada otsingu tulemusi ning ehitada leksikone. Enamgi veel, sõnavektoreid saab kasutada ka TEXTA Toolkiti tehisnärvivõrgupõhistes klassifikaatorites. TTK toetab hetkel vaid Word2Vec sõnavektoreid, aga töötatakse selle nimel, et lisada juurde kõige uuemaid ja veel paremaid sõnavektorite mudeleid (nt BERT-i Google-st). TTK hakkab kasutama ka mitmekeelseid sõnavektorite mudeleid, mida arendatakse praegu EMBEDDIA projektis mitmekeelse teksti klassifitseerimiseks.

source: Tagger
et: Märgendaja (Tagger)

source: Topic Analyzer
et: Teemaanalüsaator (Topic Analyzer)

source: Topic Analyzer is a tool that detects groups of similar documents in the data. It can be used for example to explore the structure of the unlabeled data in order to get the understanding about what it contains. However, the main purpose of the tool is to take it one step further and make actual use of one's exploration by transforming their discoveries into the labelling. It can then be used to build supervised machine learning models.
et: Topic Analyzer ehk Teemaanaüsaator on vahend, mis tuvastab andmestikus olevaid sarnaste dokumentide gruppe. Seda saab kasutada näiteks märgendamata andmestiku uurimiseks, et saada aru, mida see sisaldab. Vahendi peamine eesmärk on siiski astuda samm edasi ning kasutada selle tulemusi andmestiku märgendamiseks. Teemaanalüsaatori abil märgendatud teksti saab kasutada juhendatud masinõppemudelite treenimiseks.

source: Topic Analyzer puts to use the best parts of unsupervised clustering and manual labelling. While clustering is a fast and efficient method to create groups of rather similar texts, it still lacks preciseness required to use these clusters as a labelling of the data. For example, while some clusters may indeed contain similar documents, some other will completely fail in capturing the similarity and most of them will probably be so-and-so.
et: Teemaanalüsaator kasutab juhendamata klasterdamise parimaid palu ning käsitsi märgendamist. Klasterdamine on kiire ja tõhus meetod sarnaste tekstide grupeerimiseks. Siiski ei pruugi see olla piisavalt täpne, et tulemusi koheselt kasutada andmete märgendamiseks. Näiteks võivad mõned klastrid tõepoolest sisaldada sarnaseid dokumente, samas võib teistel klastritel see ebaõnnestuda ning kolmandatel olla hinnanguks 'nii-ja-naa'.

source: Topic Analyzer allows user to look inside each cluster and make the decision about the quality manually. Users can also perform various actions on the cluster: remove documents, add more similar documents, and move documents to another more suitable cluster. Finally, user can choose to label the documents inside the cluster if it has reached a sufficient quality.
et: Teemaanalüsaatoris saab vaadata iga klastri sisse ning otsustada kvaliteedi üle käsitsi. Kasutajatel on võimalus ka klastreid muuta: kustutada dokumente, lisada uusi sarnaseid dokumente ning liigutada dokumente ühest klastrist teise, sobivamasse klastrisse. Kui klaster on valmis ja kasutaja on sellega rahul, on võimalik antud dokumente klastris automaatselt vabalt valitud sildiga ära märgendada.
