Repository: texta-tk/texta-tk.github.io
Catalog: locale/*/LC_MESSAGES/document_importer.po
Languages: et

source: Document importer provides API endpoints for adding, deleting and replacing documents one by one in or into a certain index in an easy way.
et: Dokumendi Importija (Document Importer) annab API otspunktid dokumentide kindlasse või uude indeksisse lisamise, seal asendamise või sealt kustutamise tarbeks.

source: Importing a document
et: Dokumendi importimine

source: Parameters
et: Parameetrid

source: Collection of raw Elasticsearch documents. Each element in the list has following fields:
et: Elasticsearchi dokumentide kogum. Listi igal elemendil on järgnevad väljad:

source: "_id": Under which id should Elasticsearch insert the document, without this Elasticsearch will generate one itself.
et: "_id": millise id alla Elasticsearch dokumendi paneb. Kui see on puudu, genereerib Elasticsearch id ise.

source: "_index": Under which already existing index should Elasticsearch insert the document.
et: "_index": millise juba olemas oleva Elasticsearchi indeksi alla dokument läheb.

source: "_type": Should be the same value as index, specifies the Elasticsearch doc_type.
et: "_type": peab olema sama indeksiga sama väärtus, täpsustab Elasticsearchi doc_type'i.

source: "_source": Actual content of the document.
et: "_source": dokumendi tegelik sisu.

source: Specifies which text fields should be split into smaller pieces.
et: täpsustab, millised tekstiväljad jaotatakse väiksemateks osadeks

source: If the documents do not have "_index" and "_type" field, the name of the index is generated automatically.
et: Kui dokumentidel ei ole "_index" ja "_type" välju, genereeritakse indeksi nimi automaatselt.

source: Examples
et: Näited

source: Endpoint: **/projects/{project_pk}/document_importer/**
et: Otspunkt (endpoint): **/projects/{project_pk}/document_importer/**

source: Example with index name added automatically and no splitting:
et: Näide, kus indeksi nimi lisatakse automaatselt ning tekste ei jaotata mitmeks:

source: Example with given index name and splitting:
et: Näide, kus indeksi nimi on kaasa antud ning teksti jaotatakse mitmeks:

source: Viewing a document
et: Dokumendi vaatamine

source: Endpoint: **projects/{project_pk}/document_importer/{index_name}/{document_id}/**
et: Otspunkt: **projects/{project_pk}/document_importer/{index_name}/{document_id}/**

source: Deleting a document
et: Dokumendi kustutamine

source: Updating split document
et: Mitmeks jagatud dokumendi uuendamine

source: Which field to use as the ID marker to categorize split documents into a single entity.
et: Millist välja kasutada ID markerina, et kategoriseerida mitmeks jagatud dokumente tagasi üheks üksuseks.

source: Value of the ID field by which you categorize split documents into a single entity.
et: asendatava dokumendi ID välja väärtus.

source: Specifies the name of the text field you wish to update.
et: Täpsustab tekstivälja, mida soovid uuendada

source: New content that the old one will be updated with.
et: Sisu, millega valitud tekstiväli asendatakse

source: Example
et: Näide

source: Endpoint: **projects/{project_pk}/document_importer/{index_name}/update_split**
et: Otspunkt: **projects/{project_pk}/document_importer/{index_name}/update_split**
