Repository: texta-tk/texta-tk.github.io
Catalog: locale/*/LC_MESSAGES/embedding.po
Languages: et

source: Embedding
et: Sõnavektor (embedding)

source: Create
et: Loomine

source: Navigate to **Models -> Embeddings** and click on the **CREATE** button on top-left. Choose the name for you :ref:`embedding <embedding_concept>` (*Description*). Define the :ref:`query <query_concept>` and select indices on which the :ref:`query <query_concept>` will be executed. If you leave *Query* empty, it will take all documents from the selected indices. If you have any searches defined in your :ref:`project <project_concept>`, they will appear in a dropdown menu if you click on the field *Query* - you can use existing searches as queries.
et: Mine **Models -> Embeddings** ja vajuta **CREATE**-nupule ülal vasakul. Vali oma :ref:`sõnavektorile <embedding_concept>` nimi (*Description*). Määra :ref:`päring <query_concept>` ja vali indeksid, mille peale see :ref:`päring <query_concept>` rakendatakse. Tühi *Query* võtab valitud indeksitest kõik dokumendid. Kui :ref:`projektis <project_concept>` on salvestatud otsinguid, saab neid valida ripp-menüüst, mis ilmub *Query* väljale klõpsates - niiviisi on võimalik kasutada olemasolevaid otsinguid päringutena.

source: Choose *fields* on which the :ref:`embedding <embedding_concept>` will be trained. The selected fields should contain textual data.
et: Vali *fields*, millel :ref:`sõnavektoreid <embedding_concept>` hakatakse treenima. Valitud väljad võiksid sisaldada tekstiandmeid.

source: It is recommended to use lemmatized or tokenized data. Lemmatization is especially useful with morphologically complex languages. You can tokenize and lemmatize the data with :ref:`MLP <mlp>`.
et: Soovituslik on kasutada lemmatiseeritud või tokeniseeritud andmeid. Lemmatiseerimine on eriti kasulik morfoloogiarikaste keelte puhul. Andmeid saab tokeniseerida ja lemmatiseerida :ref:`MLP-ga <mlp>`.

source: Field *Number of dimensions* defines the length of the word vectors. 100-200 dimensions is usually a good place to start with. Field *Minimum frequency* sets how many times a word must occur in the data in minimum in order to get included into the :ref:`embedding <embedding_concept>`. Again, you can leave it with the default value *5* if you are unsure which value to pick.
et: Väli *Number of dimensions* on sõnavektorite pikkus. 100-200 dimensiooni on tavaliselt alustamiseks hea koht. Väli *Minimum frequency* määrab, mitu korda peab sõna andmestikus minimaalselt kasutatud olema, et saada endale oma :ref:`sõnavektor <embedding_concept>`.Kui Sa ei tea, mida valida, sobib vaikimisi väärtus *5* väga hästi.

source: The quality of the embedding depends on the size of the dataset. The larger the better.
et: Sõnavektorite kvaliteet sõltub andmestiku suurusest. Mida suurem, seda parem.

source: Endpoint: **/projects/{project_pk}/embeddings/**
et: Otspunkt: **/projects/{project_pk}/embeddings/**

source: Example:
et: Näide:

source: View
et: Vaade

source: Navigate to **Models -> Embeddings** to view existing :ref:`embedding <embedding_concept>`. If any of your embeddings is still training, the view will show you the progress of the training (:numref:`embedding_view`). Besides than that, the view shows you general information about your embeddings.
et: Mine **Models -> Embeddings**, et vaadata olemasolevaid :ref:`sõnavektoreid <embedding_concept>`. Kui mõni sõnavektor veel treenib, saab vaatest vaadata treeningu progressi (:numref:`embedding_view`). Sellele lisaks kuvab vaade üldist informatsiooni projekti sõnavektorite kohta.

source: *Embedding view*
et: *Sõnavektorite vaade*

source: Delete
et: Kustuta

source: Navigate to **Models -> Embeddings** and click on the three dots under **Actions** column and choose **Delete** (:numref:`embedding_actions`).
et: Mine **Models -> Embeddings** ja vajuta kolmele täpikesele **Actions** (tegevusvõimalused) tulbas. Vali **Delete** (:numref:`embedding_actions`).

source: *Embedding actions*
et: *Sõnavektorite tegevusvõimalused*

source: Endpoint: **/projects/{project_pk}/embeddings/{embedding_id}**
et: Otspunkt: **/projects/{project_pk}/embeddings/{embedding_id}**

source: Edit
et: Muutmine

source: Navigate to **Models -> Embeddings** and click on the three dots under **Actions** column and choose **Edit** (:numref:`embedding_actions`).
et: Mine **Models -> Embeddings** ja vajuta kolmele täpikesele **Actions** (tegevusvõimalused) tulbas. Vali **Edit** (:numref:`embedding_actions`).

source: Apply phraser
et: Rakenda fraasituvastit (apply phraser)

source: Navigate to **Models -> Embeddings**, click on the three dots under **Actions** and choose **Phrase** (:numref:`embedding_actions`). Insert text that you want to phrase and click **Post**. You should see phrased version of the text (:numref:`apply_phraser`).
et: Mine **Models -> Embeddings** ja vajuta kolmele täpikesele **Actions** (tegevusvõimalused) tulbas. Vali **Phrase** (:numref:`embedding_actions`). Sisesta tekst, kust tahad fraase tuvastada, ja vajuta **Post**. Seejärel ilmub fraasistatud tekst (:numref:`apply_phraser`).

source: *Apply phraser*
et: *Rakenda fraasituvastit (Apply phraser)*
