Repository: texta-tk/texta-tk.github.io
Catalog: locale/*/LC_MESSAGES/gui.po
Languages: et

source: To create a new grouping (or clustering, as we name it) navigate to Models -> Clustering and click "Create". Similarly to Tagger Group object, you have to give it a name (*Description*) and select indices and fields based on which the grouping will be done. Additionally one can restrict the set of documents to be used in clustering by specifying the filter with a *Query* parameter.
et: Uue grupeeringu (või klasterdamise, nagu meie seda nimetame) loomiseks navigeeri Models -> Clustering alla ja vajuta "Create". Sarnaselt Tagger Group-iga peab andma sellele nime (*Description*), valima indeksid ja väljad, mille põhjal grupeerima hakatakse. Lisaks saab piirata klasterdamises kasutatavat andmestiku *Query* parameetri kaudu, valides andmestikuks selle alamhulga.

source: If desired, one can do some fine-tuning as well by choosing clustering algorithm and vectorizer and specifying the number of clusters (*Num clusters*) and the number of document vector dimensions (*Num dims*).
et: Soovi korral saab teha täppishäälestust, valides klasterdamisalgoritmi ja *vectorizer*-it ning määrates klastrite arvu (*Num clusters*) ning dokumendivektori dimensioonide arvu (*Num dims*).

source: **How to choose the number of clusters?**
et: **Kuidas valida klastrite arvu?**

source: General advice would be to better have too many clusters than too few. Think about how many documents you are planning to cluster and choose the number so that the average cluster is small enough to inspect it manually with ease. For example, if you are going to cluster 1000 documents to 50 clusters then average cluster would contain 20 documents.
et: Üldine nõuanne on, et parem on valida liiga palju klastreid kui liiga vähe. Mõtle, mitut dokumenti hakkad klasterdama, ning vali number nii, et keskmine klaster oleks piisavalt väike, et seda käsitsi hõlpsasti kontrollida. Näiteks, kui klasterdad 1000 dokumenti 50 klastrisse, sisaldab keskmine klaster 20 dokumenti.

source: Instead of using document-term matrix for clustering, we can also use compressed approximation of this matrix (with parameter *Use LSI*) which is constructed before the clustering process begins. However, LSI also requires the number of topics (dimensions in low-rank matrix) to be specified (*Num topics*).
et: *document-term matrix*-i asemel võib klasterdamisel kasutada ka selle maatriksi tihendatud üldistust (*compressed approximation*) (parameetriga *Use LSI*), mis luuakse enne klasterdamist. LSI jaoks on vaja kindlasti määrata teemade arv (dimensioonid 'low-rank' maatriksis) (*Num topics* all).

source: In some cases we may already have some knowledge about the data that we are about to cluster. For example, we may be aware of some domain-specific stopwords which we would like to ignore. As name already suggests, these can be listed in the field *Stopwords*.
et: Mõnel juhul on juba ette teada, milline antud andmestik, mida klasterdama hakatakse, on. Näiteks võib olla teada, millised on domeeni-spetsiifilised stopp-sõnad, mida võiks ignoreerida. Neid saame lisada väljas *Stopwords*.

source: Figure 17. *Creating a Clustering*
et: Joonis 17. *Klasterdaja loomine*

source: **Evaluating clusters**
et: **Klastrite hindamine**

source: To see the clusters, click *View clusters* under Actions. This view gives us an overwiew about obtained clusters. For each cluster the document count and average cosine similarity between its documents is shown. Additionally, a list of significant words for each cluster is given - it is a list of words that, when compared to other documents, appear notably often in documents which belong to that cluster.
et: Klastreid saab vaadata Actionite all (*View clusters*). Sealt saab ülevaate tekitatud klastrite kohta. Iga klastri kohta antakse dokumentide arv ja keskmine koosinussarnasus dokumentide vahel. Lisaks antakse iga klastri oluliste (tähenduslike) sõnade nimekiri - sinna kuuluvad need sõnad, mis võrreldes teiste dokumentidega on märkimisväärselt sagedasemad nendes dokumentides, mis sellesse klastrisse kuuluvad.

source: **Interpreting document count**
et: **Dokumendi arvu tõlgendamine**

source: Cluster with significantly larger document count often indicates that the clustering algorithm has failed to separate these documents by the topic. It doesn't necessarily mean that the clustering process in general has been unsuccessful as often it is impossible to cluster all documents perfectly. However, you still might want to take a closer look to such clusters as there may be other reasons for such results as well. For example, the documents in that cluster may contain similar noise or stopwords that makes them artifically similar to each other. Sometimes increasing the number of clusters might help as well.
et: Teiste klastritega märkimisväärselt suurema dokumentide arvuga klaster viitab sellele, et klasterdamisalgoritmil ei õnnestunud nende dokumentide teemadesse jaotamine. See ei pruugi kohe tähendada, et klasterdamisprotsess üleüldiselt ebaõnnestus, kuna tihti ei olegi võimalik kõiki dokumente täiuslikult klasterdada. Siiski tasub sellistele klastritele hoolega otsa vaadata, sest sellist klastrite tekkeks võib olla ka muid põhjuseid. Näiteks võivad dokumendid selles klastris sisaldada sarnast müra või stopp-sõnu, mis teevad neid tehislikult sarnasemaks. Mõnikord võib abiks olla klastrite arvu suurendamine.

source: **Interpreting average similarity**
et: **Average similarity (keskmise sarnasuse) tõlgendamine**

source: Average similarity is an average cosine similarity between all the documents in the cluster. It ranges between 0 and 1 and higher score indicates that the documents in that cluster are more similar to each other. However, the score has some disadvantages. For example, when a cluster contains 9 documents that are very similar to each other and 10th document is very different from all others, then the score might appear low althought fixing that cluster would be very easy.
et: Average similarity on keskmine koosinussarnasus kõigi dokumentide vahel selles klastris. Skoor on vahemikus 0..1 ning mida kõrgem on skoor, seda suurem on sarnasus antud klastri dokumentide vahel. Sellel skooril on ka puuduseid. Näiteks, kui meil on klaster, kus 9 dokumenti on üksteisele väga sarnased ning kümnes dokument väga erinev teistest, võib keskmise koosinussarnasuse skoor näida väga madalana, kuigi selle klastri parandamine oleks väga lihtne.

source: To see content of a cluster, simply click on a cluster that is in your interest, this opens you a Cluster Details view.
et: Klastri sisu nägemiseks tuleb lihtsalt vajutada huvipakkuvale klastrile. See avab detailse klastrivaate Cluster Details.

source: **Operations with cluster**
et: **Klastritega tegelemine**

source: Cluster Details view allows us to inspect actual documents belonging to a cluster.
et: Cluster Details vaade laseb vaadata klastrisse kuuluvaid tegelikke dokumente.

source: If we are satisfied with what it contains, we can tag the content by clicking "Tag" button. This operation adds a texta_fact to each of the document in the cluster, with specified name and a string value. **From now on, these documents will be ignored in further clustering processes**.
et: Kui klastri sisu on sobiv, saab selle ära märgendada (täägida) "Tag" nupu abil. See lisab texta_fact-i kõigile dokumentidele antud klastris koos määratud fakti nime ja väärtusega. **Edaspidi ignoreeritakse neid dokumente järgnevates klasterdamise protsessides**.

source: If not satisfied, we probably want to do some corrections in the cluster content manually, that is, remove some documents from it. This can be done by selecting the documents that we want to remove and clicking on trash bin icon. Note that these documents will not be ignored in further clustering process.
et: Klastrisisu saab ka käsitsi kohendada, näiteks eemaldada mõned dokumendid. Seda saab teha, valides dokumendid, mis klastrisse ei sobi, ning vajutades prügikastiikoonile. Pane tähele, et neid dokumente ei ignoreerita järgnevates klasterdamise protsessides.

source: We could also be interested in whether there is more documents in the index that are similar to the ones in given cluster. If indeed there is, we might want to add those documents to the cluster as well, so we could tag them all together.
et: Tõenäoliselt pakub klastrite uurimisel huvi ka see, kas indeksis on veel dokumente, mis on sarnased klastris olevatele. Kui see tõepoolest nii on, võib tekkida soov needki klastrisse lisada, et saaks kõik ühe korraga ära märgendada.

source: To query similar documents, click on a "More like this" button. In the opened view, select document which you would like to add to the cluster and click on a "+" button.
et: Sarnaste dokumentide leidmiseks on loodud nupp "More like this". See avab vaate, kus saab valida dokumente, mida soovitakse klastrisse lisada "+"-nupu abil.

source: Figure 19. *Cluster details view*
et: Joonis 19. *Klastrite detailne vaade (Cluster details view)*

source: Reindexing the Data
et: Andmestiku reindekseerimine

source: Reindexer is a useful tool for reindexing Elasticsearch :ref:`indices <index_concept>`. We can think of index as our dataset. With reindexer we can remove unwanted fields, change the type of the fields (if we have a field with text value type but actually contains dates, we can change the type to date and use it for our aggregation).
et: Reindexer ehk Reindekseerija on kasulik vahend Elasticsearchi :ref:`indeksite <index_concept>` reindekseerimiseks. Indeksist võib mõelda kui oma andmestikust. Reindexeriga saab eemaldada ebasobivad väljad ja muuta väljatüüpi (näiteks saab tekstivälju, mis tegelikult sisaldavad kuupäevi, muuta kuupäevaväljadeks, mida oma agregatsioonides kasutada).

source: We can create a new index by clicking on the '+CREATE' button in the bottom-left.
et: Uut indeksit saab luua '+CREATE' nupu abil all vasakul.

source: *Description* is the description of new reindexing job.
et: *Description* on uue reindekseerimistöö kirjeldus.

source: *New index name* is the name for our new index.
et: *New index name* on loodava indeksi nimi.

source: *Indices* are all the indices that we want in our new index.
et: *Indices* on kõik indeksid, mida tahame oma uude indeksisse.

source: *Field types* are for changing the type and/or the name of our field(s).
et: *Field types* abil saab muuta välja(de) tüüpi ja/või nime.

source: We can use *Query* for adding only certain search results to our new index.
et: *Query* abil saab lisada uute indeksisse kindlaid otsingutulemusi.

source: *Random subset type* helps us to create an index which contains only certain amount of samples (rows). We can use this in case we want to play with a smaller subset before we apply our tools on a bigger one.
et: *Random subset type* abil saab luua indeksi, milles on kindel arv suvaliselt valitud näiteid (ridu). Seda saab kasutada juhul, kui soovitakse testida Toolkiti vahendeid enne nende kogu andmestikule rakendamist.

source: Figure 20. *Creating a new index*
et: Joonis 20. *Uue indeksi loomine*

source: Uploading the Data
et: Andmestiku üleslaadimine

source: You can upload a new dataset from a file to Toolkit via Dataset Importer under Tools. For that click on the **CREATE** button which opens a table in Figure 21. There you can describe your dataset (*Task description*), give it a name (*Dataset name*) and choose the file to be uploaded (you can browse it when clicking on the folder button). When uploading an .csv file, you can add the separator (usually a comma). Dataset Importer also supports json and excel files. Then hit **Create**. You will see the uploading process and metadata of the dataset under the Dataset Importer. You can delete the uploaded dataset by clicking on the three dots under actions.
et: Uusi andmeid saab Toolkit-i üles laadida Tools-i all oleva Dataset Importer-iga. Selleks klõpsa nupul **CREATE**, mis avab joonisel 21 olevavaate. Seal tuleb kirjeldada andmestikku (*Task description*), anda sellele nimi (*Dataset name*) ning valida, millist faili üles laaditakse (arvutist saab sobiva faili valida, kasutades kausta-kujulist nuppu). .csv formaadis faili üles laadides tuleb valida ka eraldaja (tavaliselt koma). Dataset importer toetab ka json ja excel failide üles laadimist. Seejärel vajuta **Create**. Faili üleslaadimise protsessi ning metaandmestiku näeb sealsamas Dataset Importeri all. Üles laaditud andmestiku saab kustutada Actions all oleva kolme täpikese abil.

source: Now you can add this data to your project and use it with the name you gave to it.
et: Nüüd on võimalik neid andmeid kasutada projektides andmetele antud nimega.

source: Figure 21. *Importing a new dataset*
et: Joonis 21. *Uue andmestiku importimine*
