Repository: texta-tk/texta-tk.github.io
Catalog: locale/*/LC_MESSAGES/gui.po
Languages: et

source: This is documentation is for TEXTA Toolkit version 2 GUI backed with TEXTA Toolkit's RESTful API.
et: See dokumentatsioon on TEXTA Toolkiti teise versiooni GUI kohta, mille taustaprogrammiks on Texta Toolkiti RESTful API.

source: Registration & Login
et: Registreerimine ja sisse logimine

source: Since TEXTA Toolkit is a web application, we have to navigate to the corresponding address in our browser (e.g. `http://localhost/`). We are welcomed by a login page as depicted in Figure 1.
et: Kuna TEXTA Toolkit on veebirakendus, peame navigeerima vastavale aadressile oma brauseris (nt `http://localhost/`). Joonisel 1 on näha sisselogimislehte.

source: Figure 1. *Login Screen at Startup*
et: Joonis 1. *Sisselogimisleht*

source: One can also register new users using the registration screen:
et: Registreerimislehel saab registreerida uusi kasutajaid:

source: Figure 2. *Registration Screen*
et: Joonis 2. *Registreerimisleht*

source: When running for the first time, check the default superuser account **admin** created during installation.
et: Toolkiti esimest korda jooksutamisel uuri vaikimisi installimise ajal loodud superkasutaja kontot **admin**.

source: After login have several navigation options in the upper panel. We can see our projects (also projected as the home page) and we can work with our projects via :ref:`Search <search>`, :ref:`Lexicons <lexicons>`, :ref:`Models <models>` and :ref:`Tools <tools>`.
et: Peale sisse logimist on ülemisel ribal ehk ülapaneelil mitu valikut. Seal võib näha oma projekte (see vaade on ka avalehena) ja oma projektidega töötada erinevate tööriistadega: :ref:`Search <search>`, :ref:`Lexicons <lexicons>`, :ref:`Models <models>` ja :ref:`Tools <tools>`.

source: Figure 3. *Top Panel for Navigation*
et: Joonis 3. *Ülapaneel navigeerimiseks*

source: Health of Toolkit
et: Toolkiti seisund (health of Toolkit)

source: On the **Projects page** (also Toolkit's home page) we can see technical information about TEXTA Toolkit's server on the right. There are several labels that indicate the state of Toolkit and the host machine its working on (Figure 4):
et: **Projects** all (Toolkiti avalehel) näeme tehnilist infot TEXTA Toolkiti serveri seisundi kohta. Seal on mitmeid mõõdikuid, mis kirjeldavad Toolkiti ja masina, milles see töötab, seisundit (Joonis 4):

source: Figure 4. *Toolkit Status*
et: Joonis 4. *Toolkiti staatus*

source: Managing Projects
et: Projektide haldamine

source: Creating a Project
et: Projekti loomine

source: In order to play with the data, we need to create a new project. We can create a project by clicking the **+ CREATE** button at the bottom of the page. We can then give it a title, select users who can work on the project and, of course, select datasets (Elasticsearch :ref:`indices <index_concept>`) for the project.
et: Andmestikuga mängimiseks on vaja luua uus projekt. Uut projekti saab luua vajutades **+ CREATE** nupule lehe allosas. Seejärel saab projektile anda nime, valida projektiga tegelevad kasutajad ning, muidugi, kõige tähtsama - andmestiku, millel mängima hakata (Elasticsearchi :ref:`indeksites <index_concept>`).

source: After the project is created, we can see the new project in the list and can change its datasets and user access via the **Edit** button.
et: Pärast projekti loomist on uut projekti näha projektide nimekirjas. **Edit** nupuga saab jooksvalt muuta projekti andmestikke ja kasutajate ligipääse.

source: Using a Project
et: Projekti kasutamine

source: In order to work with our project (search info, train taggers) we have to select it from the upper panel next to our username:
et: Projektis töötamiseks (valitud andmestikul info otsimiseks ja märgendajate (Taggers) treenimiseks) peame valima projektinime ülemisel ribal kasutajanime kõrval:

source: Figure 5. *Project Selection*
et: Joonis 5. *Projekti valimine*

source: Only one project can be activated at a time.
et: Korraga saab aktiveeritud olla ainult üks projekt.

source: Each project can have one or more datasets (Elasticsearch indices).
et: Igal projektil võib olla üks või rohkem andmestikku (Elasticsearchi indeksit).

source: Project resources are shared among the users with access to the project.
et: Kasutajad, kellel on ligipääs antud projektile, jagavad projekti ressursse.

source: Search: Exploring the Data
et: Search: Andmestiku uurimine

source: The Search application is responsible for both creating the searches defining subsets of documents for Toolkit's other applications and browsing-summarizing the data.
et: Otsingurakenduses (*Search*) saab andmeid lehitseda ja kokku võtta ning luua andmete alamhulki, mida saab hiljem kasutada Toolkiti järgmistes rakendustes.

source: In order to use **Search**, project must be selected in upper panel.
et: **Search**-i kasutamiseks peab olema projekt aktiveeritud (valitud) ülapaneelil.

source: Search's graphical interface consists of serveral important panels, which are depicted in Figure 6. We can collapse or open the panels by clicking on the arrow in the corner.
et: Otsingu graafilises kasutajaliideses on mitu olulist paneeli (kujutatud Joonisel 6). Me saame neid avada või kokku panna, kui vajutame paneeli nurgas olevale noolekesele.

source: Figure 6. *Search Panel*
et: Joonis 6. *Otsingupaneel*

source: Data browsing and summarization depend on searches. Search consists of a set of constraints on :ref:`field <field_concept>` values. We can define our constraints on the data using the *Current Search* panel. Without saving the constraints, we are in a “test mode”, which means that we can use the search in real time, but we cannot use the search in other tools. After saving the search, it is available also to other tools.
et: Andmete lehitsemine ja kokkuvõtete tegemine sõltub otsingutest. Otsing on hulk piiranguid mingi(te)le :ref:`välja <field_concept>` väärtustele. Andmete filtreerimiseks saab defineerida oma piirangud*Current Search* paneelil. Seni, kuni ei salvestata oma piiranguid, ollakse “testimisrežiimis”, mis tähendab, et otsingut saab kasutada ja uurida **Search**-is, aga ei saa seda kasutada teistes vahendites. Salvestamine muudab selle teistele vahenditele kättesaadavaks.

source: In order to add a constraint, we must first choose one or several fields. After the field is selected, we can then specify which textual tokens (words or word parts) should or must occur in the interested document subset.
et: Otsingule piirangute lisamiseks tuleb valida üks või enam välja (field). Kui väli on valitud, saab täpsustada, millised tekstiühikud (sõnad või sõnaosad) peavad või võiksid esineda huvipakkuvate dokumentide alamhulgas.

source: We must notice that the search will be done on the Project's dataset chosen in the upper panel.
et: Piirangutega otsing tehakse sellel Projekti andmestikul, mis on valitud ülapaneelil.

source: Suppose we are interested in finding all the documents which contains “bribery” and “official” from a text. Figure 7 shows how we have defined that we want to find all the documents which contain “bribery” and “official” in the article_text_mlp.text field:
et: Oletame, et me soovime leida üles dokumendid, mis sisaldavad sõnu “bribery” ja “official”. Joonisel 7 on lisatud otsingule piirang, mis väljastab ainult need dokumendid, mis sialdavad sõnu “bribery” ja “official” article_text_mlp.text väljas:

source: Figure 7. *Example Search Constraints*
et: Joonis 7. *Näidis otsingu piirangutest*

source: Searches have several parameters to consider:
et: Otsingule piiranguid seades võime arvestada erinevate parameetritega:

source: We can also choose ‘or’ or ‘not’ under the Operator. In this case we either get documents containing at least one of the words (‘or’) or definitely not containing the words listed (‘not’).
et: *Operator*-i all saab valida ‘or’ või ‘not’. See määrab, kas otsing väljastab dokumendid, mis sisaldavad vähemalt ühte piirangusõnadest (‘or’) või kindlasti mitte ühtegi piirangusõnadest (‘not’).

source: We can choose from several match types. Type “word” means that we want to find exact matches of the word(s) written and “phrase” means that we want to find exact matches of the phrases we are looking for, whereas “Phrase prefix” matches prefixes. This means suffixes may differ: for example searching for ‘bribe’ will find ‘bribetaking’, ‘bribers’, ‘bribery’ and other words starting with ‘bribe’. 'regex' takes the input as `a regular expression <https://www.rexegg.com/regex-quickstart.html>`_ and searches document accordingly. For example 'bribe.{0,2}' will find 'bribe' and 'bribery', but not longer words. If we have a big list of words we want to search for, we can extend the field searcher's panel.
et: Piirangu all saame valida ka *Match*-tüüpi. Tüüp “word” otsib kirjutatud sõna(de) täpsed vasted, “phrase” otsib kirjutatud fraaside täpsed vasted. “Phrase prefix” leiab kattuvate prefiksitega (sõnade alguste) sõnadega dokumendid. See tähendab, et sõnade tegelikud lõpud võivad erineda: nt otsides sõna ‘bribe’, leitakse üles ka sõnad ‘bribetaking’, ‘bribers’, ‘bribery’ jms, mille algus on ‘bribe’. 'regex'-i abil saab kasutada `regulaaravaldisi <https://www.rexegg.com/regex-quickstart.html>`_. Seda valides võetaksegi piirangut regluaaravaldisena. Näiteks piirang 'bribe.{0,2}' leiab üles sõnad 'bribe' ja 'bribery', aga mitte pikemaid sõnu. Kui piirangsõnade nimekiri osutub pikaks, on võimalik pikendada väljaotsingu paneeli.

source: We can also use Slop. Via Slop we can define up to how many words can be between the two words we wrote on one row in case the range is important for us.
et: Piiranguparameetrite arsenalis on ka *Slop*. Slop-iga saab määrata, mitu sõna võib olla kahe samale reale kirjutatud sõna vahel (juhul, kui antud vahemik on meile tähtis).

source: Should we be interested in more detailed searches, we can add more constraints like the previous ones via **Add Filter** button. For example, we can also search documents in a certain date range in case we have a proper preprocessed date field.
et: Otsingut saab muuta detailsemaks, lisades juurde eelmistega sarnaseid piiranguid **Add Filter** nupu abil. Näiteks on võimalik otsida dokumente teatud ajavahemikust juhul, kui meil on korralikult eeltöödeldud kuupäevaväli.

source: If we click on “Search” button, we will see the matching data in a tabular form (see Figure 8), where layered features share feature name’s prefix, and matches are highlighted in pink. The results might be updating while modifying the filters.
et: “Search” nupule klõpsates näeme piirangutele vastavaid andmeid tabelina (vt Joonist 8), kus piirangute vasted on roosaga esile tõstetud. Tulemused võivad end värskendada otsingupiirangute muutmise ajal.

source: Figure 8. *Example Search Results*
et: Joonus 8. *Otsingu tulemuste näidis*

source: If there are too many features (columns), we can hide or show them from the drop-down menu in the down left corner. We can select or deselect all of them together (*Select all*) or by clicking on them separately. We can also hide or get back the Searcher's panels with *Toggle drawer* button. We can browse through Searcher's results with the arrows in the bottom right. We can also choose how many items per page would we want to see.
et: Kui tunnuseid (tulpi) on liiga palju, saab neid varjata rippmenüüst all vasakult. Seal on võimalik neid valida või valikust maha võtta korraga (*Select all*) või neile eraldi klõpsates. Samuti saab *Toggle drawer* nupuga peita või tagasi võtta Otsingu paneele. Otsingu tulemusi saab lehitseda all paremal oleva noolekese abil. Samuti on võimalik valida, mitut dokumenti ühel lehel soovitakse näha.

source: Figure 9. *Select Fields for Search Results*
et: Joonis 9. *Otsingu tulemuste väljade valimine*

source: After we have come up with a suitable search, we can save it for later use by clicking on the **disk** icon up-right in the Current Search panel. The **eye** icon next to the disk icon shows us the actual Elasticsearch query we built by choosing the Operators and words to search for.
et: Sobiva otsingu saab salvestada pärastiseks **diski** ikooni abiga Current Searchi paneeli ülal paremal. **Silma** ikoon diski ikooni kõrval näitab tegelikku Elasticsearch query-t, mida antud otsingupiirangute loomisel ehitati.

source: Saved Searches
et: Salvestatud otsingud

source: After saving a search, it becomes available for using in Toolkit's applications. Now, whenever we check it, we can use it to browse data or apply in aggregations. We can also send our saved search to other users who have the permission to our project with a copied url. This opens the saved search under the Current Search for the other user. We can also open our saved search in the Current Search simply by clicking on it.
et: Otsingu salvestamine lubab saadud dokumentide alamhulka kasutada teistes Toolkiti vahendites. Otsingut valides saab andmeid hiljem uuesti lehitseda või neid kasutada agregatsioonides. Salvestatud otsinguid saab saata ka teistele kasutajatele, kellel on ligipääsuluba antud projektile, otsingu url-iga. See url avab salvestatud otsingu Current Search-i all teisele kasutajale. Salvestatud otsingule klõpsamine avab selle Current Search-i all.

source: Aggregations: Summarizing the Data
et: Agregatsioonid: Andmete kiiranalüüs

source: As fun as browsing through the data is, it is not always enough. Sometimes we want to get an overview of our data, such as topics over time or word distributions. Searcher allows to do all of that and more through the “Aggregations” panel.
et: Kuigi andmete taoline lehitsemine on väga vahva, ei pruugi see alati piisav olla. Mõnikord on vaja andmetest saada kiirem ülevaade näiteks teemade muutustest ajas või sõnade jaotustest. Searcheri all saab teha kõike seda ja enamgi veel “Aggregations” (Agregatsioonide) paneeli all.

source: Aggregations have two components - data and features it aggregates over. It will aggregate over the dataset we have under the Current Search. We can also exclude current search (meaning that 'Aggregate over all data except the one we have currently active') and choose the aggregation size. By defining a feature, we can group by that feature and get category counts. For example, lets assume we are interested in seeing how are the top words distributed in our sample data defined by our “bribe” search. For that we simply click on our bribe search under Saved Searches to get it as the current search.
et: Agregatsioonidel on kaks komponenti - andmed ja tunnused, üle mille see agregeerib. See agregeerib üle andmete, mis on Current Searchi all. Current Search-i saab ka välistada ('Agregeeri üle kogu andmestiku, välja arvatud selle osa, mis on hetkel aktiivne') ja valida agregatsiooni suurust. Tulemusi saame grupeerida valitud tunnuse (feature) kaupa ning näha kategooriate sagedust. Oletame, et meid huvitab, millised on sagedaseimad sõnad meie leitud “bribe” sõnaalgustega dokumentide alamhulgas. Selleks vajutame oma bribe otsingule Saved Searches-i all, et saada see Current Searchi alla.

source: **How are the significance scores calculated?**
et: **Kuidas on significance-skoorid arvutatud?**

source: The numbers returned for scores are primarily intended for ranking different suggestions sensibly rather than something easily understood by end users. The scores are derived from the doc frequencies in foreground and background sets. In brief, a term is considered significant if there is a noticeable difference in the frequency in which a term appears in the subset and in the background. The way the terms are ranked can be configured, `see "Parameters" section <https://www.elastic.co/guide/en/elasticsearch/reference/current/search-aggregations-bucket-significanttext-aggregation.html>`_.
et: Numbrid, mida väljastatakse skooridena, on mõeldud erinevate soovituste mõistlikuks järjestamiseks. Seda ei ole tavakasutajal lihtne mõista. Skoorid saadakse vaadates sõnasagedusi alamhulgas ja koguhulgas. Termineid peetakse märkimisväärseks ehk eristuvaks, kui alamhulga ja kõigi dokumentide vahel on märgata olulist termini sageduse erinevust. Terminite järjestamistingimusi saab muuta, `vt "Parameters" osa <https://www.elastic.co/guide/en/elasticsearch/reference/current/search-aggregations-bucket-significanttext-aggregation.html>`_.

source: One cool thing we can also do, is to visualize the frequency of texts with searched words in it on a timeline. We can do that if we have a proper date field (in Texta date format) in our data. Here we can visualize when were the words 'bribe', 'bribery' and 'bribed' used most frequently in our dataset.
et: Veel üks lahe asi, mida Agregatsioonid teha saavad, on kindlate märksõnadega tekstide sageduse kuvamine ajajoonel. Seda saab teha, kui andmetel on olemas korralik kuupäevaväli (Texta date formaadis). Me saame näiteks uurida, millal kasutati sõnu 'bribe', 'bribery' ja 'bribed' kõige rohkem meie andmestikus.

source: We can also aggregate over :ref:`texta_facts <texta_fact>` field in order to see the top entities under some tag. If we click on the black diagram button, we can scroll through the results. We see as many entities as we chose for our aggregation size.
et: Üle :ref:`texta_facts <texta_fact>` välja agregeerimine väljastab mingi märgendi (täägi) all olevad sagedaseimad olemid. Musta diagrammi nupu alt leiab tulemused. Agregatsiooni suuruse alt saab valida, mitut olemit näha soovitakse.

source: Preprocessing the Data
et: Andmete eeltöötlemine

source: Preprocessing the data is a standard procedure in machine learning which in TTK can be done via MLP (multilingual preprocessor) module.
et: Andmete eeltõõtlemine on masinõppes standardprotseduur mida TTK-s võimaldab teha MLP (multilingual preprocessor) moodul.

source: To use it, navigate to **Tools -> MLP**. Click **Create** button to define a new MLP worker. Select indices and fields on which you want to apply MLP. Since preprocessing the data is quite time-consuming process, it is strongly recommended to select only fields on which applying MLP is actually useful. That is, the fields which you are going to use later to create lexicons or train models on. Lastly, select analyzers which you would like to apply.
et: Selle kasutamiseks liigu menüüs **Tools -> MLP**. Vajuta **Create** nuppu et luua uus MLP lõim. Vali indeksid ja väljal, millele soovid MLP-d rakendada. Kuna MLP rakendamine andmetele võib võrdlemisi palju aega võtta, on rangelt soovituslik valida ainult väljad, millele MLP rakendamiseks on ka päriselt kasu. See tähendab, et valima peaks ainult väljad, mida on plaanis hiljem kasutada leksikonide loomiseks või mudelite treenimiseks. Viimaks vali analüsaatorid, mida soovid andmetel rakendada.

source: Figure 10. *Creating a MLP worker*
et: Joonis 10. *MLP lõime loomine*

source: The worker adds new fields containing the results to the dataset. You can see the list of fields using Search.
et: MLP rakendamise tulemusena lisatakse andmestikule uued välja, mis sisaldavad analüsaatorite tulemusi. Neid saab näha näiteks Search-is.

source: Figure 11. *Newly added fields containing results of MLP*
et: Figure 11. *Ued, MLP tulemusi sisaldavad väljad.*

source: Creating Topic-related Lexicons
et: Teemaleksikonide loomine

source: In order to build lexicons, we must have :ref:`Embedding <embedding_concept>` model :ref:`previously trained <embedding>` . We can start creating topic-related lexicons.
et: Leksikonide loomiseks peab olemas olema :ref:`varem treenitud <embedding>` :ref:`Embeddingu <embedding_concept>` mudel. Alles siis saab alustada teema leksikonide loomist.

source: Let’s create a lexicon that contains verbs accompanied with “bribery”.
et: Loome leksikoni, mis sisaldab sõnaga “bribery” kaasas olevaid verbe.

source: After clicking on the newly created lexicon, we have to provide some seed words like 'accuse'.
et: Pärast vastloodud leksikoni peale vajutamist on tarvis lisada mõned seemnesõnad nagu 'accuse'.

source: The process of creating (or expanding) the lexicon is iterative. We keep asking for suggestions and from those we have to pick the ones that make sense to us. We keep asking for suggestions until we get no more meaningful responses. Words we didn't choose appear under the lexicon as negative words. These are considered as the opposite of the meanings we are looking for. We can erase words from the negative words list simply by clicking on it.
et: Leksikoni loomine (või täiendamine) on iteratiivne protsess. Uusi soovitusi saab pidevalt juurde küsida ning nende seast tuleb valida need, mis tunduvad loogilised. Uusi soovitusi tasub juurde küsida, kuni ükski neist ei ole enam tähenduslikult sobiv. Valimata jäänud sõnad ilmuvad leksikoni alla negatiivsete näidetena. Neid võetakse otsitavate tähenduste vastandtähendustena. Sõnu saab negatiivsete sõnade listist kustutada nende peale klõpsates.

source: To add a suitable word to the lexicon, we simply have to click on it. If we want to delete something we already chose we can erase the verb from the list.
et: Sobiva sõna leksikoni lisamiseks tuleb sellele klõpsata. Leksikoni valitud sõnad ei jää sinna kinni, juba valitud sõnu on võimalik leksikonist kustutada.

source: When we’re ready, we can save the lexicon.
et: Kui leksikon on valmis, saab selle salvestada.

source: Statistical Language Modelling
et: Statistiline keelemudel

source: Under the *Models* option on the upper panel we can use different taggers and create embeddings.
et: Ülapaneelil oleva *Models*-i all saame kasutada erinevaid märgendajaid ja luua sõnavektoreid.

source: Embedding
et: Sõnavektorid (embeddings)

source: :ref:`Embeddings <embedding_concept>` are basically words converted into numerical data (into vectors) that are more understandable and usable for the machine than plain strings (words). With these vectors created, we can compare words and find similar ones. We need embeddings to create, for example, :ref:`lexicons <lexicons>`. Texta Toolkit uses word2vec embeddings with `collocation detection <https://radimrehurek.com/gensim/models/phrases.html>`_. It means that the vectors are created on words and phrases. Phrases are chosen with collocation detection which finds often together occuring words and marks them as phrases.
et: :ref:`Sõnavektorid <embedding_concept>` on põhimõtteliselt arvutile arusaadavamasse numbrilisse vormi (vektoritsesse) teisendatud sõnad, mis on masina jaoks loogilisemad, kui tühipaljad sõned (sõnad). Loodud vektorite abil on võimalik sõnu võrrelda või leida sarnaseid. Sõnavektoreid on vaja näiteks :ref:`leksikonide <lexicons>` tarbeks. Texta Toolkit kasutab word2vec sõnavektoreid `collocation detection-iga <https://radimrehurek.com/gensim/models/phrases.html>`_. Viimane tähendab, vektoreid luuakse nii sõnadele kui ka fraasidele. Fraasid valib välja collocation detection (kollokatsioonide tuvasti), mis tuvastab tihti koos esinevaid sõnu ja märgib need fraasideks.
