Repository: texta-tk/texta-tk.github.io
Catalog: locale/*/LC_MESSAGES/importer.po
Languages: et

source: Dataset Importer is a tool for uploading **JSON Lines**, **CSV** and **Excel** files into :ref:`Elasticsearch <elasticsearch>` to make them accessible for TEXTA Toolkit.
et: Dataset Importer on tööriist **JSON Lines**, **CSV** ja **Exceli** failide :ref:`Elasticsearchi <elasticsearch>` laadimiseks, et teha need kättesaadavaks TEXTA Toolkitile.

source: Creation
et: Loomine

source: Parameters:
et: Parameetrid:

source: description - Normal description to separate any given task from the other ones.
et: desctiption - Tavaline töö kirjeldus, mille abil eristatakse antud importimistteistest.

source: index - Name of the newly created index, please note that Elasticsearch :ref:`index <index_concept>` naming restrictions apply.
et: index - Vastloodud indeksi nimi. Pane tähele, et sellel kehtivad Elasticsearchi :ref:`index <index_concept>` nimepiirangud.

source: separator - Only needed for .csv files, defaults to a comma (,). Allows to configure the separator for csv files.
et: separator - Vajalik vaid .csv failide puhul. Vaikimisi on koma (,). Selle abil saab muuta .csv failide eristajat (separator).

source: file - File to import (**JSON Lines**, **CSV**, **Excel**)
et: file - Fail, mida hakatakse importima (**JSON Lines**, **CSV**, **Excel**)

source: You can navigate to the Dataset Importer by clicking on the "Dataset Importer" button located under the Tools dropdown menu. (:numref:`importing_loc`).
et: Dataset Importerit saab valida rippmenüüst Tools > Dataset Importer. (:numref:`importing_loc`).

source: Click on the **CREATE** button to open up a new form (:numref:`importing`).
et: Vajuta **CREATE** nupule, et avada uus importimistöö (:numref:`importing`).

source: Here you can:
et: Siin saad:

source: Set a description for the import task
et: Määrata importimistööle kirjeldus

source: Set the Dataset name
et: Möörata andmestiku nimi

source: Specify a separator for **CSV** files (usually a comma)
et: Täpsustada **CSV** failide eraldajat (tavaliselt koma)

source: Browse and choose the file to be uploaded by clicking on the folder button.
et: Lehitseda ja valida üleslaaditavaid faile, vajutades kausta nupule.

source: Click on the **Create** button to start the Importer Task. Upon completion you can add the dataset to your :ref:`project <project_concept>`.
et: Vajuta **Create** nupule importimistöö alustamiseks. Kui importimine on tehtud, saad lisada uue andmestiku oma :ref:`projekti <project_concept>`.

source: *Navigating to dataset importer*
et: *Dataset Importeri juurde navigeerimine*

source: *Importing a new dataset*
et: *Uue andmestiku importimine*

source: @ is special syntax for reading the binary of the given file name.
et: @ on eriline süntaksimärk binaarse faili lugemiseks.
