Repository: texta-tk/texta-tk.github.io
Catalog: locale/*/LC_MESSAGES/installation.po
Languages: et

source: Installation
et: Installimine

source: Installation Using Docker (recommended)
et: Installimine Dockeriga (soovitatud)

source: Currently all installation examples for system dependencies are only shown for Debian-based systems.
et: Hetkel on kõik süsteeminõuete installimise näited siin vaid Debian-i põhistel süsteemidel.

source: Install Docker
et: Dockeri installimine

source: The easiest way to run TEXTA Toolkit is to use our prebuilt Docker images from our registries. For doing so, one needs to install *Docker* and *docker-compose*:
et: Lihtsaim viis TEXTA Toolkiti jooksutamiseks on käivitada ette valmistatud Dockeri pilte TTK registritest. Selleks peab installima *Docker*-i and *docker-compose*-i:

source: To run Elasticsearch in Docker, we need to increase maximum map count parameter for virtual memory:
et: Elasticsearchi Docker-is kasutamiseks on vaja tõsta maksimaalset *map count* parameetrit virtuaalmälule:

source: Configure docker-compose
et: Seadista *docker-compose*

source: We are using *docker-compose* to build an ecosystem of services to support our needs. This is all defined in a file called **docker-compose.yaml**. To successfully run TEXTA Toolkit we need to define following services:
et: *docker-compose*-i kasutatakse selleks, et oleks olemas keskkond, mille teenused rahuldaksid meie vajadusi. Need teenused on defineeritud failis **docker-compose.yaml**. TEXTA Toolkiti edukaks jooksutamiseks on vaja järgnevaid teenuseid:

source: Elasticsearch for storing the documents (one can also run it without Docker)
et: Elasticsearch dokumentide hoiustamiseks (saab kasutada ka Dockerita)

source: MySQL or Postgres for storing user and project data (can also be run without Docker)
et: MySQL ja Postgres kasutaja ja projektiandmete hoiustamiseks (saab kasutada ka Dockerita)

source: TEXTA Toolkit RESTful API for backend: docker.texta.ee/texta/texta-rest:latest
et: TEXTA Toolkit RESTful API (*backend*): docker.texta.ee/texta/texta-rest:latest

source: For executing aforementioned services we have preconfigured an example **docker-compose.yaml** file:
et: Eelnimetatud teenuste käivitamiseks oleme loonud **docker-compose.yaml** näidisfaili:

source: The compose file is used in combination with **env** file located in the same directory as *docker-compose.yaml* containing environment variables needed for operating TEXTA Toolkit:
et: Seda faili kasutatakse üheskoos **env** failiga, mis on *docker-compose.yaml*-iga samas kaustas ja mis sisaldab endas *enviroment* muutujaid, mida on TEXTA Toolkiti jooksutamiseks tarvis:

source: Run TEXTA Toolkit
et: TEXTA Toolkiti käivitamine

source: Before running TEXTA Toolkit, we should have 2 files in our current working directory:
et: Enne TEXTA Toolkiti käivitamist peab töökaustas olema 2 faili:

source: With the **docker-compose.yaml** and **env** files present and accounted for, let's pull the images and start the services by executing the following commands in the same directory with **docker-compose.yaml** and **env**:
et: Kui failid **docker-compose.yaml** ja **env** on valmis, võib Dockeri pildid alla tõmmata ja teenused käivitada, kasutades järgnevaid käske **docker-compose.yaml** ja **env** failidega samas kaustas:

source: For running in detached mode, use the *-d* flag:
et: *Detached mode*-i kasutamiseks kasuta *-d* lippu:

source: TEXTA Toolkit's dockerized version comes with a default superuser account:
et: TEXTA Toolkit-i Dockeri versiooniga tuleb vaikimisi kaasa superkasutaja konto:

source: When running, TEXTA Toolkit's GUI should be available at:
et: Kui TEXTA Toolkit jookseb, on selle GUI saadaval aadressil:

source: and API at:
et: ja API aadressil:

source: For stopping the services:
et: Teenuste peatamiseks kasuta käsku:

source: Installation for Development
et: Installimine arenduse jaoks

source: If you want to develop TEXTA Toolkit, want more control over how you run it, or seriously dislike Docker, it is also possible to install Toolkit using Anaconda (or Miniconda as shown in following examples).
et: Kui Sulle ei meeldi Docker või soovid TEXTA Toolkitti arendada ja saada selle jooksutamise üle rohkem kontrolli, võid Toolkitti installida ka Anacondaga (või Minicondaga nagu on näidetes näha).

source: Install Miniconda
et: Installi Miniconda

source: First we need to download and install Miniconda to manage Python environments. We choose Miniconda over Anaconda because it's smaller in size, but Toolkit works well with both.
et: Esiteks tuleb alla laadida ja installida Miniconda Pythoni keskkondade haldamiseks. Me eelistame Minicondat Anacondale, kuna see on mahult väiksem, kuid Toolkit töötab hästi mõlemas.

source: Also, let's permanently put Conda binaries to **PATH** variable:
et: Esiteks määrame Conda binaarfailid **PATH** muutujasse:

source: Clone the Repository
et: Repositooriumi kloonimine

source: Now, let's clone the repository and move to **texta-rest** direcory:
et: Kloonime repositooriumi ja navigeerime **texta-rest** kausta:

source: Build the Environment
et: Ehita Conda keskkond

source: Now that we have **environment.yaml** file from the texta-rest repository, let's use it to build the environment. After the environment is built, let's activate it:
et: Nüüd, kus meil on **environment.yaml** fail texta-rest repositooriumist, kasutame seda keskkonna ehitamiseks. Seejärel aktiveerime selle:

source: Migrate & Run Toolkit
et: Migreeri ja käivita Toolkit

source: After the environment has been created and activated, let's prepare the database:
et: Pärast keskkonna loomist ja aktiveerimist, valmistame ette andmebaasi:

source: Running the **migrate.py** script will prepare Django migrations and execute them. It is necessary to run the script every time the source code changes because Toolkit's data model might have changed as well. It is also required to run the script before using Toolkit for the first time to create both superuser account and database used to store the data model.
et: **migrate.py** skripti jooksutamine valmistab ette Django migratsioonid ja käivitab need. Seda skripti peab kasutama iga kord, kui lähtekood muutub, kuna Toolkiti andmemudel võib samuti olla muutunud. Lisaks on seda skripti vaja jooksutada enne Toolkiti esimest korda kasutamist, kuna see tekitab superkasutaja konto ja andmebaasi, mida kasutatakse andmemudeli hoiustamiseks.

source: Running **migrate.py** will also create a default superuser account with following credentials:
et: **migrate.py** jooksutamine tekitab vaikimisi superkasutaja konto järgnevate andmetega:

source: Finally let's run the development server:
et: Lõpuks jooksutame arendusserverit:

source: And in another terminal run the Celery worker responsible for asynchronous tasks:
et: Ja teises terminalis jooksutame Celery't, mis vastutab asünkrooniliste ülesannete eest:
