Repository: texta-tk/texta-tk.github.io
Catalog: locale/*/LC_MESSAGES/language_detector.po
Languages: et

source: Language Detector
et: Keeletuvasti (Language Detector)

source: :ref:`Language Detector <lang_det_concept>` is a tool for detecting languages of the chosen :ref:`indices <index_concept>` documents. It uses `langdetect python module <https://pypi.org/project/langdetect/>`_. This is useful for getting a quick overview of the languages presented in your dataset and parse out documents in a certain language for future work.
et: :ref:`Keeletuvasti <lang_det_concept>` abil saab tuvastada valitud :ref:`indeksi <index_concept>` iga dokumendi keelt. Keeletuvasti kasutab `langdetect python moodulit <https://pypi.org/project/langdetect/>`_. Selle abil saab kiire ülevaate andmestikus esinevatest keeltest ning parsida edaspidi vaid kindlas keeles dokumente.

source: Creation
et: Loomine

source: Parameters
et: Parameetrid

source: Name of the Language Detector application task. This is necessary only for differentiating between all the Language Detector tasks in the project.
et: Keeletuvasti töönimi. See on vajalik vaid selleks, et eristada kõiki keeletuvasti töid antud projektis.

source: List of Elasticsearch :ref:`indices <index_concept>` containing the documents to analyze. NB! Indices should be formatted as list of dicts, where key = "name" and value = <index_name>, e.g:
et: Analüüsitavaid dokumente sisaldavad Elasticsearchi :ref:`indeksid <index_concept>`.NB! Indeksid peavad olema antud sõnastike järjendiga, kus võti = "name" ja väärtus = <index_name>, nt:

source: List of field names (as strings) that are containing the content to analyze.
et: Analüüsitavate väljade nimede järjend sõnedena.

source: The :ref:`query <query_concept>` restricting the set of documents to analyze. In the API, the query should be formatted as a JSON string. In the GUI :ref:`saved searches <savedsearches>` can be used. By default empty and all the documents in the chosen indices are then analyzed.
et: :ref:`Päring <query_concept>`, millega võetakse indeksist analüüsimisse minevad dokumendid välja API-s peab päring olema formeeritud JSON sõnena. GUI-s saab kasutada :ref:`salvestatud otsinguid <savedsearches>`. Vaikimisi on päring tühi ning sel juhul analüüsitakse kõiki dokumente valitud indeksi(te)s.

source: For creating a new Language Detector task, navigate to **"Tools"** -> **"Language Detector"** and click on the button **"CREATE"** in the upper left corner of the page. A new window with the title "Apply Language Detector task" opens as a result. Fill all the required fields and then click on the button "Create" in the bottom right corner of the window (:numref:`lang_det_create`). The new Language Detector task should now appear as a new row in the list of Language Detector tasks on the same page (if not, try refreshing the page).
et: Keeletuvasti töö alustamiseks mine **"Tools"** -> **"Language Detector"** ja vajuta **"CREATE"**-nupule ülal vasakul.Ilmub uus aken pealkirjaga "Apply Language Detector task". Täida vajalikud väljad ja vajuta "Create"-nupule all paremal nurgas (:numref:`lang_det_create`). Uus Keeletuvasti töö peaks nüüd ilmuna uue reana Keeletuvasti tööde nimekirja. (kui ei ilmu, proovi lehe värskendamist).

source: *Language Detector creation window*
et: Keeletuvasti töö loomisaken

source: After the task has finished (status is "completed"), you can view the results in Search. The output of language analysis is stored in the `field <field_concept>` ``<source_field>_mlp.language_detected``.
et: Kui töö on lõpetatud (staatus näitab "completed"), saab tulemusivaadata Searcheris. Keeleanalüüsi tulemus on talletatud`välja <field_concept>` ``<algne_väli>_mlp.language_detected``.

source: Endpoint for /api/v1/ : **/projects/{project_pk}/lang_index/**
et: Otspunkt /api/v1/-le : **/projects/{project_pk}/lang_index/**

source: Endpoint for /api/v2/ : **/projects/{project_pk}/lang_index/**
et: Otspunkt /api/v2/-le : **/projects/{project_pk}/lang_index/**

source: Example:
et: Näidis:

source: Response:
et: Vastus:
