Repository: texta-tk/texta-tk.github.io
Catalog: locale/*/LC_MESSAGES/lexicon_miner.po
Languages: et

source: Texta Toolkit enables the creation of topic-related lexicons which can be used to expand the Searcher's results (e.g. defining classes for classifiers). In order to build lexicons, you must have an :ref:`Embedding <embedding_concept>` model :ref:`previously trained <create_embedding>` .
et: Texta Toolkiti abil saab luua temaatiliste sõnade leksikone, mida saab kasutada Otsingu (Searcheri) tulemuste laiendamiseks (nt klassifitseerijate tarbeks klasside määratlemiseks). Leksikonide loomiseks peab olemas olema :ref:`varem treenitud <embedding_concept>` :ref:`Embeddingu <embedding_concept>` mudel.

source: Usage
et: Kasutus

source: Parameters
et: Parameetrid

source: List of words similar to which suggestions are to be found. These are the positive input for the model's similarity search. In GUI called "positives".
et: Nimekiri sõnadest, millele sarnaseid sõnu (sarnases kontekstis kasutatavaid sõnu) soovitakse leida. Need on positiivne sisend mudeli sarnasusotsingule. GUI-s nimetatud kui "positives".

source: List of words similar of which suggestions are NOT to be found or old suggestions that didn't make it to the positives' list. These are the negative input for the model's similarity search. In GUI called "negatives".
et: Nimekiri sõnadest, millele sarnaseid sõnu EI soovita leida või vanad soovitused, mis ei jõudnud positiivsete sõnade listi. Need on negatiivne sisend mudeli sarnasusotsingule. GUI-s nimetatud kui "negatives".

source: List of words already mined out, but not to be used in the model's similarity search. These won't occur in the output (suggestions list).
et: Nimekiri sõnadest, mis on juba välja kaevandatud (ehk valitud), kuid mida ei soovita kasutada mudeli sarnasusotsingus. Need ei esine soovituste (Suggestions) nimekirjas.

source: List of words of the suggestions that weren't chosen, but are not to be used as negatives in the models' similarity search. These won't occur in the output (suggestions list).
et: Nimekiri soovitustest, mida ei valitud, kuid mida ei kasutata mudeli sarnasusotsingus negatiivsete sõnadena. Need ei esine soovituste (Suggestions) nimekirjas.

source: The number of output words. In GUI it's by default 20.
et: Väljastatavate sõnade hulk. GUI-s on see vaikimisi 20.

source: For creating a lexicon, type the name of the lexicon in the "Description" slot after clicking "CREATE"-button under "Lexicons" and press enter. The new lexicon appears in the table. Click on the lexicon's row. Lexicon's mining view opens.
et: Leksikoni loomiseks vajuta "CREATE"-nuppu "Lexicons" all, kirjuta leksikoni nimi ""Description" vahemikku ja vajuta enetrit. Uus leksikon ilmub tabelisse. Vajuta selle leksikoni reale. Leksikoni kaevandamise vaade avaneb.

source: Choose the embedding trained in Toolkit to work with. Provide some seed words (like 'sport' if you are after finding sport-related terms) in the Positives list separated by a newline.
et: Vali Toolkitis treenitud sõnavektor, millega töötada soovid. Trüki sisse mõned seemnesõnad (nt 'sport', kui soovid leida sporditeemalisi artikleid) Positives nimekirja. Kirjuta iga sõna eraldi reale.

source: The process of creating (or expanding) the lexicon is iterative. Keep asking for suggestions via:
et: Leksikoni loomise (või laiendamise) protsess on iteratiivne. Küsi uusi soovitusi kahe nupu abil:

source: **New Suggestions** button, which transfers unchosen words into Negatives list where they are used as the opposites in the model's similarity search.
et: **New Suggestions** nupp, mis tõstab valikust välja jäänud sõnad Negatives listi, kus neid kasutatakse negatiivsete sõnadena mudeli sarnasusotsingus.

source: or
et: või

source: **Clear Suggestions** button, which transfers the unchosen words into Negatives unused list where they are not used in the model's similarity search but are filtered out from the next possible suggestions. To get new suggestions after clearing the list, use the New Suggestions button again.
et: **Clear Suggestions** nupp, mis tõstab valikust välja jäänud sõnad Negatives unused listi, kus neid ei kasutata mudeli sarnasusotsingus. Samas ei soovitata neid enam uuesti. Uute soovituste saamiseks pärast selle nupu kasutamist, vajuta uuesti New Suggestions nupule.

source: Pick the ones from the Suggestions list that make sense by clicking on them. Keep asking for suggestions until you get no more meaningful responses. You can also expand the lexicon based on one or two words while storing (but not mining with) the already mined out words in the Positives unused list.
et: Vali soovitustest (Suggestions) need sõnad, mis tunduvad sobivad, neile klõpsates. Küsi soovitusi uuesti, kuni enam ei tule ühtegi sobivat soovitust. Sa võid proovida laiendada leksikoni ka ühe või kahe seemnesõnaga, hoides juba välja kaevandatud sõnu Positives unused listis.

source: To add a suitable word to the lexicon from the Suggestions list, you simply have to click on it. Alternatively, you can type yourself some words you have come up while reading through the suggestions into the list.
et: Sobiva sõna leksikoni lisamiseks tuleb sellele klõpsata Suggestion nimekirjast. Alternatiivselt võid ise tükkida nimekirja sõnu, mille peale tulid soovituste nimekirja lehitsedes.

source: Don't forget to save the lexicon when you are ready!
et: Ära unusta leksikoni salvestada, kui oled valmis!
