Repository: texta-tk/texta-tk.github.io
Catalog: locale/*/LC_MESSAGES/mlp.po
Languages: et

source: Preprocessing the data is a standard procedure in machine learning which in TTK can be done via MLP (:ref:`MultiLingual Preprocessor <mlp>`) module.
et: Andmete eeltöötlemine on standardne protseduur masinõppes. TTK-s saab seda teha MLP mooduli (:ref:`MultiLingual Preprocessor <mlp>`) abil.

source: TEXTA MLP (Multilingual Processor) is an additional module of TEXTA created for the sake of processing and enriching textual data. Capable of processing multiple languages, it's features include the lemmatization of text, Named Entity extraction, entity linking and more. To make access to the module more efficient and smoother, it has been integrated directly into the Toolkit. Choosing which features the user wants to apply on their text is handled by selecting "Analyzers".
et: TEXTA MLP (mitmekeelne eeltöötleja) on lisamoodul TEXTA-s, mis loodi tekstiandmete eeltöötlemiseks ja rikastamiseks. See suudab erinevates keeltes lemmatiseerida, tunda ära nimiolemeid, tuvastada seotud olemite gruppe jne. MLP kergemaks kasutamiseks on see lisatud Toolkitti. "Analyzer"-te alt saabvalida, milliseid analüsaatoreid teksti peal rakendatakse.

source: Users can apply the MLP to a singular text of their own choosing or apply it to multiple Elasticsearch indices at once.
et: Kasutajad saavad rakendada MLP-d ühele tekstile või mitmele Elasticsearchi indeksile korraga.

source: For convenience purposes the Toolkit supports several input types along with processing several Elasticsearch indices at once, the latter however is a time consuming process depending on the size of the index and the length of the processed fields.
et: Mugavuse huvides toetab Toolkit erinevaid sisendi tüüpe, sh mitme Elasticsearchi indeksi korraga töötlemist. Viimane on siiski väga aeganõudev sõltuvalt indeksi suurusest ja töödeldavate väljade pikkusest.

source: Analyzers
et: Analüsaatorid

source: Analyzers are a way of selecting how you want your data to be processed, whether you only want lemmatization or Entity extraction. Currently, the following analyzers are supported:
et: Analüsaatorite abil saab valida, mis viisil andmeid töödeldakse: kas soovid ainult lemmatiseerimist või ka näiteks olemituvastust. Hetkel toetatakse järgnevaid analüsaaotreid:

source: lemmas - Adds a lemmatized version of the original text.
et: lemmas - Lisab originaalteksti lemmatiseeritud versiooni.

source: pos_tags - Adds the Part Of Speech tags of every token in the text.
et: pos_tags - Lisab sõnaliigi märgendi igale tekstiühikule.

source: transliteration - Adds a representation of scripted languages (Russian, Arabic) in the latin alphabet.
et: transliteration - litereerib ladina tähestikku teistes tähestikes kirjutatud keeled (vene, araabia).

source: ner - Adds Named Entities in Texta Fact format (Please note that NER for Estonian is currently not available).
et: ner - Lisab nimeolemid Texta fakti formaadis (NER eesti keelele ei ole hetkel saadaval).

source: entities - Keyword based Entity Extraction, used to extract information like predefined addresses.
et: entities - Võtmesõnadel põhinev olemituvastus, kasutatakse informatsiooni nagu näiteks eeldefineeritud aadresside eraldamiseks.

source: namemail - Extracts name-email pairs from text in Texta Facts format.
et: namemail - Tuvastab nime-mailide paarid tekstist Texta fakti formaadis.

source: bounded - Links existing Texta Facts together by the basis of it belonging to the same Entity and returns a new Texta Fact.
et: bounded - Ühendab olemasolevad Texta faktid kokku sama olemi juurde kuuluvateks gruppideks ja tagastab grupi Texta faktina.

source: Creating
et: Loomine

source: Navigate to **Tools -> MLP**. Click **Create** button to define a new MLP worker. Select indices and fields on which you want to apply MLP. Since preprocessing the data is quite time-consuming process, it is strongly recommended to select only fields on which applying MLP is actually useful. That is, the fields which you are going to use later to create lexicons or train models on. Lastly, select analyzers which you would like to apply.
et: Navigeeri **Tools -> MLP**. Vajuta **Create** nuppu ja defineeri uus MLP töö. Vali indeksid ja väljad, millele tahad MLP-d rakendada. Kuna andmete eeltöötlemine on üsna aeganõudev protsess, soovitame valida vaid need väljad, kus MLP rakendamine tegelikult ka on kasulik. See tähendab välju, mille põhjal plaanid hiljem treenida mudeleid või luua leksikone. Viimaseks vali analüsaatorid, mida soovid rakendada.

source: *Creating a MLP worker*
et: MLP töö loomine

source: The worker adds new fields containing the results to the dataset. You can see the list of fields using Search.
et: MLP tulemused pannakse andmestikku uutesse väljadesse. Neid saab näha Searcheris väljade nimekirjas.

source: *Newly added fields containing results of MLP*
et: *Uued väljad andmestikus MLP tulemustega*

source: Applying
et: Rakendamine

source: Applying MLP on a single text instance
et: MLP rakendamine ühele tekstile

source: For applying MLP on a single instance of text, click on the "Apply to text" button inside **Tools -> MLP**.
et: MLP ühele tekstilõigule rakendamiseks, vajuta "Apply to text" nupule kohas **Tools -> MLP**.

source: *Applying MLP on a single instance of text.*
et: *MLP rakendamine ühele tekstilõigule.*

source: Endpoint: **/mlp/texts/**
et: Otspunkt: **/mlp/texts/**

source: This takes input in list format. Just use a single-element list.
et: See võtab sisendiks järjendi (listi). Kasuta lihtsalt üheelemendilist järjendit.

source: Example:
et: Näide:

source: Response:
et: Vastus:

source: Applying MLP on a list of texts
et: MLP rakendamine tekstijärjendile

source: Applying MLP on a list of dictionaries
et: MLP rakendamine sõnastikujärjendile

source: Endpoint: **/mlp/docs/**
et: Otspunkt: **/mlp/docs/**

source: Applying MLP on index
et: MLP rakendamine indeksile

source: Endpoint: **/mlp_index/**
et: Otspunkt: **/mlp_index/**

source: *Withholding the analyzers field will make it default into using all analyzers which is time-insufficient.*
et: 'analyzers' välja mitte kasutamine rakendab vaikimisi kõik analüsaatorid, tehes eeltöötlemise protsessi aeganõudvaks.
