Repository: texta-tk/texta-tk.github.io
Catalog: locale/*/LC_MESSAGES/projects.po
Languages: et

source: Projects
et: Projektid

source: API reference: http://localhost:8000/api/v1/redoc/#tag/projects
et: API viide: http://localhost:8000/api/v1/redoc/#tag/projects

source: Create
et: Loomine

source: Before we can start working with the data, we need to create a project.
et: Enne andmetega tööle asumist tuleb luua projekt.

source: Click on the **CREATE** button on the top-left of the front page. Fill in the title field - this will be the name of your project; select users who should have access to the project and finally choose indices that you are going to work with in the project.
et: Vajuta **CREATE** nupule avalehe üleval vasakus ääres. Täida avanenud lahtrid: *title* - see on sinu loodava projekti nimi; väljal *users* vali kasutajad, kes peaksid saama ligipääsuõiguse projektile ning väljal *indices* vali indeksid, millega sa projektis tööle hakkad.

source: You can select more than one index.
et: Projekti saab valida rohkem kui ühe indeksi.

source: We can see the newly created project in the list on the front page (:numref:`project_list`).
et: Vastloodud projekt ilmub nähtavale avalehel projektide nimekirjas (:numref:`project_list`).

source: *Projects list*
et: *Projektide nimekiri*

source: API endpoint: **/projects/**
et: API otspunkt: **/projects/**

source: Edit
et: Muutmine

source: On the front page, click on three dots under **Action** column (:numref:`project_actions`) and choose **Edit**.
et: Vajuta avalehel kolmele punktile **Action** veerus (:numref:`project_actions`) ja vali **Edit**.

source: Only superusers can edit the project.
et: Ainult administraatori õigustega kasutajad saavad projekti muuta.

source: API endpoint: **/projects/{project_pk}/**
et: API otspunkt: **/projects/{project_pk}/**

source: Delete
et: Kustutamine

source: On the front page, click on three dots under **Action** column (:numref:`project_actions`) and choose **Delete**.
et: Vajuta avalehel kolmele punktile **Action** veerus (:numref:`project_actions`) ja vali **Delete**.

source: *Project actions*
et: *Projekti toimingud*

source: Navigate between Projects
et: Projektide vahel navigeerimine

source: To start working on the project, we need to activate it - click on three dots under **Action** column (:numref:`project_actions`) and choose **Use**. Another way to select a project is from the list on the top-right corner (:numref:`user_projects`). The list will show you all the projects that you are a member of.
et: Et projekti kallal tööle asuda, tuleb see aktiveerida. Selleks kliki avalehel kolmele punktile **Action** veerus (:numref:`project_actions`) ja vali **Use**. Teine võimalus on valida see projekt nimekirjast avalehe ülemisest paremast nurgast (:numref:`user_projects`). Sealses nimekirjas on näha kõik projektid, mille liige sa oled.

source: Only one project can be activated at a time.
et: Korraga saab aktiveerida ainult ühe projekti.

source: *User projects*
et: *Kasutaja projektid*

source: Permissions
et: Õigused
