Repository: texta-tk/texta-tk.github.io
Catalog: locale/*/LC_MESSAGES/regex_tagger.po
Languages: et

source: :ref:`Regex Tagger <regex_tagger_concept>` is a tool for tagging texts based on predefined `regular expressions <https://en.wikipedia.org/wiki/Regular_expression>`_ , i.e. regexes.
et: :ref:`Regex Tagger <regex_tagger_concept>` on tööriist tekstide mustripõhiseks märgendamiseks `regulaaravaldiste <https://en.wikipedia.org/wiki/Regular_expression>`_ abil.

source: Regex Tagger is built on `Python's regex module <https://docs.python.org/3/library/re.html>`_ and thus it's important to use the same syntax while constructing your patterns.
et: Regex Tagger baseerub `Pythoni regexi moodulil <https://docs.python.org/3/library/re.html>`_, mistõttu tuleks mustrite loomisel kasutada samuti Pythoni regulaaravaldiste süntaksit.

source: Creation
et: Loomine

source: The following section covers everything we need to know about creating Regex Taggers. For getting an overview of the input parameters, see subsection :ref:`Parameters <creation_parameters>`; for creating a Regex Tagger via graphical user interface, see subsection :ref:`GUI <creation_gui>`; for creating a Regex Tagger via API, see subsection :ref:`API <creation_api>`.
et: Järgnev sektsioon katab kõik Regex Taggerite loomisega seonduva.Peatükis :ref:`Parameetrid <creation_parameters>` antakse ülevaade sisendparamteetritest; peatükis :ref:`GUI <creation_gui>` antakse ülevaade Regex Taggerite loomisest graafilise kasutajaliidese kaudu; Peatükis :ref:`API <creation_api>` antakse ülevaade Regex Taggerite loomisest API kaudu.

source: Parameters
et: Parameetrid

source: The following section gives an overview of Regex Tagger input parameters.
et: Järgnev peatükk annab ülevaate Regex Taggeri sisendparameetritest.

source: Name of the Regex Tagger model, which is also used as name of the tag while tagging the documents.
et: Regex Taggeri nimi, mida kasutatakse ühtlasi ka märgendina.

source: List of lexicon entries to match (as comma-separated strings in API or newline-separated strings in GUI).
et: Nimekiri leksikonikannetest, mida tekstist otsida.

source: Lexicon entries can either be regular words (e.g. "cat"), phrases (e.g. "black cat"), or regular expressions containing regex wildcard characters(e.g. "\d{2}-\d{2}-\d{4}").
et: Leksikonikanded võivad olla tavalised sõna (nt. "kass"), fraasid (nt. "must kass"), või regulaaravaldised (nt. "\d{2}-\d{2}-\d{4}").

source: List of annulling lexicon entries, which cancel out nearby (see parameter :ref:`counter_slop <param_counter_slop>`) main lexicon matches. Annulling lexicon entries can similarly to main lexicon entries be regular words, phrases, or regular expressions.
et: Nimekiri põhileksikonikandeid annulleerivatest sõnadest/fraasidest/regulaaravaldistest.

source: Logical operation for matching words in the lexicon.
et: Loogiline operatsioon leksikonikannete sidumiseks.

source: Supported options:
et: Toetatud valikud:

source: Return positive result if at least one lexicon entry is found.
et: positiivse tulemuse tagastamiseks peab tekstis leiduma vähemalt üks leksikonikannetest.

source: Return positive result only if all lexicon entries are found (NB! pay attention to :ref:`required_words <param_required_words>` parameter!)
et: positiivne tulemust tagastatakse üksnes siis, kui tekstis esinevad kõik leksikonikanded. (NB! vaata ka parameetrit to :ref:`required_words <param_required_words>`!)

source: Required minimum ratio of detected lexicon entries to all the lexicon entries for a positive result. E.g. if we have a lexicon consisting of 4 entries and "required_words" = 1.0, all 4 of these entries must appear in the text for positive outcome; if "required_words" = 0.5, only half of the lexicon entries must appear in the text etc.
et: Nõutud minimaalne leksikonikannete osakaal tekstis. Näiteks, kui meil onneljast sõnast koosnev leksikon ja parameeter "required_words" = 1.0, siis tagastatakse positiivne tulemusüksnes juhul, kui kõik leksikonis leiduvat 4 sõna esinevad ka tekstis; kui aga parameeter "required_words" = 0.5, piisab positiivse tulemuse jaoks üksnes poolte sõnade tekstis esinemisest.

source: Has effect only if "operator" = "and".
et: Parameetril on mõju üksnes juhul kui "operator" = "and"

source: Specifies how the lexicon entries are matched.
et: Leksikonikannete teksti sõnadele/fragmentidele sobitamise viis.

source: Lexicon entry should appear at the beginning of the word/phrase in the text. Subsequent alphanumeric characters are allowed. E.g. Lexicon entry "cat" matches the words "cat" and "caterpillar", but would not match the word "scattered".
et: Leksikonikanne peab esinema tekstis leiduva sõna/fraasi alguses, kuid sellele võib järgneda ka muid alfabeetilisi tähemärke. Näiteks tuvastatakse leksikonikanne "kass" nii sõnadest "kass" kui ka "kassid", kuid mitte sõnast "karkass".

source: Lexicon entry should match the word/phrase in the text exactly. No preceeding or subsequent characters are allowed. E.g. Lexicon entry "cat" matches the word "cat", but would not match the words "caterpillar", and "scattered".
et: Leksikonikanne peab täielikult ühtima tekstis leiduva sõna/fraasiga. Näiteks tuvastatakse leksikonikanne "kass" sõnast "kass", kuid mitte sõnadest "kassid" ega "karkass"

source: Lexicon entry should match a part of the word/phrase in the text. Preceeding and subsequent characters are allowed. E.g. Lexicon entry "cat" matches the words "cat", "caterpillar", and "scattered".
et: Leksikonikanne peab esinema tekstis leiduvas sõna/fraasis, kuid nii selle ees kui ka järel võib olla ka teisi alfabeetilisi tähemärke.Näiteks tuvastatakse leksikonikanne "kass" nii sõnadest "kass", "kassid" kui ka "karkass".

source: Number of non-lexicon words allowed between lexicon entry words.
et: Lubatud maksimaalne leksikoniväliste sõnade arv iga leksikonikande sõnade vahel

source: Number of non-lexicon words allowed between main lexion entries and counter lexicon entries for the latter to have annulling effect.
et: Lubatud maksimaalne sõnade arv põhileksikonikannete ja annuleerivate leksikonikannete vahel, et annuleerival leksikonikandel mõju oleks.

source: If enabled, return the whole alphanumeric string sequence matched, otherwise only the (sub)section exactly matching the original lexicon entry.
et: Aktiveerituna tagastatakse terve sõna/fragment, kust leksikonikanne tuvastati.

source: Number of allowed character changes between lexicon entry and matched string sequence, i.e. `Levenshtein distance <https://en.wikipedia.org/wiki/Levenshtein_distance>`_.
et: Lubatud maksimaalne tähemuudatuste arv tekstis leiduva sõna/fragmendi ning leksikonikande vahel (`Levenshteini kaugus <https://en.wikipedia.org/wiki/Levenshtein_distance>`_.").

source: One edit is considered as one of the following:
et: Tähemuudatuseks loetakse ühte järgnevast:

source: missing a character, e.g. "cat" -> "ct"
et: tähe puudumine, nt. "kass" -> "kas"

source: adding a character, e.g. "cat" -> "catt"
et: tähe lisamine nt. "kass" -> "klass"

source: substituting a character, e.g. "cat" -> "kat"
et: tähe asendamine nt. "kass" -> "gass"

source: If set true, ignore case while detecting matches.
et: Aktiveerituna ignoreeritakse tõusutundlikkust.

source: If enabled, ignore end-of-sentence characters between lexicon entry words and/or counter lexicon entries and lexicon entries.
et: Lause lõppu tähistavate tähemärkide esinemine leksikonikande sõnade vahel muudab tuvastatud kande kehtetuks; lause lõppu tähistavate tähemärkide esinemine põhileeksikonikande ning annuleeriva leksikonikande vahel, muudab annuleeriva leksikonikande mõju kehtetuks.

source: Ignored end-of-sentence characters are: [".", "!", "?"]
et: Ignoreeritavate lauselõpumärkide hulka kuuluvad: [".", "!", "?"]

source: Be careful with using the parameter as end-of-sentence characters are detected naively based on list. This means that the parameter restriction applies even if the detected end-of-sentence character doesn't actually denote the end of a sentence, e.g. each "." is detected as end-of-sentence character in the sentence "George R.R. Martin and J.R.R. Tolkien went fishing".
et: Ole antud parameetri kasutamisel ettevaatlik, kuna lauselõpumärgid tuvastatakse "naiivselt" nimekirja alusel. See aga tähendab, et parameetri seatud piirang kehtib ka juhul kui tekstist tuvastatud nimekirja kuuluv märk vastavas kontekstis tegelikult lause lõppu ei tähista. Näiteks lauses "George R.R. Martin ja J.R.R. Tolkien läksid kalale", loetakse lauselõpumärkide hulka kõik punktid, olgugi et nad seda tegelikult ei ole.

source: For creating a new Regex Tagger model, navigate to `"Models" -> "Regex Taggers"` as seen in :numref:`regex_tagger_navigation`.
et: Uue Regex Taggeri mudeli loomiseks, navigeeri menüüribal `"Models" -> "Regex Taggers"` nagu kujutatud joonisel :numref:`regex_tagger_navigation`.

source: *Regex Taggers navigation*
et: *Navigatsioon Regex Taggerini*

source: If the navigation is successful, you should see a panel similar to :numref:`regex_tagger_create_button` with `"Create"` button in the top left corner of the page.
et: Kui navigatsioon õnnestub, näed joonisega :numref:`regex_tagger_create_button` sarnast paneeli, mille ülemises vasakus nurgas asub nupp nimega `"Create"`

source: *Regex Tagger creation button*
et: *Regex Taggeri loomisnupp*

source: Clicking on the `"Create"` button opens a modal window with text `"New Regex Tagger"` as depicted in :numref:`regex_tagger_new_regex_tagger`.
et: `"Create"` nupu vajutamise järel avaneb hüpikaken tekstiga `"New Regex Tagger"` (vt. :numref:`regex_tagger_new_regex_tagger`).

source: *Empty Regex Tagger creation view*
et: *Regex Taggeri loomisaken enne väljade täitmist*

source: Fill the required :ref:`fields <field_concept>` and click on the `"Create"` button in the bottom right corner of the window (:numref:`regex_tagger_create_view`).
et: Täida nõutud :ref:`väljad <field_concept>`, muuda soovi korral vaikeparameetreid ning vajuta siis "`"Create"` nupule all paremas nurgas (vt. :numref:`regex_tagger_create_view`).

source: *Filled Regex Tagger creation view*
et: *Regex Taggeri loomisaken pärast väljade täitmist*

source: The created Regex Tagger can now be seen as the first (or only, if no previous Regex Taggers exist under the project) row in the table of Regex Tagger models (:numref:`regex_taggers_list`).
et: Loodud Regex Tagger kuvatakse nüüd Regex Taggerite tabeli esimesel (või ainsal) real.

source: *List of Regex Taggers.*
et: *Saadaolevate Regex Taggerite nimekiri*

source: Endpoint **/projects/{project_pk}/regex_taggers/**
et: Otspunkt **/projects/{project_pk}/regex_taggers/**

source: Example:
et: Näide:

source: Usage
et: Kasutamine

source: The following section covers all functions supported by Regex Tagger. PS! Some of the functions can only be applied through API as they have no meaningful usage scenarios in GUI.
et: Järgnevas sektsioonid kaetakse kõik Regex Taggeri funktsioonid. PS! Teatud funktsioone on võimalik rakendada üksnes läbi API.

source: Function `"Delete"` allows deleting existing Regex Tagger models.
et: Funktsioon `"Delete"` võimaldab Regex Taggeri mudeleid kustutada.

source: For deleting a Regex Tagger model through GUI, navigate to `"Models" -> "Regex Taggers"` as seen in :numref:`regex_tagger_navigation`. There are two options for deleting a Regex Tagger model:
et: Regex Taggeri mudeli kustutamiseks, navigeeri menüüribal `"Models" -> "Regex Taggers"` nagu kujutatud joonisel:numref:`regex_tagger_navigation`. Regex Taggeri kustutamiseks on kaks varianti:

source: **Option 1**:
et: **Variant 1**:

source: Select the model you wish to delete by navigating to the options panel denoted with three vertical dots as seen in :numref:`regex_tagger_list_v2` and select option `"Delete"` from the selection menu as seen in :numref:`regex_tagger_delete`.
et: Vali mudel, mida soovid kustutada ning navigeeri kolme vertikaalse punktiga tähistatud valikute paneelile (:numref:`regex_tagger_list_v2`) ning vali avanenud menüüst `"Delete"` (:numref:`regex_tagger_delete`)

source: *Delete a single Regex Tagger*
et: *Üksiku Regex Taggeri mudeli kustutamine*

source: **Option 2**:
et: **Variant 2**:

source: Select the model(s) you wish to delete by clicking on the selection boxes in front of Regex Tagger model(s) (:numref:`regex_tagger_bulk_delete`). If all the models you wish to delete are selected, click on the red recycle bin icon beside `"Create"` button in the top left corner of the page.
et: Selekteeri kõik mudelid, mida soovid kustutada klikkides kastidele iga Regex Taggeri mudeli ees. (:numref:`regex_tagger_bulk_delete`). Seejärel vajuta punasele prügikasti ikoonile `"Create"` nupu kõrval lehekülje ülemises vasakus nurgas.

source: *Bulk delete Regex Tagger(s)*
et: *Mitme Regex Taggeri mudeli samaaegne kustutamine*

source: *Delete Regex Tagger(s) confirmation*
et: *Regex Taggeri mudeli(te) kustutamise kinnitus*

source: After following all the previously described steps (for either of the two options), the interface should now ask your confirmation for finishing the process (:numref:`regex_tagger_delete_confirmation`). Agree by clicking on the button `"Delete"`.
et: Pärast emma-kumma variandi kõikide eelkirjeldatud sammude läbimist, kuvab kasutajaliides enne mudeli(te) lõplikku kustutamist kinnitusakent. Kustutamise protsessi lõpule viimiseks vajuta nupule `"Delete"`.

source: Endpoint **/projects/{project_pk}/regex_taggers/{id}/**
et: Otspunkt **/projects/{project_pk}/regex_taggers/{id}/**

source: Function `Duplicate` allows making a copy of an existing Regex Tagger. It is especially useful if you are fine-tuning a specific model but aren't sure that the modifications will actually improve it - just make a copy before you start editing.
et: Funktsioon `Duplicate` võimaldab eksisteerivast Regex Taggeri mudelist koopia tegemist.

source: For duplicating a Regex Tagger model, navigate to `"Models" -> "Regex Taggers"` as seen in :numref:`regex_tagger_navigation`. Select the model you wish to duplicate and navigate to options panel denoted with three vertical dots as seen in :numref:`regex_tagger_list_v2`.
et: Regex Taggeri mudelist koopia tegemiseks, navigeeri `"Models" -> "Regex Taggers"` (:numref:`regex_tagger_navigation`). Vali mudel, millest soovid koopia teha ning ava valikute paneel liikudes kolmele vertikaalsele punktile mudelirea lõpus (:numref:`regex_tagger_list_v2`).

source: *Duplicate Regex Tagger*
et: *Regex Taggeri mudeli duplikaadi tegemine.*

source: Select option "Duplicate" from the selection menu as seen in :numref:`regex_tagger_duplicate`.
et: Vali avanenud menüüst "Duplicate" (:numref:`regex_tagger_duplicate`).

source: *Duplicated Regex Tagger*
et: *Loodud duplikaat*

source: Selecting the option instantly triggers the duplication process and the duplicated Regex Tagger model appears in the list of Regex Tagger models with name `"<source_tagger_name>_copy"` (:numref:`regex_tagger_duplicate_list`).
et: Nupule vajutamise tagajärjel luuakse valitud Regex Taggeri duplikaat, mis ilmub koheselt ka Regex Taggeri mudelite nimekirja nimega `"<lähtemudeli_nimi>_copy"` (:numref:`regex_tagger_duplicate_list`).

source: Endpoint **/projects/{project_pk}/regex_taggers/{id}/duplicate/**
et: Otspunkt **/projects/{project_pk}/regex_taggers/{id}/duplicate/**

source: Function `"Edit"` allows editing existing Regex Tagger models.
et: Funktsioon `"Edit"` võimaldab Regex Taggeri mudeleid pärast loomist muuta.

source: For editing a Regex Tagger model, navigate to `"Models" -> "Regex Taggers"` as seen in :numref:`regex_tagger_navigation`. Select the model you wish to edit and navigate to options panel denoted with three vertical dots as seen in :numref:`regex_tagger_list_v2`.
et: Regex Taggeri mudeli muutmiseks, navigeeri `"Models" -> "Regex Taggers"` (:numref:`regex_tagger_navigation`). Vali mudel, mida muuta soovid ning ava valikute menüü klikkides kolmele vertikaalsele punktile valitud mudeli rea lõpus (:numref:`regex_tagger_list_v2`).

source: *Edit Regex Tagger*
et: *Muuda Regex Taggerit*

source: Select option "Edit" from the selection menu as seen in :numref:`regex_tagger_edit`.
et: Vali avanenud menüüst "Edit" (:numref:`regex_tagger_edit`).

source: *Edit Regex Tagger modal window*
et: *Regex Taggeri muutmisaken*

source: Selecting the option opens a new modal window `"Edit Regex Tagger"`. Make your modifications and click on `"Submit"` button in the bottom right corner of the panel (:numref:`regex_tagger_edit_modal`).
et: Valitud nupule klikkimise tagajärjel avaneb aken kirjaga `"Edit Regex Tagger"`. Tee soovitud muudatused ning vajuta akna alumises paremas nurgas asuvale nupule `"Submit"` (:numref:`regex_tagger_edit_modal`).

source: `"Tag Random Doc"` is a helpful function for testing Regex Tagger models on random documents.
et: Funktsioon "`"Tag Random Doc"` võimaldab märgendada juhusliku dokumendi valitud andmestikust.

source: For tagging a random document with an existing Regex Tagger model, navigate to `"Models" -> "Regex Taggers"` as seen in :numref:`regex_tagger_navigation`. Select the model you wish to use and navigate to the options panel denoted with three vertical dots. Select the option "Tag Random Doc" from the selection menu as seen in :numref:`regex_tagger_tag_random_doc`.
et: Juhusliku dokumendi märgendamiseks Regex Taggeri mudeliga, navigeeri `"Models" -> "Regex Taggers"` nagu kujutatud joonisel :numref:`regex_tagger_navigation`. Vali mudel, mida märgendamiseks kasutada ning ava vastava mudeli valikmenüü vajutades mudeli rea lõpus olevale kolmele vertikaalsele punktile. Vali avanenud menüüst "Tag Random Doc" nagu kujutatud joonisel :numref:`regex_tagger_tag_random_doc`.

source: *"Tag Random Doc" option in the selection menu*
et: *"Tag Random Doc" valikmenüüs*

source: Selecting the option opens a new modal window with the title `"Tag Random Doc"`. Select the index or indices you wish to use from the `"Indices"` selection menu displayed in the window after clicking on the corresponding section and select the :ref:`field(s) <field_concept>` you wish to use from the `"Select Fields"` selection menu below. If finished, click on the button `"Tag"` in the bottom right corner of the panel (:numref:`regex_tagger_tag_random_doc_mw`).
et: Nupule vajutamise tagajärjel avaneb uus aken pealkirjaga `"Tag Random Doc"`. Vali menüüst pealkirjaga `"Indices"` andmestik(ud), mille seast juhuslik dokument valida ning menüüst pealkirjaga `"Select Fields"` dokumendi :ref:`väljad <field_concept>`, mida märgendamiseks kasutada. Seejärel vajuta akna alumises paremas nurgas asuvale nupule `"Tag"` (:numref:`regex_tagger_tag_random_doc_mw`).

source: *Regex Tagger "Tag Random Doc" window.*
et: *"Tag Random Doc" aken enne märgendamist.*

source: The results are displayed in the same modal window as seen in :numref:`regex_tagger_tag_random_pos` if any matches were detected. If no matches where found, the text `"No matches found"` is displayed as seen in :numref:`regex_tagger_tag_random_neg`.
et: Märgendamise tulemused kuvatakse samas aknas. Joonis :numref:`regex_tagger_tag_random_pos` kujutab positiivset märgendamise tulemust (juhuslikult valitud dokumendist leiti valitud mudeliga märgendid). Joonis :numref:`regex_tagger_tag_random_neg` kujutab negatiivset märgendamise tulemust (juhuslikult valitud dokumendist valitud mudeliga märgendeid ei tuvastatud).

source: *"Tag Random Doc" positive output*
et: *"Tag Random Doc" positiivne tulemus*

source: *"Tag Random Doc" negative output*
et: *"Tag Random Doc" negatiivne tulemus*

source: PS! The :ref:`fields <field_concept>` in the document not selected by the user and/or not containing any matches are by default collapsed, but you can view their content by clicking on the arrow icon at the end of each field (:numref:`rt_tag_random_doc_other_fields`.)
et: PS! Dokumendi :ref:`völjad <field_concept>`, mida kasutaja märgendamiseks ei valinud või kust märgendeid ei leitud, on vaikimisi suletud. Soovi korral on neid võimalik aga avada klikkides nooleikoonil vastava välja sektsiooni lõpus (:numref:`rt_tag_random_doc_other_fields`).

source: *"Tag Random Doc" collapsing/uncollapsing fields.*
et: *"Tag Random Doc" väljade avamine ja sulgemine.*

source: Endpoint **/projects/{project_pk}/regex_taggers/{id}/tag_random_doc/**
et: Otspunkt **/projects/{project_pk}/regex_taggers/{id}/tag_random_doc/**

source: Response (positive):
et: Vastus (positiivse tulemuse korral)

source: Response (negative):
et: Vastus (negatiivse tulemuse korral)

source: Function `"Tag Text"` enables tagging a single text with a selected Regex Tagger model.
et: Funktsioon `"Tag Text"` võimaldab Regex Taggeri mudeliga teksti märgendamist.

source: For tagging a text with an existing Regex Tagger model, navigate to `"Models" -> "Regex Taggers"` as seen in :numref:`regex_tagger_navigation`.
et: Teksti märgendamiseks navigeeri menüüribal `"Models" -> "Regex Taggers"` nagu kujutatud joonisel :numref:`regex_tagger_navigation`.

source: *List of existing Regex Tagger models*
et: *Saadaolevate Regex Taggerite nimekiri*

source: Select the model you wish to use and navigate to options panel denoted with three vertical dots as seen in :numref:`regex_tagger_list_v2`.
et: Vali mudel, mida märgendamiseks kasutada soovid ning ava valikmenüü klikkides kolmele vertikaalsele punktile rea lõpus (:numref:`regex_tagger_list_v2`).

source: *Tag Text option in selection menu*
et: *Teksti märgendamine valikmenüüs*

source: Select option "Tag Text" from the selection menu as seen in :numref:`regex_tagger_tag_text`.
et: Vali avanenud menüüst "Tag Text" (:numref:`regex_tagger_tag_text`).

source: *Tag Text modal window*
et: *Teksti märgendamise aken*

source: Selecting the option opens a new modal window `"Tag Text"`. Insert the text you wish to tag and click on the button `"Tag"` in the bottom right corner of the panel (:numref:`regex_tagger_tag_text_modal`).
et: Valitud nupule klikkimise tagajärjel avaneb uus aken kirjaga `"Tag Text"`. Sisesta tekst, mida soovid märgendada ning vajuta akna alumises paremas nurgas asuvale nupule `"Tag"` (:numref:`regex_tagger_tag_text_modal`).

source: *Tag Text positive output*
et: *Tekstist tuvastatud märgendid*

source: *Tag Text negative output*
et: *Tekstist ei tuvastatud ühtegi märgendit*

source: The results are displayed in the same modal window as seen in :numref:`regex_tagger_tag_text_pos_output` if any matches where detected. If no matches where found, the text `"No matches found"` is displayed as seen in in :numref:`regex_tagger_tag_text_neg_output`.
et: Märgendamise tulemused kuvatakse samas aknas (:numref:`regex_tagger_tag_text_pos_output`). Juhul kui tekstist valitud mudeliga märgendeid ei leita, kuvatakse aknas kiri `"No matches found"` (:numref:`regex_tagger_tag_text_neg_output`).

source: Endpoint **/projects/{project_pk}/regex_taggers/{id}/tag_text/**
et: Otspunkt **/projects/{project_pk}/regex_taggers/{id}/tag_text/**
