Repository: texta-tk/texta-tk.github.io
Catalog: locale/*/LC_MESSAGES/regex_tagger_group.po
Languages: et

source: Regex Tagger Group allows combining multiple `Regex Tagger <https://docs.texta.ee/v2/regex_tagger.html>`_ models into a group which can then be used for tagging documents. The resulting tags are formatted as `Texta Facts <https://docs.texta.ee/v2/terminology.html#fact>`_.
et: Regex Tagger Group (Regex Taggerite grupp) on tööriist `Regex Taggeri <https://docs.texta.ee/v2/regex_tagger.html>`_ mudelite grupeerimiseks, et neid seejäral andmete märgendamiseks kasutada. Tulemuseks saadud märgendid on vormindatud `Texta Facts <https://docs.texta.ee/v2/terminology.html#fact>`_ formaadis.

source: **API Reference**: `<http://localhost:8000/api/v1/redoc/#tag/projects-greater-regex_tagger_groups>`_
et: **API viide**: `<http://localhost:8000/api/v1/redoc/#tag/projects-greater-regex_tagger_groups>`_

source: Creation
et: Loomine

source: Regex Tagger Group can be created only if at least one `Regex Tagger <https://docs.texta.ee/v2/regex_tagger.html>`_ model exists.
et: Regex Tagger Groupi on võimalik luua üksnes juhul, kui eksisteerib vähemalt üks `Regex Taggeri <https://docs.texta.ee/v2/regex_tagger.html>`_ mudel.

source: Parameters
et: Parameetrid

source: Input
et: Sisend

source: Regex Tagger models to be added to the group.
et: Gruppi lisatavad Regex Taggeri mudelid.

source: Name of the Regex Tagger Group, which will also be used as the name of the tag while tagging the documents. The name can be found in the following field after tagging:
et: Regex Taggeri Groupi nimi, mida kasutatakse hiljem ühtlasi dokumentide märgendina. Märgendamise käigus lisatakse Regex Taggeri Groupi nimi järgnevale väljale:

source: Output
et: Väljund

source: ID of the created Regex Tagger Group
et: Loodud Regex Tagger Groupi ID.

source: URL of the created Regex Tagger Group
et: Loodud Regex Tagger Groupi URL.

source: IDs of Regex Taggers present in the group.
et: Gruppi kuuluvate Regex Taggeri mudelite ID-d.

source: Creator of the Regex Tagger Group.
et: Regex Tagger Groupi looja.

source: Celery task connected with the group.
et: Grupiga seotud Celery protsess.

source: Name of the Regex Tagger Group.
et: Loodud Regex Tagger Groupi nimi.

source: Parameters of each Regex Tagger present in the group.
et: Iga gruppi kuuluva Regex Taggeri mudeli parameetrid.

source: For creating a new Regex Tagger Group, navigate to `"Models" -> "Regex Tagger Groups"` as seen in :numref:`rtg_nav`.
et: Uue Regex Tagger Groupi loomiseks navigeeri `"Models" -> "Regex Tagger Groups"` nagu kujutatud joonisel :numref:`rtg_nav`.

source: *"Regex Tagger Group" navigation*
et: *Navigatsioon Regex Tagger Groupini*

source: If the navigation is successful, you should see a panel similar to :numref:`rtg_create_button` with the `"Create"` button in the top left corner of the page.
et: Eduka navigatsiooni korral peaksid nägema joonisega :numref:`rtg_create_button` sarnast lehekülge, mille ülemises vasaskus nurgas asub nupp nimega `"Create"`.

source: *"Regex Tagger Group" creation button*
et: *Regex Tagger Groupi loomisnupp*

source: Clicking on the `"Create"` button opens a modal window with text `"New Regex Tagger Group"` as depicted in :numref:`new_rtg`.
et: `"Create"` nupule vajutamise tagajärjel avaneb uus aken pealkirjaga `"New Regex Tagger Group"` nagu kujutatud joonisel :numref:`new_rtg`.

source: *Empty "Regex Tagger Group" creation view*
et: *Täitmata väljadega "Regex Tagger Group" loomisaken*

source: Name the new Regex Tagger Group by filling in the field `"Description"` and select Regex Tagger models to add to the group from the Regex Taggers' selection menu below. If finished, click on the `"Create"` button in the bottom right corner of the window (:numref:`new_rtg_create`).
et: Anna Regex Tagger Groupile nimi sisestades see väljale `"Description"` ning vali gruppi lisatavad Regex Taggeri mudelid mudelite välja`"Regex Taggers"` alt avanevast valikmenüüst. Valitud sisendparameetritega Regex Taggeri Groupi loomiseks vajuta akna almuses paremas nurgas asuvale nupule `"Create"` (:numref:`new_rtg_create`).

source: *Filled "Regex Tagger Group" creation view*
et: *Täidetud väljadega "Regex Tagger Groupi" loomisaken*

source: The created Regex Tagger Group can now be seen as the first (or only, if no previous Regex Tagger Groups exist under the project) row in the table of Regex Tagger Groups (:numref:`rtg_list`).
et: Loodud Regex Tagger Group ilmub nüüd Regex Tagger Groupide tabelisse (:numref:`rtg_list`).

source: *List of Regex Tagger Groups.*
et: *Nimekiri eksisteerivatest Regex Tagger Groupidest.*

source: Reference: `<http://localhost:8000/api/v1/redoc/#operation/projects_regex_tagger_groups_create>`_
et: Viide: `<http://localhost:8000/api/v1/redoc/#operation/projects_regex_tagger_groups_create>`_

source: Endpoint **/projects/{project_pk}/regex_tagger_groups/**
et: Otspunkt **/projects/{project_pk}/regex_tagger_groups/**

source: Example:
et: Näide:

source: Response:
et: Vastus:

source: Usage
et: Kasutamine

source: Name of the application task.
et: Rakendusprotsessi nimi.

source: List of fields onto which the selected models are applied.
et: Nimekiri väljadest, millele valitud mudeleid rakendada.

source: Number of documents processed in one batch.
et: Ühes partiis töödeldavate dokumentide arv.

source: Regex Tagger Groups to apply.
et: Rakendatavad Regex Tagger Groupid.

source: Only supported in GUI.
et: Toetatud ainult graafilises kasutajaliideses.

source: *"Apply Regex Tagger Group" button*
et: *Nupp "Apply Regex Tagger Group"*

source: *"Apply Regex Tagger Group" window*
et: *"Apply Regex Tagger Group" aken*

source: If the application task creation was successful, the Task status of the selected Regex Tagger Group models should now be `"created"` or `"running"` as seen in :numref:`rtg_apply_running`.
et: Kui rakendamise protsessi loomine õnnestus, kuvatakse valitud Regex Tagger Groupi mudeli(te) "Task" väljas staatus `"created"` või `"running"` nagu kujutatud joonisel :numref:`rtg_apply_running`.

source: *"Apply Regex Tagger Group" task has started*
et: *"Apply Regex Tagger Group" protsess on edukalt loodud*

source: If the application process is finished, you can now browse the results in Search (:numref:`rtg_apply_searcher`). The created tags can be found from the field `"texta_facts"`.
et: Pärast märgendamise protsessi lõpule jõudmist, saab tulemusi näha Search vaates (:numref:`rtg_apply_searcher`). Loodud märgendid asuvad väljal `"texta_facts"`.

source: *"Apply Regex Tagger Group" output in Search.*
et: *"Apply Regex Tagger Group" väljund Search vaates.*

source: Reference: `<http://localhost:8000/api/v1/redoc/#operation/projects_regex_tagger_groups_apply_tagger_group>`_
et: Viide: `<http://localhost:8000/api/v1/redoc/#operation/projects_regex_tagger_groups_apply_tagger_group>`_

source: Endpoint **/projects/{project_pk}/regex_tagger_groups/{id}/apply_tagger_group/**
et: Otspunkt **/projects/{project_pk}/regex_tagger_groups/{id}/apply_tagger_group/**

source: Function `"Delete"` allows deleting existing Regex Tagger Groups.
et: Funktsioon `"Delete"` võimaldab Regex Tagger Groupide kustutamist.

source: Deleting a Regex Tagger Group **does NOT** delete Regex Tagger models belonging to the group.
et: Regex Tagger Groupi kustutamisel **EI** kustu sellesse kuulunud Regex Taggeri mudelid.

source: For deleting a Regex Tagger Group through GUI, navigate to `"Models" -> "Regex Tagger Groups"` as seen in :numref:`rtg_nav`. There are two options for deleting a Regex Tagger Group:
et: Regex Tagger Groupi kustutamiseks navigeeri `"Models" -> "Regex Tagger Groups"` nagu kujutatud joonisel :numref:`rtg_nav`. Regex Tagger Groupi kustutamiseks on kaks võimalust:

source: **Option 1**:
et: **Variant 1:**

source: Select the Regex Tagger Group you wish to delete by navigating to the options panel denoted with three vertical dots and select the option `"Delete"` from the selection menu as seen in :numref:`rtg_delete`.
et: Vali Regex Tagger Group, mida soovid kustutada, avades vastava grupi rea lõpus asuvale kolmele vertikaalsele punktile klikkides valikmenüü. Vali avanenud menüüst `"Delete"` nagu kujutatud joonisel :numref:`rtg_delete`.

source: *Delete a single Regex Tagger Group*
et: *Regex Tagger Groupi kustutamine*

source: **Option 2**:
et: **Variant 2:**

source: Select the model(s) you wish to delete by clicking on the selection boxes in front of the Regex Tagger Groups(s). If all the models you wish to delete are selected, click on the red recycle bin icon beside the `"Create"` button in the top left corner of the page. (:numref:`rtg_bulk_delete`).
et: Tee märge kõikide mudelite ette, mida kustutada soovid. Seejärel vajuta lehe ülemises vasakus nurgas asuvale punasele prügikastiikooniile Regex Tagger Groupi mudelite tabeli kohal. (:numref:`rtg_bulk_delete`).

source: After following all the previously described steps (for either of the two options), the interface should now ask your confirmation for finishing the process (:numref:`rtg_delete_confirm`). Agree by clicking on the button `"Delete"`.
et: Pärast emma-kumma versiooni eelkirjeldatud sammude läbimist küsitakse enne mudeli(te) lõplikku kustutamist kasutajalt kinnitust (:numref:`rtg_delete_confirm`). Vajuta protsessi lõpuleviimiseks kinnituskanas nupule `"Delete"`.

source: *Delete Regex Tagger Group(s) confirmation*
et: *Regex Tagger Groupi(de) kustutamise kinnitusaken.*

source: Reference: `<http://localhost:8000/api/v1/redoc/#operation/projects_regex_tagger_groups_delete>`_
et: Viide: `<http://localhost:8000/api/v1/redoc/#operation/projects_regex_tagger_groups_delete>`_

source: Endpoint **/projects/{project_pk}/regex_tagger_groups/{id}/**
et: Otspunkt **/projects/{project_pk}/regex_tagger_groups/{id}/**

source: For editing an existing Regex Tagger Group, select the Regex Tagger Group you wish to edit and navigate to the options panel by clicking on the three vertical dots at the end of the Regex Tagger Group row. Select the option `"Edit"` as seen in :numref:`rtg_edit`.
et: Regex Tagger Groupi muutmiseks navigeeri vastava grupi valikmenüüle vajutades kolmele vertikaalsele punktile valitud Regex Tagger Groupi rea lõpus. Vali avanenud menüüst `"Edit"` nagu kujutatud joonisel :numref:`rtg_edit`.

source: Clicking on the option opens a new modal window with text `"Edit Regex Tagger Group"`. Make your modifications and click on the `"Apply"` button in the bottom right corner of the modal window for finishing the process (:numref:`rtg_edit_window`.)
et: Valiku sooritamise tagajärjel avaneb uus aken pealkirjaga `"Edit Regex Tagger Group"`. Tee soovitud muudatused ning vajuta nende jõustumiseks akna alumises paremas nurgas asuvale nupule `"Apply"` (:numref:`rtg_edit_window`).

source: *"Edit Regex Tagger Group" window*
et: *Muutmisaken "Edit Regex Tagger Group"*

source: Reference: `<http://localhost:8000/api/v1/redoc/#operation/projects_regex_tagger_groups_update>`_
et: Viide: `<http://localhost:8000/api/v1/redoc/#operation/projects_regex_tagger_groups_update>`_

source: Function `"Multitag Docs"` enables tagging one or many documents with multiple Regex Tagger Group models at once. Results are added to the field **"texta_facts"** accordingly:
et: Funktsioon `"Multitag Docs"` võimaldab mitme Regex Taggeri Groupi üheaegset rakendamist etteantud dokumentidele. Iga dokumendi märgendid kajastuvad vastavale dokumendile lisatud väljas **"texta_facts"** järgneva loogika alusel:

source: Documents to tag as a list of JSON dicts, e.g:
et: Märgendatavad dokumendid vormindatud JSON sõnastikuna, nt:

source: List of the Regex Tagger Group ID-s to use for tagging.
et: Nimekiri märgendamiseks kasutatavate Regex Tagger Groupide ID-dest.

source: Reference: `<http://localhost:8000/api/v1/redoc/#operation/projects_regex_tagger_groups_multitag_docs>`_
et: Viide: `<http://localhost:8000/api/v1/redoc/#operation/projects_regex_tagger_groups_multitag_docs>`_

source: Endpoint **/projects/{project_pk}/regex_tagger_groups/multitag_docs/**
et: Otspunkt **/projects/{project_pk}/regex_tagger_groups/multitag_docs/**

source: Function `"Tag Random Doc"` provides support for testing a Regex Tagger Group on a randomly selected document from a certain predefined dataset.
et: Funktsioon `"Tag Random Doc"` võimaldab loodud Regex Tagger Groupe testida kindlaks määratud andmestikust juhuslikult valitud dokumendi märgendamisega.

source: List of Elasticsearch indices (dataset) onto which the selected models are applied. NB! Indices should be formatted as dicts, where key = "name" and value = <index_name>, e.g:
et: Nimekiri Elasticsearchis indekseeritud andmestikest, millele mudeleid rakendada. NB! Andmestikud peavad olema vormindatud JSON sõnastikuna, milles võti = "name" ja väärtus = <indeksi_nimi>, nt:

source: ID of the Regex Tagger Group used for tagging.
et: Märgendamiseks kasutatatud Regex Tagger Groupi ID.

source: Name of the Regex Tagger Group used for tagging, i.e. Regex Tagger Group description.
et: Märgendamiseks kasutatud Regex Tagger Groupi nimi (ehk Regex Tagger Groupi `description` väärtus).

source: Boolean value indicating if any matches were detected.
et: Binaarväärtus, mis väljendab, kas dokumendile leiti valitud mudelitega märgendeid või mitte.

source: The randomly selected document.
et: Juhuslikult valitud dokument.

source: Detected matches in the "texta_facts" format.
et: Leitud märgendid "texta_facts" formaadis.

source: Name of the Regex Tagger Group (same as corresponding tagger_group_tag).
et: Regex Tagger Groupi nimi (sama, mis parameetri `tagger_group_tag` väärtus).

source: Name of the Regex Tagger model.
et: Regex Taggeri mudeli nimi.

source: Name of the field from where the match was detected.
et: Välja nimi, kust märgend tuvastati.

source: Position of the detected match in the input field.
et: Tuvastatud märgendi aktiveerinud mustri asukoht tekstis.

source: Dict given as JSON string containing corresponding Regex Tagger Group ID and Regex Tagger ID.
et: JSON string formaadis sõnastik võtmetega Regex Tagger Group ID ja Regex Tagger ID.

source: For tagging a random document with an existing Regex Tagger Group model, navigate to `"Models" -> "Regex Tagger Groups"` as seen in :numref:`rtg_nav`. Select the model you wish to use and navigate to the options panel denoted with three vertical dots. Select the option "Tag Random Doc" from the selection menu as seen in :numref:`rtg_random_doc`.
et: Juhusliku dokumendi märgendamiseks Regex Tagger Group mudeliga navigeeri `"Models" -> "Regex Tagger Groups"` nagu kujutatud joonisel :numref:`rtg_nav`. Vali mudel, mida märgendamiseks kasutada ning ava vastava mudeli valikmenüü vajutades mudeli rea lõpus olevale kolmele vertikaalsele punktile. Vali avanenud menüüst "Tag "Random Doc" nagu kujutatud joonisel :numref:`rtg_random_doc`.

source: *"Tag Random Doc" option in the selection menu*
et: *"Tag Random Doc" valikmenüüs*

source: Selecting the option opens a new modal window with the title `"Tag Random Doc"`. Select the index or indices you wish to use from the `"Indices"` selection menu displayed in the window after clicking on the corresponding section and select the field(s) you wish to use from the `"Select Fields"` selection menu below. If finished, click on the button `"Tag"` in the bottom right corner of the panel (:numref:`rtg_tag_random_doc_tag`).
et: Nupule vajutamise tagajärjel avaneb uus aken pealkirjaga `"Tag Random Doc"`. Vali menüüst pealkirjaga `"Indices"` andmestik(ud), mille seast juhuslik dokument valida ning menüüst pealkirjaga `"Select Fields"` dokumendi väljad, mida märgendamiseks kasutada. Seejärel vajuta akna alumises paremas nurgas asuvale nupule `"Tag"` (:numref:`rtg_tag_random_doc_tag`).

source: *Regex Tagger Group "Tag Random Doc" window.*
et: *"Tag Random Doc" aken enne märgendamist.*

source: *"Tag Random Doc" positive output*
et: *"Tag Random Doc" positiivne tulemus*

source: *"Tag Random Doc" negative output*
et: *"Tag Random Doc" negatiivne tulemus*

source: PS! The fields in the document not selected by the user and/or not containing any matches are by default collapsed, but you can view their content by clicking on the arrow icon at the end of each field (:numref:`rtg_tag_random_doc_other_fields`.)
et: PS! Dokumendi väljad, mida kasutaja märgendamiseks ei valinud või kust märgendeid ei leitud, on vaikimisi suletud. Soovi korral on neid võimalik aga avada klikkides nooleikoonil vastava välja sektsiooni lõpus (:numref:`rtg_tag_random_doc_other_fields`).

source: *"Tag Random Doc" collapsing/uncollapsing fields.*
et: *"Tag Random Doc" väljade avamine ja sulgemine.*

source: Reference: `<http://localhost:8000/api/v1/redoc/#operation/projects_regex_tagger_groups_tag_random_doc>`_
et: Viide: `<http://localhost:8000/api/v1/redoc/#operation/projects_regex_tagger_groups_tag_random_doc>`_

source: Endpoint **/projects/{project_pk}/regex_tagger_groups/{id}/tag_random_doc/**
et: Otspunkt **/projects/{project_pk}/regex_tagger_groups/{id}/tag_random_doc/**

source: Function `"Tag Text"` enables tagging a single text with a selected Regex Tagger Group by applying all the models belonging in the group to the selected text.
et: Funktsioon `"Tag Text"` võimaldab üksiku teksti märgendamist valitud Regex Tagger Groupi kuuluvate Regex Tagger mudelitega.

source: Text to tag.
et: Märgendatav tekst.

source: Input text.
et: Sisendtekst.

source: Name of the field from where the match was detected. Always "text" in the current endpoint.
et: Välja nimi, kust märgendid tuvastati. Antud juhul alati "text".

source: Position of the detected match in the text.
et: Tuvastatud märgendi aktiveerinud mustri asukoht tekstis.

source: For tagging a text with an existing Regex Tagger Group model, navigate to `"Models" -> "Regex Tagger Groups"` as seen in :numref:`rtg_nav`. Select the model you wish to use and navigate to the options panel denoted with three vertical dots. Select option "Tag Text" from the selection menu as seen in :numref:`rtg_tag_text`.
et: Teksti märgendamiseks Regex Tagger Group mudeliga navigeeri `"Models" -> "Regex Tagger Groups"` nagu kujutatud joonisel :numref:`rtg_nav`. Vali mudel, mida märgendamiseks kasutada soovid ning ava valikmenüü vajutades kolmele vertikaalsele punktile valitud mudeli rea lõpus. Vali avanenud menüüst "Tag Text" nagu kujutatud joonisel :numref:`rtg_tag_text`.

source: *"Tag Text" option in the selection menu*
et: *"Tag Text" valikmenüüs*

source: Selecting the option opens a new modal window with the title `"Tag Text"`. Insert the text you wish to tag and click on the button `"Tag"` in the bottom right corner of the panel (:numref:`rtg_tag_text_filled`).
et: Nupule vajutamise tagajärjel avaneb uus aken pealkirjaga `"Tag Text"`. Sisesta tekst, mida märgendada, ning vajuta akna alumises paremas nurgas asuvale nupule `"Tag"` (:numref:`rtg_tag_text_filled`).

source: *Regex Tagger Group "Tag Text" window.*
et: *Teksti märgendamise aken "Tag Text".*

source: The results are displayed in the same modal window as seen in :numref:`rtg_tag_text_output`, if any matches where detected. If no matches where found, the text `"No matches found"` is displayed as seen in :numref:`rtg_tag_text_neg_output`.
et: Tulemused kuvatakse samas aknas. Joonis :numref:`rtg_tag_text_output` kujutab positiivset märgendamise tulemust (tekstist leiti valitud mudeliga märgendid) ja joonis :numref:`rtg_tag_text_neg_output` kujutab negatiivset märgendamise tulemust (tekstist valitud mudeliga märgendeid ei leitud).

source: *"Tag Text" positive output*
et: *"Tag Text" positiivne tulemus*

source: *"Tag Text" negative output*
et: *"Tag Text" negatiivne tulemus*

source: Reference: `<http://localhost:8000/api/v1/redoc/#operation/projects_regex_tagger_groups_tag_text>`_
et: Viide: `<http://localhost:8000/api/v1/redoc/#operation/projects_regex_tagger_groups_tag_text>`_

source: Endpoint **/projects/{project_pk}/regex_tagger_groups/{id}/tag_text/**
et: Otspunkt **/projects/{project_pk}/regex_tagger_groups/{id}/tag_text/**
