Repository: texta-tk/texta-tk.github.io
Catalog: locale/*/LC_MESSAGES/reindexer.po
Languages: et

source: Reindexer is a tool for making copies or subsets of Elasticsearch :ref:`indices <index_concept>`. Reindexer can be used for various data management tasks:
et: Reindexer on tööriist Elasticsearchi :ref:`indeksitest <index_concept>` koopiate või alamhulkade loomiseks. Reindexeri on võimalik kasutada järgnevate ülesannete teostamiseks:

source: Making a copy of an index;
et: Andmestikust koopia loomiseks;

source: Merging multiple indices into one;
et: Mitme andmestiku liitmiseks;

source: Making a random subset of an index;
et: Alusandmestikust juhuslikult valitud dokumentidega alamhulga loomiseks;

source: Making a subset based on predefined :ref:`query <query_concept>`;
et: Eeldefineeritud kitsenduste ehk :ref:`päringute <query_concept>` alusel andmestiku alamhulga loomiseks;

source: Renaming fields;
et: Väljade ümbernimetamiseks;

source: Updating Elasticsearch :ref:`field <field_concept>` types.
et: :ref:`Väljade <field_concept>` Elasticsearchi andmetüübi muutmiseks.

source: Creation
et: Loomine

source: Parameters
et: Parameetrid

source: Name of the Reindexing task.
et: Reindekeerimise protsessi nimi.

source: List of Elasticsearch :ref:`indices <index_concept>` (datasets) to reindex.
et: Nimekiri reindekseeritavatest Elasticsearchi :ref:`indeksitest <index_concept>` (andmestikest).

source: List of fields to reindex, i.e. transfer to the new index. By default, all the fields in the source index are selected.
et: Nimekiri uude andmestikku ülekantavatest väljadest. Vaikimisi on valitud kõik väljad.

source: Specified Elasticsearch Search :ref:`query <query_concept>`. If left empty (and `random_size` is not defined), all documents from the source index are transferred to the new one.
et: Eeldefineeritud Elasticsearchi :ref:`otsingupäring <query_concept>`. Välja tühjaks jätmisel (juhul kui `random_size` parameeter on samuti väärtustamata), kantakse uude andmestikku üle kõik lähteandmestiku dokumendid.

source: Name of the target index.
et: Uue indeksi (andmestiku) nimi.

source: Random subset size. If defined, new index is constructed of given number of random documents. If left empty, all the documents in the source index (or in accordance with restricted search :ref:`query <query_concept>`) are reindexed.
et: Juhusliku alamhulga suurus. Välja väärtustamisel koostatakse uus indeks (andmestik) valitud arvust juhuslikest dokumentidest. Välja väärtustamata jätmisel kantakse uude andmestikku üle kõik lähteandmestiku (või kitsendatud otsingupäringule ":ref:`query <query_concept>`" vastavad) dokumendid.

source: List of new Elasticsearch :ref:`field<field_concept>` types in the following format:
et: Nimekiri Elasticsearchi :ref:`väljatüüpidest<field_concept>` järgnevas vormingus:

source: For creating a new Reindexing task, navigate to `"Tools" -> "Reindexer"` as seen in :numref:`reindexer_navigation`.
et: Uue reindekseerimisprotsessi loomiseks navigeeri: `"Tools" -> "Reindexer"` nagu kujutatud joonisel :numref:`reindexer_navigation`.

source: *Reindexer navigation*
et: *Navigatsioon Reindexeri tööriistani*

source: If the navigation is successful, you should see a panel similar to :numref:`reindexer_create_button` with `"Create"` button in the top left corner of the page.
et: Eduka navigatsiooni korral peaksid nägema joonisega :numref:`reindexer_create_button` analoogset lehte, mille ülemises vasakus nurgas asub nupp nimega `"Create"`.

source: *Reindexer creation button*
et: *Reindexeri loomisnupp*

source: Clicking on the `"Create"` button opens a new modal window with title `"New Reindexer"` as depicted in :numref:`reindexer_create_new`.
et: `"Create"` nupule vajutamise tagajärjel avaneb uus aken pealkirjaga `"New Reindexer"` nagu kujutatud joonisel :numref:`reindexer_create_new`.

source: *Empty Reindexer creation view*
et: *Tühi Reindexeri loomisaken*

source: Fill the required fields and click on the `"Create"` button in the bottom right corner of the window (:numref:`reindexer_create`).
et: Täida nõutud väljad ja vajuta nupule `"Create"` akna alumises paremas nurgas (:numref:`reindexer_create`).

source: *Filled Reindexer creation view*
et: *Täidetud Reindexeri loomisaken*

source: The created Reindexer can now be seen as the first (or only, if no previous Reindexers exist under the :ref:`project <project_concept>`) row in the table of Reindex tasks (:numref:`reindexer_task_list`).
et: Loodud Reindexer ilmub nüüd reindekseerimisprotsesside tabelisse (:numref:`reindexer_task_list`).

source: *List of Reindexer tasks.*
et: *Reindekseerimisprotsesside tabel*

source: Reference: `<http://localhost:8000/api/v1/redoc/#operation/projects_reindexer_create>`_
et: Viide: `<http://localhost:8000/api/v1/redoc/#operation/projects_reindexer_create>`_

source: Endpoint **/projects/{project_pk}/reindexer/**
et: Otspunkt **/projects/{project_pk}/reindexer/**

source: Example:
et: Näide:

source: Response:
et: Vastus:
