Repository: texta-tk/texta-tk.github.io
Catalog: locale/*/LC_MESSAGES/searcher.po
Languages: et

source: Search
et: Otsing (Search)

source: The Search application allows users to perform searches and aggregations over the data. Search results can be used as input to machine learning models.
et: Otsingurakendus (Search) võimaldab kasutajal teha otsinguid ja agregatsioone. Lisaks on otsingutulemusi võimalik anda sisendiks masinõppemudelitele.

source: To use the **Search** :ref:`project <project_concept>` and :ref:`indices <index_concept>` must be selected from the upper right panel.
et: Enne otsingu kasutamist tuleb ülevalt paremast nurgast valida :ref:`projekt <project_concept>` ja :ref:`indeksid <index_concept>`, mille peal otsingut tehakse.

source: The Search's graphical interface (:numref:`search_panel`) consists of three panels. These are :ref:`Current Search <currentsearch>`, :ref:`Saved Searches <savedsearches>`, and :ref:`Aggregations <aggregations>`. By default the panel of Current Search open. Clicking on the name of the panel collapses or opens that panel.
et: Otsingu graafiline kasutajaliides (:numref:`search_panel`) koosneb kolmest paneelist. Nendeks on praegune otsing (:ref:`Current Search <currentsearch>`), salvestatud otsingud (:ref:`Saved Searches <savedsearches>`) ja agregatsioonid (:ref:`Aggregations <aggregations>`). Vaikimisi on avatud praegune otsing. Alamosa avamiseks ja sulgemiseks kliki vastava osa nimele.

source: *Search panels*
et: Otsingurakenduse alamosad

source: The Searcher will only look into the datasets that are selected on the top-right panel.
et: Otsing teostatakse ainult indeksitel, mille kasutaja on ülemises paremas nurgas olevast indeksite menüüst valinud.

source: Current Search
et: Praegune otsing

source: Current Search is a tool for simple data browsing. It also allows us to create filters to only search for documents in our interest. For the latter purpose, we can create a set of constraints on :ref:`field <field_concept>` values. This can be done using either Simple Search or Advanced Search.
et: Praegune otsing on mõeldud andmete sirvimiseks. Otsingutulemusi saab ka piirata ainult meile huvipakkuvatele dokumentidele. Selleks on vaja luua filtrid ehk kitsendused. Iga filtri puhul tuleb valida, mis väljale või väljadele seda rakendatakse. Filtreid saab luua nii lihtsas otsingus (Simple Search) kui ka detailses otsingus (Advanced Search).

source: Current Search doesn't differentiate lower and upper case (except regex constraint). This means that searching for "President" also matches "president". If the case is important in the search, use regex constraint (see below).
et: Praegune otsing ei erista väikest ja suurt tähte (välja arvatud regulaaravaldisfiltrite puhul). See tähendab, et näiteks kui otsida sõna "President" siis kuvatakse ka dokumendid, kus leidub sõna ""president". Kui sinu otsing on siiski tõstutundlik, tuleb kasutada regulaaravaldisfiltreid (vt. allpool).

source: Simple Search
et: Lihtne otsing (Simple Search)

source: Simple search searches for a word or words on all fields in the chosen dataset(s). Multiple words must be separated with space (" "). The search returns documents where each word occurs at least in one of the fields.
et: Lihtsa otsingu puhul otsitakse sisestatud sõnu kõigilt andmestikus või andmestikes olevatelt väljadelt. Sõnad peavad olema eraldatud tühikuga (" "). Otsing kuvab kõik dokumendid, kus iga etteantud sõna leidub vähemalt ühel väljadest.

source: To use Simple Search, select it on the Current Search panel and type in the words you want to search for (:ref:`field <simple_search>` values).
et: Lihtsa ostingu kasutamiseks vali see praeguse otsingu paneelilt ja sisesta lahtrisse sõnad, mida sa soovid väljadelt otsida.

source: *Simple search*
et: *Lihtne otsing*

source: Advanced Search
et: Detailne otsing

source: Advanced search allows us to create different constraints for different fields. There are three types of constraints we can use: string constraints, date constraints, and texta_facts constraints.
et: Detailse otsinguga saab igale väljale luua erinevad filtrid. Filtrite tüüpe on kokku kolm: tekstifiltrid, kuupäevafiltrid ja texta_facts väljale rakendatavad filtrid.

source: To use Advanced Search, select it on the Current Search panel. After that select fields on which you want to use your constraint. Click anywhere in the toolkit to close the fields' selection. You should see a box where you can create your constraint (:ref:`field <string_search>`). You can remove the constraint by clicking on the ‘X’-sign on the upper right corner of the box.
et: Detailse otsingu kasutamiseks vali see praeguse otsingu paneelilt. Seejärel vali väljad, millel sa tahad filtrit rakendada. Rippenüü sulgemiseks kliki väljaspool seda menüüd. Avaneb kast, mille sees saad luua soovitud fitri (:numref:`string_search`). Filtri kustutamiseks kliki kasti üleval paremas nurgas oleval 'X'-märgil.

source: *Advanced search*
et: *Detailne otsing*

source: String constraint
et: Tekstifiltrid

source: Different search strings must be written to different lines. The search strings must be tied with one of the **Operator** from the table below:
et: Eri otsingusõnad tuleb kirjutada eraldi ridadele. Otsisõnu peab siduma loogikaoperaator (**Operator**) alljärgnevast tabelist:

source: Operators
et: Loogikaoperaatorid

source: Operator
et: Operaator

source: Meaning
et: Selgitus

source: and
et: ja (and)

source: all of the search strings (lines) are matched in the document
et: kõik (eri ridadel) olevad otsisõnad või -fraasid peavad dokumendis esinema

source: or
et: või (or)

source: at least one of the search string (lines) is matched in the document
et: vähemalt üks (eri ridadel) olevatest otsisõnadest või -fraasidest peab dokumendis esinema

source: not
et: ei (not)

source: the document must not match any of the given search string
et: dokumendis ei tohi esineda ühtegi etteantud otsisõna -või fraasi

source: You must also choose a **Match** rule. These are given in the table below:
et: Samuti tuleb sul valida reegel otsisõna sobitamiseks (**Match**). Need on toodud alljärgnevas tabelis:

source: Match
et: Sobitusreeglid

source: Match rule
et: Reegel

source: phrase prefix
et: prefiks (phrase prefix)

source: matches the beginning of the words (endings can differ, e.g. searching for 'bribe' gives us 'bribe', 'bribery', 'bribetaking', etc)
et: sobivad kõik sõnad või fraasid, mille algus vastab otsisõnele. Näiteks otsisõne 'jook' korral tagastaks ka dokumendid, kus sisaldub sõna 'jooksma', 'jooksin' jne

source: word
et: sõna (word)

source: finds exact word written (similar to simple search)
et: dokumendis peab leiduma otsisõne täpselt etteantud kujul (sarnaselt lihtsale otsingule)

source: phrase
et: fraas (phrase)

source: finds exact match for a phrase (more than one word in one line)
et: dokumendis peab leiduma otsifraas (rohkem kui üks sõna reas) täpselt etteantud kujul

source: regex
et: regulaaravaldis

source: takes the input as `a regular expression <https://www.rexegg.com/regex-quickstart.html>`_ and searches document accordingly. Nb! This is :ref:`Elasticsearch <elasticsearch>` syntax.
et: dokumendis peab leiduma `regulaaravaldisele <https://www.rexegg.com/regex-quickstart.html>`_ vastav sõne. NB! Kasutada tuleb :ref:`Elasticsearch'i <elasticsearch>` süntaksit.

source: Finally, there is a value called **Slop**. If any of your search strings contains multiple words, then this defines how many words can be between that search string words.
et: Viimaks on sul võimalus määrata väärtus parameetrile **Slop**. Juhul, kui mõni sinu otsisõne on tegelikult fraas ja koosneb rohkem kui ühest sõnast, siis **Slop** määrab, kui mitu muud sõna tohib sinu määratud otsisõnade vahel olla.

source: In figure :ref:`field <string_search>`, the string constraint is on the field named "text". The search will return documents that have either phrase "president Obama" or "president Trump" in it (or both). Since the Slop is 2, it also matches the phrase if it has 0-2 words between the words (e.g "president Barack Obama").
et: Joonisel :numref:`string_search` on tekstifilter loodud väljale *text*. Otsing kuvab dokumendid, kus leidub kas fraas "president Obama" või "president Trump" või mõlemad. Kuna parameetri **Slop** väärtus on 2, võib fraasi sõnade vahel olla 0-2 muud sõna. Seega tagastab otsing ka näiteks dokumendi, kus leidub fraas "president Barack Obama").

source: You can use an existing :ref:`lexicon <lexiconminer>` to create constraints. This can be done via button **Add lexicon** (visible only if there exist any lexicons in the :ref:`project <project_concept>`.
et: Otsisõnadena võib ka kasutada juba olemasolevat :ref:`leksikoni <lexiconminer>`. Seda saab teha, klikkides otsingupaneelil nupule **Add lexicon** (nähtav ainult siis, kui oled mõne leksikoni juba :ref:`projekti <project_concept>` lisanud.

source: Date constraint
et: Kuupäevafiltrid

source: Date constraint is for fields with type date. This outputs only documents where the field value is within the chosen time range (starting day included and ending day excluded). You can choose the time range by clicking on the little calendar on the right.
et: Kuupäevafiltreid saab kasutada *date*-tüüpi väljadel. Filter tagastab dokumendid, kus välja väärtus jääb valitud ajavahemikku (alguskuupäev kaasa arvatud ja lõppkuupäev välja arvatud). Ajavahemiku saad valida, klikkides väikesele kalendri ikoonile.

source: *Date constraint*
et: *Kuupäevafilter*

source: Texta_facts constraint
et: Välja *texta_facts* filter

source: Texta_facts constraint allows us to find documents with certain :ref:`fact <texta_fact>` names or fact values.
et: Välja *texta_facts* filter võimaldab dokumente filtreerida :ref:`faktide <texta_fact>` nimede ja väärtuste järgi.

source: **Creating a constraint over fact names**
et: **Fakti nime järgi filtreerimine**

source: *Fact name constraint with or*. Outputs all documents that contain at least one of the given fact name.
et: *Fakti nime filter operaatoriga or*. Kuvab kõik dokumendid, mille küljes on fakt vähemalt ühe etteantud fakti nimega.

source: **Using different constraints for different fact names**
et: **Erimevatel faktinimedel erinevate filtrite kasutamine**

source: In order to use different constraints for different fact names, you need to select field **texta_facts[fact_name]** multiple times.
et: Selleks, et lisada erinevatele faktinimedele erinevaid filreid, tuleb väljade menüüst valida välja **texta_facts[fact_name]** mitu korda.

source: *Fact name constraint*. Outputs documents that contain an ORG fact and definitely not PER fact.
et: *Fakti nime filter*. Kuvab dokumendid, mille küljes on fakt nimega ORG ja kindlasti mitte fakti nimega PER.

source: **Creating a constraint over fact values**
et: **Fakti väärtuse järgi filtreerimine**

source: *Fact value constraint*. Outputs documents that have an ORG fact with either value "NATO" or value "European Union" in it (or both).
et: *Fakti väärtuse järgi filtreerimine*. Kuvab dokumendid, mille küljes on fakt nimega ORG, mille väärtuseks on kas "NATO" või "European Union" või mõlemad.

source: Search Options
et: Lisavalikud otsingutulemuste kuvamisel

source: Look at the table below for the meanings of search options.
et: Alljärgnevas tabelis on kirjeldatud otsingutulemuste kuvamise lisavalikud.

source: Search options
et: Lisavalikud

source: Option
et: Valik

source: Highlight facts
et: Esiletõstetud faktid (Highlight facts)

source: highlights all the facts in the text
et: kõik teksis esinevad faktid on värviliselt esile tõstetud

source: Only highlight matching facts
et: Tõsta esile ainult sobitatud faktid (Only highlight matching facts)

source: highlights only the facts that were looked for
et: esile on tõstetud ainult faktid, mille alusel otsing tehti

source: Highlight searcher matches
et: Tõsta esile otsingu sobitused (Highlight searcher matches)

source: highlights string constraints' matches
et: esile on tõstetud kohad, mis sobituvad tekstifiltritega

source: Show short version
et: Näita lühiversiooni

source: shows certain amount of words before and after the match
et: näitab ainult väikest tekstiosa enne ja pärast otsingufiltri sobitust

source: *Search Options*
et: *Lisavalikud*

source: Advanced Search examples
et: Näidisotsingud

source: *Regex String Constraint*. Search for documents that have either "payoff" or "bribe[a-z]{0,2}" in it.The latter condition means that word ‘bribe’ can have 0-2 extra letters (e.g “bribe”, “bribed”, “bribery”) in the end.
et: *Regulaaravaldisfilter*. Kuvab kõik dokumendid, kus leidub sõna "payoff" või regulaaravaldisele "bribe[a-z]{0,2}" vastav sõne. Antud regulaaravaldis ütleb et sõna “bribe“ lõpus võib esineda 0-2 lisatähte (näiteks sobiksid sõnad “bribe”, “bribed” ja “bribery”).

source: *Combination of constraints*. Search for documents published in 2014, contain LOC facts with values "Russia" and "Ukraine" and the word "invasion".
et: *Filtrite kombinatsioon*. Kuvab kõik 2014. aastal avaldatud dokumendid, milles leidub fakt nimega LOC väärtustega "Russia" ja "Ukraine" ja sõna "invasion".

source: Browsing Search results
et: Otsingutulemuste sirvimine

source: After clicking the “Search” button, the matching documents are shown. (see :numref:`search_results`).
et: Klikkides nupule **Search** kuvatakse otsingufiltritele vastavad dokumendid. (vt :numref:`search_results`).

source: *Example search results*
et: *Näidis otsingutulemustest*

source: You can choose the columns that we would like to see from the drop-down menu right above the results. You can select or deselect all of them together (*Select all*) or by clicking on them separately.
et: Otsingutulemuste kohal olevast rippmenüüst on võimalik valida väljad, mida tulemustes kuvatakse. Neid saab lisada ja eemaldada nii ühekaupa kui ka korraga valiku *Select all* abil.

source: It is possible to hide the constraint panels with the *Toggle drawer* button.
et: Nupp *Toggle drawer* peidab otsingupaneeli.

source: Use arrows in the upper right to navigate between pages. You can also choose how many items per page you would like to see (also in the upper right corner).
et: Otsingutulemuste lehekülgede vahel liikumiseks kasuta üleval paremas nurgas olevaid noolekesi. Samast kohast on võimalik valida, mitu dokumendi ühel lehel kuvatakse.

source: *Select Fields for Search Results*
et: *Tulemustest kuvatavate väljade valimine*

source: API for scrolling can be found `here <https://rest-dev.texta.ee/api/v1/projects/1/scroll/>`_.
et: API tugi tulemuste lehtsemiseks on leitav `siit <https://rest-dev.texta.ee/api/v1/projects/1/scroll/>`_.

source: Saved Searches
et: Salvestatud otsingud

source: To save a search, click on the **disk** icon in the upper right corner of the Current Search panel. Saved searches can be used in other applications available in Texta Toolkit. For example, you can use a search as a set of positive samples when training a tagger or as a set of documents to be analyzed with Topic Analyzer. Or you might just want to save a search for browsing it later: to open it in the Current Search, simply click on the name of it.
et: Otsingu salvestamiseks kliki salvestusikoonile otsingupaneeli ülemises paremas nurgas. Salvestatud otsingute eeliseks on, et neid on võimalik kasutada Texta Toolkiti teistest rakendustest. Näiteks saad sa kasutada otsingut selleks, et koostada positiivsete näidete hulk taggeri treenimiseks või dokumendite kogu, mida teemaanalüsaatoriga analüüsida. Loomulikult võid sa otsingu salvestada ka lihtsalt selleks, et tulemusi hiljem uuesti sirvida: salvestatud otsingu aktiveerimiseks kliki selle nimel.

source: If you are curious, you can see the actual :ref:`Elasticsearch <elasticsearch>` :ref:`query <query_concept>` behind the search by clicking on the **eye** icon next to the disk icon.
et: Juhul, kui sind huvitab, kuidas sinu koostatud otsingule vastav :ref:`Elasticsearchi <elasticsearch>` :ref:`päring <query_concept>` päriselt välja näeb, kliki silmaikoonile (asub otsingu salvestusnupu kõrval).

source: API support for saving searches can be found `here <https://rest-dev.texta.ee/api/v1/projects/1/searches/>`_.
et: API tugi otsingute salvestamiseks on leitav `siit <https://rest-dev.texta.ee/api/v1/projects/1/searches/>`_.

source: Aggregations
et: Agregatsioonid (aggregations)

source: Aggregations tool allows us to aggregate the data. For example, we can use it to perform simple aggregations - retrieve item and word distributions.
et: Agregatsioonide tööriist võimaldab sul andmeid agregeerida. Näiteks võid seda kasutada selleks, et leida välja väärtuste või sõnade sagedusjaotusi.

source: For instance, let's assume we have a dataset containing posts from Estonian Reddit. We can use an aggregation over field *post_title* to find the most popular threads (see :numref:`significant_items`).
et: Eeldame illustreerimise eesmärgil, et meil on Toolkitis andmestik mingist ajaperioodist pärit eestikeelsete Redditi postitustega. Me saame agregeerida selle andmestiku välja *post_title*, et leida antud ajapeperioodi poplaarseim lõim (vt. :numref:`significant_items`).

source: *Significant items*
et: *Iseloomulikud väärtused (significant items)*

source: Now, knowing that the most popular thread is *Coronavirus megathread*, we might want to know what are the words that characterize the dataset when compared to other threads. In Texta Toolkit such words are called **significant words** and can be found with aggregations tool (see :numref:`significant_words`).
et: Teades nüüd, et kõige populaarsem lõim on *Coronavirus megathread*, võib meid huvitada, millised on need sõnad, mis iseloomustavad seda lõime võrlduses teiste lõimedega kõige paremini. Texta Toolkitis on selliste sõnade kohta kasutusel mõiste **significant words** ja need saab samuti tuvastada agregeerimise abil (vt :numref:`significant_words`).

source: *Significant words*
et: *Iseloomulikud sõnad (significant words)*

source: **How are the significance scores calculated?**
et: **Kuidas significance-skoori arvitatakse**?

source: In brief, a term is considered significant if there is a noticeable difference in the frequency in which a term appears in the subset and in the background.
et: Lühidalt öeldes on sõna või väärtus iseloomulik siis, kui seda esineb otsingule vastavates dokumentides märgatavalt rohkem kui ülejäänud dokumentides.

source: Besides these simple words and items aggregations shown above, there is still so much more that you can do with the tool.
et: Senimaani oleme vaadelnud lihtsamat sorti sõnade ja väärtuste agregeerimist. Tegelikult aga võimaldab agregatsioonide tööriist teha väga palju rohkemat.

source: For example, you can examine the distribution of the data over time (see :numref:`simple_time_aggregation`). Note that to produce such graphs, you must have a proper date field (in Texta date format) in the data.
et: Näiteks saab sellega uurida andmete jaotust üle huvipakkuva ajaperioodi. (vt. :numref:`simple_time_aggregation`). NB! Selliste graafikute tegemiseks peab kuupäeva sisaldav väli olema korrektselt kuupäevaformaadis.

source: *Time aggregation*
et: *Ajaagregatsioon*

source: If you have :ref:`texta_facts <texta_fact>` added to your data, you can visualize the frequencies of the values of one or more :ref:`facts <texta_fact>` (see :numref:`facts_aggre`). Note that on top of the plot in figure :numref:`facts_aggre`, there is a list with three visualization options. You can click on them to change how the results are displayed - whether hierarchically, as a table, or as a plot.
et: Kui sul on dokumentidel küljes ka :ref:`faktid <texta_fact>`, saad nende väärtuste esinemissagedust samuti visualiseerida (vt. :numref:`facts_aggre`). Joonisel :numref:`facts_aggre` on üleval keskel näha kolm ikooni. Neil klikkides saad muuta tulemuste visualiseerimise viisi - kas hierarhiliselt, tabelina või graafikuna.

source: *Facts aggregation*
et: *Faktide agregeerimine*

source: By creating a set of saved searches, we can visualize the time distribution of multiple subsets at once. For example, if we have a news articles datasets, we might want to know how often different politicians were mentioned in the news in different time periods (see :numref:`saved_searches_aggre`).
et: Salvestatud otsinguid kasutades on võimalik korraga visualiseerida mitme erineva alamhulga ajalist jaotust. Näiteks kui meie andmestik koosneb ajaleheartiklitest, võib meile huvi pakkuda, kui palju erinevaid poliitikuid on eri ajaperioodidel uudistes mainitud (vt. :numref:`saved_searches_aggre`).

source: *Saved searches aggregation*
et: *Salvestatud otsingute agregeerimine*
