Repository: texta-tk/texta-tk.github.io
Catalog: locale/*/LC_MESSAGES/tagger_group.po
Languages: et

source: :ref:`Tagger Group <tagger_group_concept>` is for training multiple classes at once and it also uses tags in the dataset given.
et: :ref:`Tagger Group-iga <tagger_group_concept>` saab treeniga mitme klassi klassifitseerimist korraga ning see kasutab andmestikus olevaid märgendeid.

source: **How do Tagger and Tagger Groups differ?**
et: **Kuidas erinevad Tagger ja Tagger Groups?**

source: One model predicts whether a text is positive (True) or negative (False). That is, whether this text gets the label or not. Tagger trains only one model and predicts whether a text is similar to the dataset it was trained on or not. Tagger Group trains several models at once. That means, it can predict several labels at once. Tagger Group trains on :ref:`facts <texta_fact>`. You can have several values under a certain :ref:`fact <texta_fact>` and for each value (if it has high enough frequency (*Minimum sample size*) a model is trained.
et: Üks mudel ennustab, kas tekst on positiivne (True) või negatiivne (False). St, kas tekst saab märgendi või mitte. Tagger treenib vaid ühe mudeli ning ennustab, kas tekst on sarnane sellele andmestikule / salvestatud otsingule, millel see treeniti. Tagger Group treenib mitu mudelit korraga. St, see võib ennustada mitu märgendit korraga. Tagger Group treenib end :ref:`faktide <texta_fact>` põhjal. Meil võib olla mitu erinevat väärtust ühe kindla fakti all ning iga väärtuse kohta (kui sellel väärtusel on piisavalt kõrge sagedus (*Minimum sample size*)) treenitakse eraldi mudel.

source: Creation
et: Loomine

source: Parameters
et: Parameetrid

source: Name of the Tagger model, which is also used as name of the tag while tagging the documents.
et: Tagger mudeli nimi.

source: The indices the model learns from.
et: Indeksid, mille peal mudel õppima hakkab

source: The :ref:`fields <field_concept>` the model learns from. If more than one fields is chosen, the fields are concatenated together before the learning process. One field is also enough. Usually lemmatized texts are preferred, especially with morphologically complex languages, because it increases the frequency of some words (*eaten*, *eats* and *ate* will change to its lemma *eat* and are dealt as one word).
et: :ref:`Väljad <field_concept>`, mis lähevad mudeli sisendiks. Kui valitakse rohkem kui üks väli, kleepitakse need väljad lihtsalt enne treenimisprotsessi kokku. Ka ühest väljast piisab. Tavaliselt eelistatakse lemmatiseeritud tekste, eritieriti morfoloogiliselt rikaste keelte puhul, kuna see tõstab mõnede sõnade sagedust (*söödud*, *sõi* and *sääb* saavad kõik oma lemmaks vormi *sööma* ja neid käsitletakse ühe sõnana).

source: Searcher's :ref:`query <query_concept>` for the dataset to be trained on. If *Query* is left empty, it will take all data in the active :ref:`project <project_concept>` as an input. You can also use saved searches as your desired input. This input will be the positive examples - later on, the Tagger tags data similar to this one.
et: Searcheri :ref:`otsing <query_concept>` sellele andmestikule, mille peal hakatakse treenima.Tühi *Query* võtab sisendiks kogu andmestiku aktiivses :ref:`projektis <project_concept>`. Soovitud sisendiks võib valida ka salvestatud otsingu. Salvestatud otsing on märgendajale positiivsete näidete kogum - hiljem märgendab mudel sellele otsingukogumile sarnaseid andmeid.

source: :ref:`Embedding <embedding_concept>` previously trained on the same dataset.
et: Eelnevalt sama andmestiku peal treenitud :ref:`sõnavektorid <embedding_concept>`.

source: Hashing Vectorizer, Count Vectorizer, Tfldf Vectorizer - read more about them `here <https://scikit-learn.org/stable/modules/feature_extraction.html>`_.
et: Hashing Vectorizer, Count Vectorizer, Tfldf Vectorizer - loe nende kohta rohkem `siit <https://scikit-learn.org/stable/modules/feature_extraction.html>`_.

source: *The maximum sample size* per class is for limiting the size of data the model trains on.
et: *Maksimaalne näidiste hulk* ühe klassi kohta limiteerib treeningandmestiku suurust.

source: *The negative multiplier* is for changing the ratio of negative examples.
et: *Negatiivse korrutaja* abil saab muuta negatiivsete näidete suhet positiivsetega treeningandmestikus.

source: Create a new Tagger Group model by clicking on the 'CREATE' button in the top-left. Then choose the parameters. After that, all that's left is hitting the "Create"-button (scroll down a bit), seeing the training process and the result of the tagger.
et: Uut Tagger Group mudelit saab luua vajutades üleval vasakul olevat '+CREATE' nuppu. Seejärel vali parameetrid ning vajuta "Create"-nuppu (vajadusel keri natukene all).Nüüd on järele jäänud treeningprotsessi järgmine ja Taggeri tulemuste vaatamine.

source: LinearSVC might give an error in case there's not enough data in the search.
et: LinearSVC võib anda errorit, kui otsingus ei ole piisavalt andmeid.

source: *Creating a Tagger Group*
et: Tagger Group-i loomine

source: Whenever we create new Tagger Group models, we can track its progress from the table under *Task*. If we click on the job, we can see all the training info, how long did it took, and check how successful it was. Let's not forget that:
et: Uue Tagger Group mudeli progressi saab jälgida tabelist, mis ilmub *Task*-i all. Kui me vajutame mudelile, näeme kogu treenimisinfot - kui kaua treenimine aega võttis ja kui edukas mudel on. Meeldetuletusena:

source: Recall is the ratio of correctly labeled positives among all true positives. Avg.recall is the average of all the models' recalls.
et: Recall ehk saagis on õigesti positiivseks märgendatute ja kõigi positiivsete elementide suhe. Avg.recall ehk saagise keskmine on kõigi mudeli saagiste keskmine.

source: Precision is the ratio of correctly labeled positives among all instances that got a positive label. Avg.precision is the average of all the models' precisions.
et: Precision ehk täpsus on õigesti positiivseks märgendatud ja kõigi positiivseks märgendatud elementide suhe. Avg.precision ehk täpsuse keskmine on kõigi mudeli täpsuste keskmine.

source: F1 score is the harmonic mean of these two and should be more informative especially with unbalanced data. Avg.F1_score is the average of all the models' F1 scores.
et: F1-skoor on nende kahe harmooniline keskmine ning peaks olema informatiivsem, eriti just tasakaalust väljas oleva andmestiku puhul. Avg.F1_score on kõigi mudeli F1-skooride keskmine.

source: *Created Tagger Group*
et: Loodud Tagger Group

source: In the table view, you can also select several Tagger Groups and delete them all at once by clicking on the dustbin button next to the *CREATE* button in the top-left. If you have several Tagger Groups, you can search for the right one by their description or task status. If you have models on several pages you can change pages in the top-right.
et: Tabeli vaates saame valida mitu mudelit korraga ja kustutada need, kasutades prügikasti nupukest *CREATE* nupukese kõrval üleval vasakul. Mitme Tagger Groups mudeli seast saab õiget otsida nende kirjelduse või *task status*-e kaudu. Kui mudeleid on palju, saad vahetada kuvamislehekülge üleval paremal.

source: Endpoint: **/projects/{project_pk}/tagger_groups/**
et: Otspunkt (endpoint): **/projects/{project_pk}/tagger_groups/**

source: Example:
et: Näidis:

source: Trained Tagger Group endpoint: **/projects/{project_pk}/tagger_groups/{id}/**
et: Treenitud Tagger Groupi otspunkt (endpoint): **/projects/{project_pk}/tagger_groups/**

source: Usage
et: Kasutus

source: *Models list* displays the models the Tagger Group trained. You can inspect which kind of labels were trained.
et: *Models list* kuvab mudeleid, mille Tagger Group treenis. Sealt saab vaadata, milliseid sildid/märgendid treeniti.

source: API endpoint: **/projects/{project_pk}/tagger_groups/{id}/models_list/**
et: API otspunkt (endpoint): **/projects/{project_pk}/tagger_groups/{id}/tag_text/**

source: *Tag text* is to check how does the model work. If you click on that, a window opens. You can paste there some text, choose to lemmatize it (necessary if our model was trained on a lemmatized text), and choose to use NER and post it. You then receive the result (all the labels which model predicted True for this text) and the probability of this label is true. Probability shows how confident is this model in its prediction. *Number of similar documents* is the number of most similar documents to the document in question. Tags given to these documents are tested on the document to be tagged.
et: *Tag text* aitab hõlpsasti kontrollida, kuidas mudel töötab. Sellele vajutades avaneb aken. Aknasse saab kleepida/kirjutada teksti, valida selle lemmatiseerimine (vajalik, kui mudel on treenitud lemmatiseeritud tekstil) ning seejärel see 'postitada' (vajuta *Post*-nuppu). 'Postitamine' väljastab tulemuse (kõik märgendid, mille kohta mudel ennustas sellele tekstile True) ja iga täägi kohta tõenäosuse (probability), et see märgend käib selle teksti kohta. Tõenäosus näitab, kui kindel on antud mudel oma ennustuses. *Number of similar documents* on antud dokumendiga sarnaste dokumentide arv. Nendele dokumentidele märgendatud märgendeid testitakse uue antud dokumendi peal.

source: API endpoint: **/projects/{project_pk}/tagger_groups/{id}/tag_text/**
et: API otspunkt (endpoint): **/projects/{project_pk}/tagger_groups/{id}/tag_text/**

source: Response:
et: Vastus:

source: *Tag doc* is similar to *Tag text*, except the input is in the JSON format. *Number of similar documents* is the number of most similar documents to the document in question. Tags given to these documents are tested on the document to be tagged.
et: *Tag doc* on sarnane *Tag text*-ile, ainult et sisend on JSON-formaadis. *Number of similar documents* on antud dokumendiga sarnaste dokumentide arv. Nendele dokumentidele märgendatud märgendeid testitakse uue antud dokumendi peal.

source: API endpoint **/projects/{project_pk}/tagger_groups/{id}/tag_doc/**
et: API otspunkt (endpoint): **/projects/{project_pk}/tagger_groups/{id}/tag_text/**

source: *Tag random doc* takes a random instance from your dataset, displays it, and returns the positive results of your models and the probability of these results being correct.
et: *Tag random doc* võtab suvalise dokumendi andmestikust, väljastab selle ja tagastab tulemused ja vastavatesse klassidesse kuulumise tõenäosuse.

source: API endpoint **/projects/{project_pk}/tagger_groups/{id}/tag_random_doc/**
et: API otspunkt (endpoint): **/projects/{project_pk}/tagger_groups/{id}/tag_text/**

source: *Edit* is for changing the description.
et: *Edit* on kirjelduse (description) muutmiseks.

source: *Models retrain* retrains all of the Tagger Group models with all the chosen parameters. It's useful in case your dataset changes or you have added some stop words.
et: *Models tagger* treenib kõik Tagger Group-i mudelid samade parameetritega uuesti.See on kasulik, kui andmestik muutub või juurde on tulnud uusi stopp-sõnu.

source: API endpoint **/projects/{project_pk}/tagger_groups/{id}/models_retrain/**
et: API otspunkt (endpoint): **/projects/{project_pk}/tagger_groups/{id}/tag_text/**

source: *Delete* is for deleting the model.
et: *Delete* kustutab mudeli.
