Repository: texta-tk/texta-tk.github.io
Catalog: locale/*/LC_MESSAGES/terminology.po
Languages: et

source: Terminology
et: Terminoloogia

source: Here are described the main concepts related to TEXTA Toolkit (TTK).
et: Siin kirjeldatakse TEXTA Toolkitiga (TTK) seotud põhilisi termineid.

source: Anonymizer is a tool for anonymizing names in a text-based on a predefined list of names. Each name detected from the text will be substituted with randomly generated pair of initials. You can read more about it :ref:`here <anonymizer>`.
et: Anonymizer ehk Anonüümija on tööriist vabatekstis esinevate isikunimede nimekirja aluselanonüümimiseks. Iga tekstist tuvastatud nimekirjas leiduv snimi asendatatkse juhuslikult genereeritud initsiaalidega. Loe rohkem selle kohta :ref:`siit <anonymizer>`.

source: Bert Tagger uses Google's state-of-the-art `Bidirectional Encoder Representations from Transformer <https://arxiv.org/abs/1810.04805>`_ for word embeddings. Read more about its Toolkit implementation :ref:`here <bert_tagger>`.
et: Bert Tagger kasutab Google'i `Kahesuunalist Enkodeerija Esitusi Transformeris <https://arxiv.org/abs/1810.04805>`_ sõnavektorite tarbeks.

source: Dataset Importer is a tool for conveniently uploading files into Elasticsearch to make them accessible for the Toolkit. Read more about the usage :ref:`here <dataset_importer>`.
et: Dataset Importer ehk Andmestike Importija on tööriist failide mugavaks laadimiseksElasticsearchi, et teha need Toolkitile kättesaadavaks. Loe selle kasutuse kohta rohkem :ref:`siit <dataset_importer>`.

source: Document importer provides API endpoints for adding, deleting and replacing documents one by one in or into a certain index in an easy way. Read more about the usage :ref:`here <document_importer>`.
et: Document Importer ehk Dokumendi Importija on kolm API otspunkti dokumentide üks-haaval lisamiseks, kustutamiseks ja asendamiseks kindlas indeksis. Loe nende kasutuse kohta rohkem :ref:`siit <document_importer>`.

source: Elasticsearch is a distributed, open-source search and analytics engine and database for all types of data. You can read more about it `here <https://www.elastic.co/what-is/elasticsearch>`_.
et: Elasticsearch on hajus vabavaraline otsingu ja analüüsi mootor ning andmebaas igasugusteandmete hoiustamiseks. Loe selle kohta rohkem `siit <https://www.elastic.co/what-is/elasticsearch>`_.

source: `Embedding <https://en.wikipedia.org/wiki/Word_embedding>`_ is a statistical model describing the distributional properties of words and phrases, which enables the computation of similarity between words and phrases. In TTK, embeddings are used for finding contextually similar keywords to extend search results (by building lexicons). Furthermore, vectors from word embeddings can also be used in neural classification models (:ref:`Taggers <tagger_concept>`, :ref:`Tagger Groups <tagger_group_concept>`, :ref:` Torch Tagger <torch_tagger_concept>`, :ref:`Taggers <bert_tagger_concept>`) in Texta Toolkit. TTK will also employ cross-lingual embeddings developed by EMBEDDIA to support multilingual text classification.
et: `Embedding ehk sõnavektor <https://en.wikipedia.org/wiki/Word_embedding>`_ on statistiline mudel, mis kirjeldab sõnade ja fraaside distributiivseid omadusi, võimaldades arvutada sõnade ja fraaside vahelisi semantilisi sarnasusi.TTK-s kasutatakse sõnavektoreid kontekstuaalselt sarnaste võtmesõnade otsimiseks Lexicon Mineris, et laiendada otsingutulemusi Searcheris.Vektoreid saab kasutada ka närvivõrkudel põhinevates klassifikaatorites (:ref:`Taggers <tagger_concept>`, :ref:`Tagger Groups <tagger_group_concept>`, :ref:` Torch Tagger <torch_tagger_concept>`, :ref:`Taggers <bert_tagger_concept>`). Varsti ilmuvad TTK-sse ka keelteülesed sõnavektorid, mida arendatakse EMBEDDIA projektis mitmekeelse teksti klassifitseerimise tarbeks.

source: Fact
et: Fakt

source: In TTK text annotations are regarded as facts:
et: TTK-s käsitletakse tekstimärgendeid faktidena:

source: Facts are objects with following properties:
et: Faktid on objektid järgnevate tunnustega:

source: fact - a name for the annotation (e.g. PER, LOC, or any arbitrary string)
et: fakt - märgendi nimi (nt PER, LOC, või suvaline sõne)

source: doc_path - path to the field containing the annotated string (e.g. "text", "text.author", "comment.text.author", etc.)
et: doc_path - tee väljani, mis sisaldab endas märgentatud sõnet. (Nt. "text", "text.author", "comment.text.author", etc.)

source: spans - JSON string containing the start and end positions in the annotated string
et: spans - JSON sõne, mis sisaldab märgendatud sõne algus- ja lõpupositsooni.

source: The Toolkit comes with several predefined fact names that are used by our Multilingual Processor:
et: Toolkitis on eeldefineeritud faktid, mida kasutab Mitmekeelne Eeltöötleja:

source: Label
et: Silt

source: Meaning
et: Tähendus

source: Comment
et: Kommentaar

source: Name of a person.
et: Inimese nimi

source: Organisation
et: Organisatsioon

source: Name of an organisation, gotten statistically.
et: Organisatsiooni nimi, saadud statistiliselt.

source: Location
et: Asukoht

source: Name of a location, gotten statistically.
et: Asukoha nimi, saadud statistiliselt

source: Company
et: Ettevõte

source: Names of companies registered in Estonia, gotten from `Estonian Open Data <https://opendata.riik.ee/datasets/ariregister/>`_.
et: Eestis registreeritud ettevõtete nimed, saadud `Estonian Open Data'st <https://opendata.riik.ee/datasets/ariregister/>`_.

source: Address
et: Aadress

source: Estonian address, gotten from `Estonian Open Data <https://opendata.riik.ee/datasets/aadressiandmed/>`_.
et: Eesti aadress, saadud`Estonian Open Data'st <https://opendata.riik.ee/datasets/aadressiandmed/>`_.

source: Drug
et: Ravim

source: Name of a medicine.
et: Ravimi nimi

source: Substance
et: Koostisosa

source: Ingredient of a drug.
et: Ravimi koostisosa

source: E-mail address.
et: E-maili aadress

source: Phone
et: Telefon

source: Phone number.
et: Telefoninumber

source: Own tag
et: Oma märgend

source: Tags we have trained in the Taggers under Models
et: Märgend, mis on treenitud Taggeriga

source: Table 1. *Predefined Fact Names used by Multilingual Processor*
et: Tabel 1. *Eeldefineeritud Faktide Nimed, mida kasutab Mitmekeelne Eeltöötleja*

source: It is important to notice that COMPANY and ADDR identify only companies and addresses registered in Estonian Open Data. It won't tag any foreign company nor address while ORG and LOC identify all of them.
et: Oluline on märgata, et COMPANY ja ADDR märgendavad vaid neid ettevõtteidja aadresse, mis on registreeritud Estonian Open Datas. See ei märgenda ühtegi välismaa firmat või aadressi. ORG ja LOC märgendavad kõiki.

source: Field
et: Väli

source: Each document is a collection of fields. Field is a separated piece of information in that document. For example, we can have an article with fields containing the text, the date of publishing, headline, etc.
et: Iga dokument on väljade kogum. Väli on eraldatud informatsioonikild antud dokumendi kohta. Näiteks võivad artiklil olla väljad, mis sisaldavad artikli sisu tekstina, avaldamiskuupäeva, pealkirja jne.

source: Server health is a comprehensive overview of the status and performance of individual servers. It includes hardware parameters and, in our case, the TTK version numbers and the state of needed services. See :ref:`here <health>` how to check TTK's health.
et: Serveri tervis annab ülevaate erinevate serverite staatustest ja jõudlusest, sealhulgas ka riistvara parameetreid ja TTK puhul TTK versiooninumbreid ja kasutatavate teenuste seisundeid. Loe rohkem :ref:`siit <health>`, kuidas kontrollida TTK tervist.

source: Index
et: Indeks

source: `Elasticsearch's index <https://www.elastic.co/blog/what-is-an-elasticsearch-index>`_ is a collection of documents in Elasticsearch. In Search output the table consists of all the suitable documents filtered out from that index and one row indicates a document.
et: `Elasticsearchi indeks <https://www.elastic.co/blog/what-is-an-elasticsearch-index>`_ on dokumentide kogum Elasticsearchis. Searcher-i väljund koosneb sobivatest väljafiltreeritud dokumentidest antud indeksi(te)st ning üks rida on üks dokument.

source: Lexicon Miner is a tool for creating topic-related lexicon. It uses :ref:'embeddings <embedding_concept>' for finding words used in similar context. Read more about its usage :ref:`here <lexiconminer>`.
et: Lexicon Mineri abil saab luua temaatiliste sõnade leksikone. See kasutab:ref:'sõnavektoreid <embedding_concept>' sarnases kontekstis kasutatud sõnade leidmiseks. Loe rohkem selle kasutuse kohta :ref:`siit <lexiconminer>`.

source: Multilingual Preprocessor (MLP)
et: Mitmekeelne Eeltöötleja (MLP)

source: MLP offers different analyzing options that give more features (information) for machine learning applications in TTK and helps to parse the information out of textual data user is interested in. Read more about the usage :ref:`here <mlp_p>`.
et: MLP pakub erinevaid analüüsivõimalusi, mis pakuvad lisatunnuseid (informatsiooni) masinõpet kasutatavatele rakendustele TTKs ning aitab tuvastada tekstiandmestikust kasutajale huvipakkuvat infot. Loe rohkem selle kasutuse kohta :ref:`siit <mlp_p>`.

source: Project
et: Projekt

source: Project is the main unit of access and management for datasets and resources (embeddings, text classifiers, etc.). A project is defined by its description, list of Elasticsearch indices related to the project (this is where the data is!), and a list of users who can access the project and its resources. All resources in TTK belong to some project and by adding or removing users, one can manage their access to the project.
et: Projekt on andmete ja ressursside (nt sõnavektorite, klassifikaatorite jne) haldamise põhiühik.Projekti defineerivad selle nimi, projektiga seotud Elasticsearchi indeksid (ehk projektiandmed!) ja nimekiri kasutajatestkes saavad sellele projektile ligi.Kõik ressursid TTKs kuuluvad mingisse projekti ning kasutajate projekti lisamise või sealt kustutamise kaudu saab hallata ligipääse ressurssidele.

source: Project is active when it is chosen in the upper panel on the right. Read more about projects :ref:`here <project>`.
et: Projekt on aktiivne, kui see on valitud ülal paremal nurgas. Loe rohkem projektide kohta :ref:`siit <project>`.

source: Query
et: Päring

source: `Elasticsearch's query <https://www.elastic.co/guide/en/elasticsearch/reference/current/query-dsl.html>`_ is a little JSON command that retrieves objects with given attributes from Elasticsearch. It can be thought of as subset of the dataset the query is performed on. Queries can be used in various Toolkit's tools and it can be saved under the :ref:`Searcher <search_concept>` as saved search for using it later or in other tools.
et: `Elasticsearchi päring <https://www.elastic.co/guide/en/elasticsearch/reference/current/query-dsl.html>`_ on väike JSON-formaadis käsk, mis otsib Elasticsearchist välja teatud atribuutidega objekte. Neist võib mõelda, kui päringu saanud andmestiku alamhulgast. Päringuid võib kasutada erinevates Toolkiti tööriistades ja neid saab selle või hiljem uuesti otsimise jaoks salvestada :ref:`Searcheris <search_concept>`.

source: Regex Tagger is a tool for tagging texts based on pattern matches. The user can define patterns (words/phrases/regexes) to search from the text and fine-tune a variety of parameters to extract specific information and tag the text based on the information retrieved. Read more about its usage :ref:`here<regex_tagger>`.
et: Regex Tagger on tööriist tekstide mustripõhiseks märgendamiseks regulaaravaldiste abil.Kasutaja saab defineerida mustreid (sõnu/fraase/regexeid), mida otsida tekstist, ning kindla informatsiooni eraldamiseks ja saadud informatsiooni põhjal tekste märgendamiseks peenhäälestada mustrite ja otsingute parameetreid. Loe rohkem selle kasutuse kohta :ref:`siit<regex_tagger>`.

source: Regex Tagger Group allows combining different Regex Taggers. Read more about its usage :ref:`here<regex_tagger_group>`.
et: Regex Tagger Group laseb kombineerida erinevait Regex Taggereid. Loe rohkem selle kasutuse kohta :ref:`siit<regex_tagger_group>`.

source: Reindexer is a tool for making copies or subsets of Elasticsearch :ref:`indices <index_concept>`. Reindexer can be used for various data management tasks:
et: Reindexer on tääriist Elasticsearchi :ref:`indeksitest <index_concept>` koopiatevõi alamhulkade loomiseks. Reindexeri saab kasutada erinevateks andmehaldamise ülesanneteks:

source: Making a copy of an index;
et: Andmestikust koopia loomiseks;

source: Merging multiple indices into one;
et: Mitme andmestiku liitmiseks;

source: Making a random subset of an index;
et: Alusandmestikust juhulsikult valitud dokumentidega alamhulga loomiseks;

source: Making a subset based on a predefined query;
et: Eeldefineeritud kitsenduste ehk päringute alusel andmestiku alamhulga loomiseks;

source: Renaming fields;
et: Väljade ümbernimetamiseks;

source: Updating Elasticsearch field types.
et: Väljade Elasticsearchi andmetüübi muutmiseks.

source: Read more about it :ref:`here <reindexer>`.
et: Loe rohkem nende kohta :ref:`siit <reindexer>`.

source: One of the most central components in TTK is Search, which is used to define subsets of data for training text classification models and performing various aggregations. Search is managed via GUI and can contain one or more constraints on feature values (e.g. strings and dates). Documents matching the search criteria can be used in various actions/functionalities in TTK, e.g. extraction of relevant keywords, data summarization and exploration, and training text classifiers. Read more about it :ref:`here <searcher>`.
et: Seda üht TTK kesksemaid komponenti kasutatakse erinevate agregatsioonide tegemiseks ning klassifiteerjate treenimise tarbeks alamhulkade defineerimiseks. Searchi kasutatakse GUI kaudu ja selle abil saab defineerida ühe või enam piirangut väljade väärtustele (nt sõned ja kuupäevad). Piirangutele vastavaid Searcheri abil leitud dokumente saab kasutada erinevates rakendustes TTK-s, nt asjakohaste võtmesõnade eraldamises, andmete üldistamises ja uurimises ning tekstiklassifitseerijate treenimises. Loe rohkem selle kohta :ref:`siit <searcher>`.

source: Taggers are monolingual binary text classifiers used to predict tags for documents, e.g. whether a tweet is toxic or talking about Brexit. Taggers are trained using a subset of documents defined by a TTK search or a raw Elasticsearch query (big ugly JSON object). The subset of documents defines the “positive” set of examples (the documents about the topic being tagged), whilst “negative” examples will be selected automatically (to be unlike the positive ones). TTK taggers are trained using scikit-learn pipelines and include models like logistic regression and SVM. TTK automatically splits the training data into training and testing data (by default 80-20) and applies grid search combined with k-fold cross-validation to identify best hyperparameters. An SVM model is also used for feature selection to remove unimportant features from the model making it smaller. For features, both word-based and character-based n-grams are used. Read more about it :ref:`here <tagger>`.
et: Taggerid on ükskeelsed binaarsed teksti klassifitseerijad, mis ennustavad dokumentidele märgendeid (nt kas antud säuts on toksiline või räägib Brexitist). Taggereid treenitakse TTK Searcheris salvestatud andmete alamhulkade (otsingute) või toorete Elasticsearchi päringute põhjal. See otsing või päring defineerib 'positiivsed' näited (dokumendid selle teema kohta, mida hakatakse märgendama). 'Negatiivsed' näited valitakse automaatselt (võimalikult erinevad positiivsetest). TTK Taggereid treenitakse scikit-learn konveieriga (pipeline) ja kasutab mudeleid nagu SVM ja logistiline regressioon. TTK jagab treeningandmestiku automaatselt treening- ja valideerimisandmestikuks (vaikimisi 80%-20%) ja kasutab võreotsingu meetodit kombineeritud k-korda ristvalideerimise meetodiga parima hüperparameetrite tuvastamiseks. SVM mudelit kasutatakse tunnuste valikus - mudeli väiksemaks tegemiseks eemaldatakse ebaolulised tunnused. Tunnuseid kasutatakse nii sõna- kui ka karakteripõhiselt. Loe rohkem Tagger-ite kohta :ref:`siit <tagger>`.

source: Tagger Group is an extension to TTK’s binary taggers to support monolingual multi-label classification. As its name suggests, Tagger Groups incorporate multiple (binary) taggers, which are executed in parallel to produce a list of tags to the user. Tagger Group has been successfully tested with over 6000 binary models and prediction times are usually less than 1 second. To achieve this, TTK has employed a hybrid approach for multi-label tagging, which uses unsupervised machine learning (document vectors) to limit the number of binary models used for prediction. In such a scenario, the input document is compared to training data to determine the most probable models to produce valid tags. Read more about it :ref:`here <tagger_group>`.
et: Tagger Group on TTK binaarsete Taggerite laiendus, mis toetab ühekeelset mitme märgendiga samaaegset märgendamist. Nagu nimigi viitab, saab Tagger Groupi abil treenida mitut binaarset märgendit korraga. Tagger Groupi on edukalt testitud üle 6000 binaarse mudeliga - ennustusajad jäävad üldjuhul ikka alla ühe sekundi. Taolise kiiruse saavutamiseks kasutab TTK mitme märgendi märgendamise meetodit, mis kasutab juhendamata masinõpet (dokumendi vektoreid) ennustamisele minevate binaarsete mudelite piiramiseks. Selle jaoks võrreldakse sisenddokumenti treeningandmestikuga ning ennustatakse vaid nende märgendite mudelitega, mis leiduvad sarnaseimate dokumentide juures. Loe rohkem selle kasutuse kohta :ref:`siit <tagger_group>`.

source: TEXTA Toolkit allows building several different statistical models to process the text. The training process is initiated via TTK API or GUI, which results in creating the object in TTK data model and starting the asynchronous training task. Tasks are data objects for keeping track of the training progress of trainable statistical models.
et: TEXTA Toolkiti abil saab luua mitmeid erinevaid statistilis mudeleid teksti töötlemiseks. Treeningprotsessi alustatakse TTK API või GUI kaudu, mis tekitab TTK andmemudelisse objekti ja alustab asünkroonset treeningülesannet (training task). Ülesanded on andmeobjektid, mille abil saab hoida silma peal treenitavate statistiliste mudelite treenimise arengul.

source: Topic Analyzer
et: Teemaanalüsaator

source: Topic Analyzer is a tool that detects groups of similar documents in the data. It can be used for example to explore the structure of the unlabeled data to get an understanding of what it contains. However, the main purpose of the tool is to take it one step further and make actual use of one's exploration by transforming their discoveries into the labelling. It can then be used to build supervised machine learning models.
et: Teemaanalüsaator on tööriist, mis tuvastab sarnaste dokumentide gruppe andmestikust. Seda saab kasutada näiteks märgendamata andmestiku struktuuri uurimiseks, et saada aimu, mida see endas sisaldab. Tööriista peamine eesmärk on siiski astuda samm edasi ja kasutada saadud avastusi ära ning muuta kasutaja avastused märgenditeks. Seda saab seejärel kasutada juhendatud masinõppe mudelite treenimiseks.

source: Topic Analyzer puts to use the best parts of unsupervised clustering and manual labelling. While clustering is a fast and efficient method to create groups of rather similar texts, it still lacks preciseness required to use these clusters as labelling of the data. For example, while some clusters may indeed contain similar documents, some other will completely fail in capturing the similarity and most of them will probably be so-and-so.
et: Teemaanalüsaator kasutab ära juhendamata klasterdamise ja käsitsi märgendamise parimaid palu. Klasterdamine on kiire ja tõhus meetod sarnaste tekstide gruppide moodustamiseks. Samas pole see piisavalt täpne andmestiku märgendamise jaoks. Näiteks võivad mõned klastrid tõepoolest sisaldada ainult sarnaseid dokumente. Samas mõni teine võib totaalselt ebaõnnestuda sarnasuse tabamisel ja mõni võib ainult enam-vähem hakkama saada.

source: Topic Analyzer allows user to look inside each cluster and make the decision about the quality manually. Users can also perform various actions on the cluster: remove documents, add more similar documents, and move documents to another more suitable cluster. Finally, the user can choose to label the documents inside the cluster if it has reached a sufficient quality.
et: Teemaanalüsaator laseb kasutajal vaadata klastrite sisse ja otsustada käsistsi nende kvaliteedi üle. Lisaks saavad kasutajad: eemaldada dokumente, lisada juurde sarnaseid dokumente ja liigutada dokumente ühest klastrist teise. Kui klaster on valmis, saab kasutaja valida märgendi, millega antud klastrile sarnaseid dokumente märgendama hakata.

source: Read more about its usage :ref:`here <topic_analyzer>`.
et: Loe rohkem selle kasutuse kohta :ref:`siit <topic_analyzer>`.

source: While Taggers and Tagger Groups use classical machine learning to produce binary classification models, Texta Toolkit also incorporates deep neural models for binary and multi-class text classification. As the models are all programmed using PyTorch, the TTK’s component is called Torch Tagger.
et: Tagger ja Tagger Group kasutavad klassikalisi masinõppe meetodeid binaarsete klassifitseerimismudelite loomiseks. TTK-s on ka Torch Tagger, mis on saanud oma nime PyTorchi järgi, milles Torch Tagger programmeeritud on. Torch Tagger kasutab tehisnärvivõrke binaarseks või mitmeklassiliseks klassifitseerimiseks.

source: It allows for the user to use several state-of-art text classification models, including fastText, TextRNN using bi-direction LSTM networks, RCNN using recurrent convolutional neural nets. Since all models have been developed using PyTorch, introducing new models is fairly straightforward. TorchTagger models also include the possibility to use pre-trained word vectors (e.g. Word2Vec trained in TTK) in the embedding layer of the models. To create data processing pipelines, Torch Tagger uses torchtext package. Torch Tagger has been validated on monolingual toxic comment detection, reaching accuracy and F1-score of 96%. Read more about its usage :ref:`here <torch_tagger>`.
et: Sellega saab kasutada mitmeid tipptasemel tekstiklassifitseerimismudeleid nagu fastText, TextRNN kahesuunaliste LSTM närvivõrkudega ja RCNN rekurrentsete konvolutsiooniliste närvivõrkudega. Kuna kõik mudelid on arendatud PyTorchis, on nende kasutamine üsna selge. Torch Taggeri mudelid pakuvad ka võimalust kasutada eeltreenitud sõnavektoreid (nt TTK-s treenitud Word2Vec-i). Andmete eeltöötlemise konveierite loomiseks kasutab Torch Tagger torchtext pakki. Torch Tagger on valideeritud ühekeelsel toksiliste kommentaaride tuvastamisel, saavutades õigsuse ja F1-skooriks 96%. Loe rohkemselle kasutuse kohta :ref:`siit <torch_tagger>`.

source: User Account and Authentication is an identity management service for making sure that only selected users have access to certain datasets. Read more about it :ref:`here <uaa>`.
et: User Account and Authentication ehk Kasutaja Konto ja Autentimine on identiteedi haldamise teenus, mis kindlustab, et vaid valitud kasutajad saavad ligipääsu teatud andmetele. Loe selle kohta rohkem :ref:`siit <uaa>`.
