Repository: texta-tk/texta-tk.github.io
Catalog: locale/*/LC_MESSAGES/topic_analyzer.po
Languages: et

source: Topic Analyzer
et: Teemaanalüsaator

source: There exists an API for topic analyzer too, but the magic of the analyzer dissappears when using API.
et: Kuigi teemaanalüsaatorit saab kasutada ka API kaudu, seisneb selle peamine väärtus on siiski graafilises kasutajaliideses ning seetõttu pole API kasutamist siin kirjeldatud.

source: Create
et: Loomine

source: Navigate to **Tools -> Topic Analyzer** and click on the **CREATE** button on top-left. Choose the name for your :ref:`Analyzer <topic_analyzer_concept>` (*Description*). Define the :ref:`query <query_concept>` and select indices on which the :ref:`query <query_concept>` will be executed. If you leave *Query* empty, it will take all documents from the selected indices. If you have any searches defined in your :ref:`project <project_concept>`, they will appear in a dropdown menu if you click on the field *Query* - you can use existing searches as queries.
et: Liigu **Tools -> Topic Analyzer** . Klõpsa nuppu **CREATE** üleval vasakus nurgas. Vali :ref:`Analüsaatorile <topic_analyzer_concept>` (*Description*) nimi. Määra :ref:`päring <query_concept>` ning indeksid, millele seda :ref:`päringut <query_concept>` rakendatakse. Kui *Query* on tühi, võetakse kõik dokumendid valitud indeksi(te)st. Kui antud :ref:`projektis <project_concept>` on varsemalt päringuid otsingutena salvestatud, ilmuvad need rippmenüüna *Query* väljale klõpsates - nii saad kasutada olemasolevaid otsinguid päringutena.

source: Choose *fields* on which the clustering is done. The selected fields should contain textual data.
et: Vali *väljad*, mille sisu hakatakse klasterdama. Valitud väljad peaksid sisaldama tekstiandmeid.

source: It is recommended to use lemmatized or tokenized data. Lemmatization is especially useful with morphologically complex languages. You can tokenize and lemmatize the data with :ref:`MLP <mlp>`.
et: Soovitame kasutada lemmatiseeritud või tokeniseeritud andmestikku. Lemmatiseerimine on eriti kasulik morfoloogiliselt keerukate keelte puhul. Tekstiandmeid saab tokeniseerida ja lemmatiseerida :ref:`MLP <mlp>`-ga.

source: *Embedding* - if selected then its phraser is used for tokenization. You can leave it empty as well.
et: *Embedding* - selle fraasijat kasutatakse tokeniseerimiseks. Selle võib jätta ka tühjaks.

source: *Keywords filter* - defines a filter (as a regular expression) for unwanted significant words.
et: *Keywords filter* - määrab (regulaaravaldisena) filtri sõnadele, mida me ei soovi klastrit iseloomustavate sõnadena näha.

source: *Stopwords* - custom stopwords to ignore during clustering.
et: *Stopwords* - sõnad, mida klasterdamisel ignoreeritakse

source: *Clustering algorithm* - an algorithm to use for clustering. Minibatchkmeans is a time efficient variant of kmeans with a potential tradeff in quality. *Vectorizer* - a method for creating document vectors.
et: *Clustering algorithm* - klasterdamiseks kasutatav algoritm. Minibatchmeans on kmeans algoritmi ajatõhusam variant, seda potentsiaalselt kvaliteedi arvelt. *Vectorizer* - meetod dokumendivektorite loomiseks.

source: *Num cluster* - number of final clusters.
et: *Num cluster* - loodavate klastride koguarv.

source: *Num dims* - maximum possible dimension of document vectors.
et: *Num dims* - maksimaalne võimalik dokumendivektorite dimensioon.

source: *Num topics* - number of dimensions when *Use LSI* is selected.
et: *Num topics* - dimensioonide arv, kui *Use LSI* on valitud.

source: *Use LSI* - if selected then high dimensional document-term vectors are reduced into lower dimensional vectors that base on "topics".
et: *Use LSI* - kui valitud, siis kõrge dimensioonide arvuga dokument-termini vektorid vähendatakse väiksema dimensioonide arvuga vektoriteks, mis põhinevad "teemadel".

source: **How to choose the number of clusters?**
et: **Kuidas valida klastrite arvu?**

source: General advice would is to better have too many clusters than too few. Think about how many documents you are planning to cluster and choose the number so that the average cluster is small enough to inspect it manually with ease. For example, if you are going to cluster 1000 documents to 50 clusters then average cluster would contain 20 documents.
et: Üldine soovitus on pigem valida liiga palju klastreid kui liiga vähe. Võta arvesse, kui palju dokumente plaanid klasterdada ja vali number nii, et keskmine klaster on piisavalt väike hõlpsaks käsitsi kontrollimiseks. Näiteks kui klasterdad 1000 dokumenti 50 klastrisse, siis keskmiselt klastris peaks olema 20 dokumenti.

source: *Creating a Clustering*
et: *Klasterduse loomine*

source: Viewing clusters
et: Klastrite vaatamine

source: Click *View clusters* under Actions. You will see an overwiew about obtained clusters. For each cluster the document count and average cosine similarity between its documents is given as well as a list of significant words.
et: Klõpsa kolmele täpile Action veerus ja vali *View clusters*. Avaneb ülevaade tekkinud klastritest. Iga klastri kohta on antud dokumentide arv, keskmine dokumentidevaheline koosinussarnasus ning klastrile iseloomulike sõnade nimekiri.

source: *Clusters view*
et: *Klastrite vaade*

source: **Interpreting document count**
et: **Dokumentide arvu tõlgendamine**

source: Cluster with significantly larger document count often indicates that the clustering algorithm has failed to separate these documents by the topic. It doesn't necessarily mean that the clustering process in general has been unsuccessful as often it is impossible to cluster all documents perfectly. However, you still might want to take a closer look to such clusters as there may be other reasons for such results as well. For example, the documents in that cluster may contain similar noise or stopwords that makes them artifically similar to each other. Sometimes increasing the number of clusters might help as well.
et: Teistest märkimisväärselt suurema dokumentide arvuga klaster viitab sellele, et klasterdamisalgoritm ei suutnud eristada dokumente teemade kaupa. See ei tähenda ilmtingimata, et klasterdamine polnud edukas, kuna tihti on võimatu klasterdada kõik dokumendid edukalt. Taolisi klastreid tasub siiski hoolikalt uurida - sellel võib olla teisi põhjuseid ka. Näiteks võivad selle klastri dokumendid sisaldada sarnast müra või stoppsõnu, mis teeb neid kunstlikult üksteisele sarnasemaks. mõnikord võib aidata ka klastriarvu tõstmine.

source: **Interpreting average similarity**
et: **Keskmise sarnasuse tõlgendamine**

source: Average similarity is an average cosine similarity between all the documents in the cluster. It ranges between 0 and 1 and higher score indicates that the documents in that cluster are more similar to each other. However, the score has some disadvantages. For example, when a cluster contains 9 documents that are very similar to each other and 10th document is very different from all others, then the score might appear low althought fixing that cluster would be very easy.
et: Keskmine sarnasus on keskmine koosinussarnasus klastris kõikide dokumentide vahel. See on vahemikus 0 kuni 1 ning kõrgem skoor viitab suuremale sarnasusele. Sellel skooril on ka puuduseid. Näiteks, kui klastris on 9 dokumenti, mis on üksteisele väga sarnased ning 10 dokument on teistsugune, siis võib skoor tunduda madal, kuigi taolise klastri parandamine on väga kerge.

source: Viewing documents inside cluster
et: Dokumentide vaatamine klastri sees

source: Click on a cluster that is in your interest, this opens you a detailed view of a cluster content.
et: Vajuta klastrile, mis pakub huvi. See avab klastri sisu detailvaates.

source: Operations with the cluster
et: Tegevused klastriga

source: Tag documents
et: Märgenda dokumente

source: If the cluster contains documents from the same topic it is advisable to tag the documets and delete the cluster. Click on **Tag** button. This operation adds a texta_fact to each of the document in the cluster, with specified name and a string value. **From now on, these documents will be ignored in further clustering processes**
et: Kui klaster sisaldab samateemalisi dokumente, on saad need dokumendid ära märgendada ning klastri kustutada. Klõpsa **Tag** nupule. Selle abil saab lisada texta facti igale dokumendile selles klastris vabalt valitud nime ja väärtusega. **Edaspidi ignoreeritakse neid dokumente klasterdades**.

source: Delete documents
et: Kustuta dokumente

source: This functionality is useful if some documents in the cluster are from a different topic and you want to remove them - select the documents that you want to remove and click on **trash bin** icon.
et: See funktsionaalsus on kasulik, kui mõned dokumendid antud klastris on teisest teemast ning on vaja need eemaldada - vali dokumendid, mida soovid eemadlada ning klõpsa **prügikasti** ikoonile.

source: Add more documents
et: Lisa veel dokumente

source: You might want to know whether there exists more documents similar to the ones in the cluster, and if so, add those to the cluster as well, so you could tag them all together. Click on a "More like this" button to query similar documents. In the opened view, select document which you would like to add to the cluster and click on a **+** button.
et: Ilmselt tahad sa teada, kas andmestikus on veel dokumente, mis on sarnased juba klastris olevatele. Sel juhul saad need dokumendid ka samasse klastrisse lisada, et oleks võimalik neid koos märgendada. Vajuta "More like this" nupule, et leida sarnaseid dokumente. Avanenud vaates vali dokumendid, mida soovid klastrisse lisada ning vajuta **+** nupule.

source: Delete the cluster
et: Kustuta klaster

source: It is advisable to delete the cluster after you have tagged it. Click on **Delete** button to do it.
et: Soovitame kustutada klastri, kui oled selle ära märgendanud. Selleks vajuta **Delete** nuppu.

source: *Cluster details view*
et: *Klastri detailvaade*
